@extends('home::layouts.master')

@section('title','نتیجه تست mbti')

@section('content')
    <div class="container">
        <div id="testForm">
            <div class="tabResult row mx-0 my-4">
                <div class="boxResult row mx-0 justify-content-center">
                    <div class="col-12 mt-4">
                        <div class="row title">
                            <div class="col-1"><i class="mdi mdi-tag-multiple c-first-200" style="font-size: 70px"></i></div>
                            <div class="col-9"><h4>نتیجه تست mbti</h4></div>
                            <div class="col-2 mbtiTitle text-center">{{ strtoupper($scoreArray['mbti']) }}</div>
                        </div>
                        @if($scoreArray['mbti'] == 'intj')
                            <p class="mt-5">گاهی اوقات به این تیپ شخصیتی، معمار یا راهبرد پرداز هم گفته می‌شود. افراد دارای این تیپ شخصیتی، بسیار تحلیلگر، خلاق و منطقی هستند. به گفته دیوید کیرسی روانشناس، طراح پرسشنامه Keirsey Temperament Sorter در حدود یک تا چهار درصد از جمعیت را تیپ شخصیتی INTJ تشکیل می‌دهد.
                                پرسشنامه MBTI یکی از محبوب‌ترین ابزارهای سنجش روانشناختی است ولی شواهد مربوط به اعتبار و روایی آن، مورد بحث است. اگر پرسشنامه MBTI را اجرا کرده‌اید در بررسی مفهوم نتایج آن، جانب احتیاط را رعایت کنید.
                                در این مقاله مروری اطلاعات بیشتری در مورد شخصیت INTJ یاد می‌گیرید. با این حال نباید این ابزار را جایگزین مشاوره حرفه‌ای، بهداشتی و روانشناسی در نظر گرفت.
                            </p>
                            <h4 class="mt-5">ویژگیهای اصلی تیپ شخصیتی INTJ</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>این تیپ شخصیتی درونگرا، کار انفرادی را ترجیح می‌دهد.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها افرادی کلی نگر هستند و اطلاعات انتزاعی را به جزئیات دقیق ترجیح می‌دهند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به اطلاعات منطقی و عینی بیشتر از هیجانهای ذهنی اهمیت می‌دهند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INTJ دوست دارند که دنیای خودشان را تحت کنترل درآورند و به آن نظم دهند؛ بنابراین از قبل به خوبی برنامه ریزی می‌کنند.</li>
                            </ul>
                        @elseif($scoreArray['mbti'] == 'estp')
                            <p class="mt-5">افراد دارای این تیپ به صورت افرادی معاشرتی، عملگرا و نمایشی توصیف می‌شوند. این افراد اجتماعی از وقت گذراندن با گروه گسترده‌ای از دوستان و آشنایان، لذت می‌برند. آن‌ها به زندگی در زمان حال علاقمند هستند و به جای در نظر گرفتن دیدگاه گسترده، روی جزئیات متمرکز می‌شوند.
                                افراد دارای این تیپ، افرادی منطقی هستند. آن‌ها در حین تصمیم گیری بیشتر از احساسات فردی به مسائل عینی توجه دارند. آن‌ها علاقه‌ای به برنامه ریزی افراطی ندارند. در عوض به کارهای بداهه و در نظر گرفتن تمامی گزینه‌های موجود، علاقه دارند.
                                به گفته دیوید کیرسی روانشناس سازنده پرسشنامه Keirsey Temperament Sorter در حدود ۴ تا ۱۰ درصد از جمعیت را تیپ ESTP تشکیل می‌دهد. این تیپ یکی از متداول‌ترین تیپ‌های شخصیت است.
                            </p>
                            <h4 class="mt-5">ویژگیهای اصلی تیپ شخصیتی ESTP</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>به سرعت تصمیم می‌گیرند: آن‌ها در صورت مواجه با مشکلات به سرعت واقعیت‌ها را بررسی می‌کنند و به سریعترین راه حل می‌رسند. آن‌ها به جای اینکه وقت زیادی را صرف برنامه ریزی کنند به بداهه پردازی علاقه دارند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>به مفاهیم عملی بیشتر از مفاهیم انتزاعی اهمیت می‌دهند: تیپ‌های ESTP چندان از نظریه‌ها یا مفاهیم انتزاعی استفاده نمی‌کنند. آن‌ها افرادی عملگرا هستند که به اطلاعات روراست علاقه دارند تا بتوانند به طور منطقی به آنها فکر کنند و فوراً براساس آن‌ها عمل کنند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>مهارت‌های اجتماعی قدرتمندی دارند: آن‌ها بسیار هوشیار هستند و به بسیاری از جزئیاتی که از دیدرس دیگران خارج است، توجه می‌کنند. دیگران گاهی اوقات آنها را به صورت آدم‌های حرافی توصیف می‌کنند که بسیار متقاعد کننده صحبت می‌کنند. آن‌ها در موقعیت‌های اجتماعی همیشه در گفتگوها چند قدم جلوتر به نظرمی‌رسند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>بیشتر تکانشی عمل می‌کنند: تیپ‌های ESTP اهل برنامه ریزی نیستند. آن‌ها در لحظه واکنش نشان می‌دهند و می‌توانند کاملاً تکانشی عمل کرده و ریسک پذیر هستند. همین رفتار چشم بسته مشکل ساز است؛ چون از حرفها و کارهایشان پشیمان می‌شوند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>یکی از برداشت‌های نادرست در مورد ESTP ها، بی پروایی آنها است. آن‌ها به ندرت بی پروا عمل می‌کنند. آن‌ها در اغلب موارد به سرعت براساس برداشت‌ها و منطق شخصی خودشان عمل می‌کنند.</li>
                            </ul>
                        @elseif($scoreArray['mbti'] == 'isfj')
                            <p class="mt-5">تیپ شخصیتی محافظ (درونگرا، حسی، احساسی، قضاوتی) بر اساس نظریه شخصیت کارل یونگ طراحی شد.
                                افراد دارای تیپ ISFJ، محافظه کار، مهربان و مسئول هستند. این تیپ شخصیتی در میانه تیپ‌های ISFJ (درونگرا، حسی، متفکر، قضاوتی) و ENFP (برونگرا، شهودی، احساسی، ادراکی) قرار می‌گیرد. تیپ شخصیتی ENTP (برونگرا، شهودی، متفکر، ادراکی) هم عکس ISFJ است.
                                این تیپ شخصیتی، بسیار متداول است. طبق تحقیقات دیوید کیرسی سازنده پرسشنامه Keirsey Temperament Sorter ، تیپ‌های شخصیتی ISFJ،  حدودا ۴ تا ۹ درصد از جمعیت را تشکیل می‌دهند.
                            </p>
                            <h4 class="mt-5">ویژگیهای اصلی تیپ شخصیتی ISFJ</h4>
                            <h6 class="mt-3">سازماندهی</h6>
                            <p class="mt-3">تیپ‌های ISFJ از سازماندهی لذت می‌برند و به دنبال حفظ نظم در تمامی حوزه‌های زندگی خودشان هستند. با اینکه افراد دارای این تیپ شخصیتی، درونگرا هستند و تمایل به سکوت هستند ولی مراقبانی مهربان بوده و روی سایر افراد هم متمرکز می‌شوند. از آنجا که بسیار باهوش هستند به خوبی جزئیات مرتبط  با سایر افراد را به خاطر می‌آورند.</p>
                            <h6 class="mt-3">هیجان‌ها</h6>
                            <p class="mt-3">این تیپ شخصیتی به خوبی هیجانها و احساسات دیگران را درک می‌کند. با اینکه به خوبی احساسات خودشان را درک می‌کنند؛ ولی در اغلب موارد برای ابراز احساساتشان با مشکل مواجه هستند. آن‌ها بیشتر از ابراز احساسات، آن‌ها را جمع می‌کنند و گاهی اوقات این کار را آنقدر انجام می‌دهند که نسبت به سایرین احساسات منفی پیدا می‌کنند.
                                آن‌ها در مواجهه با مشکلات زندگی مثل بیماری یا مرگ عزیزان، آرام می‌مانند تا دیگران را بابت این مشکلات نرنجانند.</p>
                            <h6 class="mt-3">سبک یادگیری</h6>
                            <p class="mt-3">تیپ‌های شخصیتی ISFJ در محیطهای بسیار ساختار یافته و پایدار به خوبی یاد می‌گیرند؛ چون در این محیطها دستورالعمل‌های گام به گام و انتظارات مشخصی وجود دارد.
                                این افراد، حقایق دقیق را به نظریه‌های انتزاعی ترجیح می‌دهند. بنابراین یادگیری عملی برایشان فوق العاده است. به همین دلیل معمولاً برای کاربردهای عملی یادگیری، ارزش قائل هستند. هنگامیکه می‌بینند موضوعات جدید چگونه قادر به حل مشکلات دنیای واقعی هستند، علاقه بیشتری به یادگیری آنها پیدا می‌کنند.</p>
                            <h6 class="mt-3">سوء برداشت‌ها</h6>
                            <p class="mt-3">از آنجا که ISFJ ها مراقب سنت‌ها هستند؛ گاهی اوقات غیرقابل تغییر در نظر گرفته می‌شود. با اینکه تغییر برای این تیپ شخصیتی به سرعت اتفاق نمی‌افتد ولی باز هم به خوبی با شرایط جدید هماهنگ می‌شوند. آن‌ها باید وقت کافی برای فکر کردن و آمادگی برای تغییرات جدید را پیدا کنند.</p>
                        @elseif($scoreArray['mbti'] == 'entj')
                        <p class="mt-5">به گفته دیوید کرسی روانشناس، تیپ شخصیتی ENTJ بسیار نادر است و تنها کمی بیش از ۲ درصد جمعیت را در بر می‌گیرد. افراد دارای این تیپ شخصیتی از وقت گذرانی در کنار دیگران لذت می‌برند. آن‌ها مهارتهای کلامی و تعاملی قدرتمندی دارند که به آنها انرژی می‌دهد.</p>
                            <h4 class="mt-5">ویژگیهای اصلی تیپ شخصیتی ENTJ</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ شخصیتی ENTJ بیشتر از تمرکز روی زمان حال، به تفکر در مورد آینده علاقمند است. آن‌ها در اغلب مواقع اطلاعات انتزاعی و نظری را جالب‌تر از جزئیات دقیق می‌دانند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها در حین تصمیم گیری بیشتر روی اطلاعات منطقی و انتزاعی تأکید می‌کنند. احساسات شخصی و هیجانات دیگران چندان روی تصمیم گیری آنها اثر گذار نیست.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی ENTJ از توان برنامه ریزی عالی برخوردارند. تصمیم گیری‌ها و داشتن برنامه یا مجموعه فعالیت‌های برنامه ریزی شده حس کنترل روی اوضاع و پیش بینی پذیری را به آنها می‌دهد.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها بسیار منطقی هستند، به خوبی مشکلات را تشخصی می‌دهد و مسؤلیت پذیر هستند. این گرایش‌ها آنها را به رهبرانی عالی تبدیل کرده که روی حل  کارآمد مشکلات متمرکز هستند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>یکی از برداشت‌های نادرست در مورد ENTJ ها، سرد و بی رحم بودنشان است.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>شاید آنها میانه خوبی یا هیجانات ندارند ولی این به معنای بی رحم و ظالم بودنشان نیست. مستعد پنهان کردن هیجانات و احساساتشان هستند چون آن را در حکم نقطه ضعفشان می‌دانند که باید از دیگران پنهانش کنند.</li>
                            </ul>
                        @elseif($scoreArray['mbti'] == 'isfp')
                        <p class="mt-5">ﺗﯿﭗ ﺷﺨﺼﯿﺘﯽ ﻣﺤﺎﻓﻆ (ﺩﺭﻭﻧﮕﺮﺍ، ﺣﺴﯽ، ﺍﺣﺴﺎﺳﯽ، ﻗﻀﺎﻭﺗﯽ) ﺑﺮ ﺍﺳﺎﺱ ﻧﻈﺮﯾﻪ ﺷﺨﺼﯿﺖ ﮐﺎﺭﻝ ﯾﻮﻧﮓ ﻃﺮﺍﺣﯽ ﺷﺪ. ﺍﻓﺮﺍﺩ ﺩﺍﺭﺍﯼ ﺍﯾﻦ ﺗﯿﭗ ﺷﺨﺼﯿﺘﯽ ﺑﻪ ﺻﻮﺭﺕ ﺍﻓﺮﺍﺩﯼ ﺁﺭﺍﻡ، ﺭﺍﺣﺖ ﻭ ﺻﻠﺢ ﻃﻠﺐ ﺗﻮﺻﯿﻒ ﻣﯽﺷﻮﻧﺪ.ﺑﻪ ﮔﻔﺘﻪ ﺩﯾﻮﯾﺪ ﮐﯿﺮﺳﯽ ﺳﺎﺯﻧﺪﻩ ﭘﺮﺳﺸﻨﺎﻣﻪ Keirsey Temperament Sorter ﺩﺭ ﺣﺪﻭﺩ ۵ ﺗﺎ ۱۰ ﺩﺭﺻﺪ ﺍﺯ ﺍﻓﺮﺍﺩ ﺩﺍﺭﺍﯼ ﺗﯿﭗ ﺷﺨﺼﯿﺘﯽ ISFP ﻫﺴﺘﻨﺪ. ﺗﯿﭗ ISFP ﻋﮑﺲ ENTY ﻋﻤﻞ ﻣﯽﮐﻨﺪ.</p>
                        <p class="mt-5">به گفته دیوید کیرسی سازنده پرسشنامه Keirsey Temperament Sorter در حدود ۵ تا ۱۰ درصد از افراد دارای تیپ شخصیتی ISFP هستند. تیپ ISFP عکس ENTY عمل می‌کند.</p>

                        <h4 class="mt-5">ویژگیهای اصلی ISFP</h4>
                        <ul>
                            <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ISFP می‌خواهند در حین تصمیم گیری گزینه‌های مختلفی در اختیارشان قرار گیرد؛ به همین دلیل، تصمیم گیری را به تأخیر می‌اندازند تا شاید شرایط تغییر کند یا اینکه گزینه‌های جدیدی در اختیارشان قرار بگیرد.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>طبق پرسشنامه مایرز-بریگز، تیپ‌های ISFP افرادی مهربان، دارای رفتار دوستانه، حساس و ساکت هستند که از تعامل با سایر افراد، انرژی می‌گیرند. این افراد درونگرا برخلاف برونگراها که از تعامل با دیگران انرژی می‌گیرند؛ باید در کنار دیگران انرژی صرف کنند. درونگراها بعد از وقت گذراندن با دیگران باید زمانی را به حال خودشان تنها بمانند تا انرژی خودشان را احیا کنند. به همین دلیل هم با گروه کوچکی از دوستان و اعضای خانواده رابطه دارند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>با اینکه افرادی آرام و محافظه کار هستند؛ به عنوان افرادی با رفتار دوستانه، مراقب و با ملاحظه هم شناخته می‌شوند. آن‌ها افرادی آسان گیر هستند که دیگران را همانگونه که هستند؛ می‌پذیرند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به تمرکز روی جزئیات، علاقه دارند. به جای نگرانی در قبال آینده بیشتر روی زمان حال متمرکز می‌شوند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>آن‌ها بیشتر از رویاپردازی به عملگرایی معروف هستند. آن‌ها علاقه‌ای به نظریه‌های انتزاعی ندارند؛ مگر آنکه کاربرد عملی آنها را مشاهده کنند و شرایط یادگیری حاوی تجارب عملی را ترجیح می‌دهند.</li>
                        </ul>
                        @elseif($scoreArray['mbti'] == 'istj')
                        <p class="mt-5">افراد دارای تیپ شخصیتی ISTJ افرادی محافظه کار، عملگرا و آرام هستند. آن‌ها از نظم و سازماندهی در تمامی حوزه‌های زندگی از جمله خانه، کار، خانواده و پروژه‌هایشان لذت می‌برند. آن‌ها برای وفاداری ارزش زیادی قائل هستند و روی سنت‌ها تأکید دارند.</p>
                        <h4 class="mt-5">ویژگیهای اصلی ISTJ</h4>
                        <ul>
                            <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ISTJ، برنامه‌ریزهای خوبی هستند. آن‌ها همه چیز را به خوبی از قبل برنامه ریزی می‌کنند. آن‌ها از نظم لذت می‌برند و توجه زیادی به جزئیات دارند. وقتی همه چیز نامرتب و بی نظم است؛ این افراد حس آرامش ندارند؛ تا اینکه همه چیز را مرتب کنند و کارشان تمام شوند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>آن‌ها افرادی مسئول و واقع گرا هستند. آن‌ها رویکردی منطقی در رسیدن به اهداف و تکمیل پروژه‌ها دارند و می‌توانند با کمال آرامش به انجام وظایفشان بپردازند. آن‌ها به راحتی قادر به تمرکز روی کارشان هستند. عوامل حواسپرتی را نادیده می‌گیرند و به عنوان افرادی مستقل و مورد اعتماد شناخته می‌شوند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به سنت‌ها و قوانین کاملاً پایبند هستند. آن‌ها به دنبال روش‌ها و قواعد اثبات شده می‌روند. در برخی موارد هم افرادی متحجر هستند که علاقه‌ای به تغییر ندارند.</li>
                        </ul>
                        @elseif($scoreArray['mbti'] == 'infp')
                        <p class="mt-5">شخصیت INFP غالباً به عنوان تیپ ایده آل گرا یا میانجی‌گر شناخته می‌شود. افراد دارای این تیپ شخصیتی بیشتر درونگرا، ایده آل گرا، خلاق و ارزش محور هستند</p>
                        <p class="mt-5">تیپ‌های شخصیتی INFP تمایل زیادی برای تبدیل دنیا به مکان بهتری برای زندگی کردن دارند. آن‌ها علاوه بر علاقمندی به شناخت خودشان و سازگاری با دنیا به دنبال کمک به دیگران هستند. افراد دارای این تیپ شخصیتی، زمان زیادی را صرف بررسی هدفشان در زندگی می‌کنند و در مورد به کارگیری  مهارتها و استعدادهایشان در جهت کمک به بشریت فکر می‌کنند. تیپ INFP عکس ESTJ است. سایر تیپ‌های متفاوت شامل INTP و ENFJ هستند</p>

                            <h4 class="mt-5">ویژگیهای اصلی INFP</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی INFP، درونگرا، ساکت و محافظه کار هستند. قرارگیری در موقعیت‌های اجتماعی از آنها انرژی می‌گیرد و برقراری تعامل با گروه کوچکی از دوستان نزدیک را ترجیح می‌دهند. با اینکه تنهایی را دوست دارند ولی این امر را نباید با خجالتی بودن اشتباه گرفت. بلکه آنها از تنهایی انرژی می‌گیرند. از طرف دیگر، آن‌ها باید در موقعیت‌های اجتماعی هم به صرف انرژی بپردازند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INFP متکی بر شهود عمل می‌کنند و بیشتر از جزئیات ریز روی تصویر کلی متمرکز می‌شوند. آنها به مسائل مهم یا پروژه‌های کاری به خوبی اهمیت می‌دهند ولی جزئیات پیش پا افتاده و کسل کننده را نادیده می‌گیرند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها احساسات فردی را مورد تأکید قرار می‌دهند و این مسائل بیشتر از اطلاعات عینی روی تصمیماتشان اثر دارد.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INFP در حین تصمیم گیری، آزادانه عمل می‌کنند. آن‌ها تصمیمات مهم را آنقدر به تعویق می‌اندازند تا شرایط موقعیتی تغییر کند. آن‌ها در حین تصمیم گیری بیشتر از منطق به ارزش‌های شخصی تکیه می‌کنند</li>
                            </ul>


                        @elseif($scoreArray['mbti'] == 'intp')
                        <p class="mt-5">افرادی که تیپ INTP دارند به صورت افرادی آرام و تحلیلی شناخته می‌شوند. آن‌ها از خلوت کردن و تفکر در مورد عملکرد امور و رسیدن به راه حل‌های مشکلات لذت می‌برند. آن‌ها دنیای درونی قدرتمندی دارند و بیشتر از دنیای بیرون به افکار درونی خودشان توجه می‌کنند. آن‌ها دارای روابط اجتماعی گسترده‌ای نیستند ولی با گروه منتخبی از افراد، صمیمی می‌شوند</p>
                        <p class="mt-5">به گفته دیوید کیرسی روانشناس که پرسشنامه Keirsey Temperament Sorter را طراحی کرده؛ در حدود یک تا پنج درصد از هر جمعیتی دارای تیپ شخصیتی INTP هستند</p>

                            <h4 class="mt-5">ویژگیهای اصلی INTP</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INTP افرادی آرام، منزوی و محافظه کار هستند. آن‌ها به عنوان افرادی درونگرا؛ به معاشرت با گروه کوچکی از دوستان صمیمی با علایق و روابط مشترک علاقه دارند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>از فکر کردن به مفاهیم نظری لذت می‌برند و به منطق بیشتر از هیجان اهمیت می‌دهند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>در حین تحلیل داده و تصمیم گیری، بسیار منطقی و عینی عمل می‌کنند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>افرادی انعطاف پذیر هستند که به خوبی به تفکر خلاق می پردازند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>افراد دارای این تیپ شخصیتی بیشتر از تمرکز روی جزئیات ریز به تصویر کلی مسأله فکر می‌کنند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INTP به بازماندن گزینه‌های پیش رو در حین تصمیم گیری علاقمند هستند و داشتن سازماندهی و برنامه ریزی، آن‌ها را محدود می‌کند</li>
                            </ul>



                        @elseif($scoreArray['mbti'] == 'infj')
                        <p class="mt-5">گاهی اوقات این تیپ به عنوان «حامی» یا «ایده آلگرا» شناخته می‌شود. افراد دارای این تیپ، افرادی خلاق، آرام و با ملاحظه هستند</p>
                        <p class="mt-5">آن‌ها معمولاً افرادی محافظه کار و حساس نسبت به احساسات دیگران هستند. آن‌ها به طور معمول افرادی ایده آل گرا هستند که به استانداردهای اخلاقی برتر معتقدند و تا حد زیادی روی آینده متمرکز هستند. تیپ‌های INFJ از تفکر در مورد موضوعات عمیق و معنای زندگی لذت می‌برند. این تیپ یکی از نادرترین تیپ‌های شخصیت است به طوریکه یک تا سه درصد از جمعیت را شامل می‌شود</p>
                        <p class="mt-5">یکی از قابلیت‌های تیپ INFJ عملی کردن گرایشش به ایده آل گرایی است. آن‌ها مثل افراد خیال پرداز یا فیلسوف نیستند که فقط به تغییر دنیا فکر کنند. آن‌ها ارزش‌هایشان را در نظر می‌گیرند و آنها را به تغییرات مثبت و پایدار تبدیل می‌کنند.</p>
                        <p class="mt-5">با اینکه پرسشنامهMBTI بسیار محبوب است ولی به خاطر اعتبار و روایی ضعیفش مورد انتقاد زیادی قرار گرفته است. اگر MBTI را روی خودتان اجرا کرده‌اید؛ در به کارگیری مفهوم نتایج آن دقت کنید</p>
                        <p class="mt-5">در این مقاله با تیپ INFJ بیشتر آشنا می‌شوید ولی نباید نتایج آن را جایگزین توصیه‌های افراد حرفه‌ای در حوزه سلامت و روانشناسی کنید. شخصیت INFJ عکس تیپ ESTP عمل می‌کند</p>

                            <h4 class="mt-5">ویژگیهای اصلی INFJ</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>با اینکه ماهیت درونگرایی دارند ولی می‌توانند روابط قدرتمند و مهمی را با سایر افراد تشکیل دهند. آن‌ها از کمک به دیگران لذت می‌برند ولی برای تجدید قوا به خلوت نیاز دارند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INFJ با داشتن قدرت درک شهودی و هیجانی، افرادی همدل و ملایم محسوب می‌شوند. البته این امر به معنای سهل الوصول بودنشان نیست؛ آنها باورهای قدرتمندی دارند و قادر به تصمیم گیری قاطعانه هستند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>با اینکه ماهیت درونگرایی دارند ولی می‌توانند روابط قدرتمند و مهمی را با سایر افراد تشکیل دهند. آن‌ها از کمک به دیگران لذت می‌برند ولی برای تجدید قوا به خلوت نیاز دارند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>با اینکه این تیپ شخصیتی، ایده آل گرا محسوب می‌شود ولی این بدان معنا نیست که با عینک صورتی به تمام دنیا نگاه می‌کند. آن‌ها خوب و بد دنیا را درک می‌کنند و امیدواراند که آن را به جای بهتری برای زندگی تبدیل کنند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>ن‌ها در حین تصمیم گیری بیشتر از اطلاعات دقیق به مسائل شخصی خودشان توجه دارند. آن‌ها با کمک برنامه ریزی، سازماندهی و تصمیم گیری‌های فوری به دنبال اعمال کنترل هستند</li>
                            </ul>


                        @elseif($scoreArray['mbti'] == 'estj')
                        <p class="mt-5">افراد دارای این تیپ شخصیتی در اغلب مواقع به صورت افرادی منطقی و متعهد توصیف می‌شوند. آن‌ها افرادی قاطع هستند که می‌خواهند همه چیز به خوبی و طبق قواعد پیش برود. آن‌ها به سنت‌ها، استانداردها و قوانین متعهد هستند. آن‌ها باورها و قضاوت قدرتمندی دارند و انتظار دارند تا سایرین هم به اصول آنها پایبند بمانند</p>
                        <p class="mt-5">طبق ارزیابی‌های صورت گرفته، ۸ تا ۱۲ درصد از جمعیت ایالات متحده دارای شخصیت ESTJ هستند. دیوید کیرسی طراح پرسشنامه Keirsey Temperament Sorter هم تیپ شخصیتی ESTJ را همان «سرپرست نگهبان» (Guardian Supervisor)  یا یکی از چهار کهن الگوی «نگهبان» (سرپرست، بازرس، تأمین کننده، محافظ) می‌داند</p>

                            <h4 class="mt-5">ویژگیهای اصلی ESTJ</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>افراد دارای این تیپ به سنت‌ها، قوانین و امنیت اهمیت زیادی می‌دهند. حفظ شرایط موجود، اهمیت زیادی برای ESTJ ها دارد و غالباً مشغول کارهای مدنی، فعالیت در شعبات دولتی و سازمانهای اجتماعی می‌شوند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>از آنجا که رویکردی سنتی در قبال زندگی دارند، گاهی اوقات افرادی سختگیر، لجباز و تسلیم ناپذیر دیده می‌شوند. آن‌ها به خاطر نگرش مسئولیت پذیرانه به راحتی سمت‌های رهبری را می‌پذیرند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>با اعتماد به نفس و اعتقادات قوی به راحتی برنامه‌ها را اجرایی می‌کنند ولی گاهی اوقات در شرایطی که استانداردهایشان تأمین نمی‌شود؛ بسیار قاطع و پرخاشگر می‌شوند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>دیگران تیپ‌های شخصیتی ESTJ را به صورت قابل پیش بینی، با ثبات، متعهد و عملگرا توصیف می‌کنند. عقایدشان را به صورت صریح و صادقانه با دیگران در میان می‌گذارند و گاهی هم بسیار خشن و قاطع به نظر می‌رسند</li>
                            </ul>
                        @elseif($scoreArray['mbti'] == 'esfp')
                        <p class="mt-5">فراد دارای تیپ‌ شخصیتی ESFP در اغلب موارد به عنوان افرادی خودجوش، کاردان و خوش مشرب شناخته می‌شوند. آن‌ها از مرکز توجه بودن، لذت می‌برند و افراد بامزه یا مجلس گرم کنی هستند. تیپ ESFP عکس تیپ شخصیتی INTJ است.</p>
                        <p class="mt-5">به گفته دیوید کیرسی سازنده پرسشنامه Keirsey Temperament Sorter، در حدود ۴ تا ۱۰ درصد از تمامی افراد یک جمعیت، دارای تیپ شخصیتی ESFP هستند.</p>

                            <h4 class="mt-5">ویژگیهای اصلی ESFP</h4>
                            <p class="mt-5">تیپ‌های ESFP بسیار عملگرا و کاردان هستند. آن‌ها از تجارب عملی، یاد می‌گیرند و علاقه‌ای به یادگیری نظری و مباحث فلسفی ندارند. به همین خاطر، دانش آموزان دارای این تیپ شخصیتی گاهی اوقت با شرایط کلاس سنتی به مشکل بر می‌خورند. با این حال در موقعیت‌هایی که می‌توانند با دیگران تعامل برقرار کنند یا امکان یادگیری از طریق تجربه عملی برایشان فراهم است؛ عملکردی عالی دارند.</p>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها در زمان حال زندگی می‌کنند و گاهی نمی‌توانند در مورد پیامدهای بلندمدت فعالیتهای فعلی خودشان، فکر کنند. آن‌ها غالباً با عجله وارد موقعیت جدید می‌شوند و اتفاقات را رقم می‌زنند. گاهی اوقات علاقه‌ای به امورات روزمره وتکراری ندارند، از تجارب جدید لذت می‌برند و همواره به دنبال یک ماجراجویی جدید هستند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها علاوه بر آگاهی از موقعیت اطرافشان به خوبی دیگران را درک می‌کنند. آن‌ها احساسات دیگران را درک می‌کنند و می‌دانند که چگونه به آنها واکنش نشان دهند. سایرین هم آنها را افرادی خونگرم، همدل و راحت می‌دانند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>یکی از برداشت‌های متداول و نادرست در مورد شخصیت این افرا، توجه طلب بودنشان است. با اینکه آنها عاشق سرگرمی هستند و از مورد توجه بودن، بدشان نمی‌آید ولی بیشتر به زندگی کردن در زمان حال و عملی کردن احساساتشان در لحظه علاقمند هستند.</li>
                            </ul>
                        @elseif($scoreArray['mbti'] == 'esfj')
                        <p class="mt-5">تیپ ESFJ تحت عنوان شخصیت سفیر یا سرپرست هم شناخته می‌شود که یکی از ۱۶ تیپ شخصیتی در شاخص تیپ مایرز- بریگز است. تیپ‌های ESFJ افرادی خونگرم، وفادار، منظم و مهربان هستند. آن‌ها از تعامل با دیگران انرژی می‌گیرند</p>
                        <p class="mt-5">آن‌ها به عنوان افرادی معاشرتی و اجتماعی توصیف می‌شوند. این افراد دیگران را در جهت بهتر شدن تشویق می‌کنند و اگر متوجه موضوع بدی در مورد نزدیکانشان شوند؛ بسیار ناراحت می‌شوند</p>
                        <p class="mt-5">به گفته دیوید کیرسی در حدود ۹ تا ۱۳ درصد از جمعیت دارای تیپ شخصیتی ESFJ هستند.</p>

                            <h4 class="mt-5">ویژگیهای اصلی ESFJ</h4>
                            <p class="mt-5">افراد دارای تیپ ESFJ یا شخصیت سفیر دارای گرایش‌های زیر هستند</p>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>از کمک به دیگران لذت می‌برند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>نیازمند تأیید هستند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>دوست دارند که مهربانی و بخشندگی آنها مورد توجه و تأیید دیگران قرار بگیرد</li>
                                <li><i class="fas fa-caret-left ms-2"></i>نسبت به نیازها و احساسات دیگران حساس هستند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>به خوبی احترام و مراقبت مورد نیاز دیگران را فراهم می‌کنند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>می‌خواهند که دیگران آنها را دوست بدارند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>به راحتی در اثر نامهربانی و بی تفاوتی لطمه می‌بینند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>سیستم ارزشی آنها بیشتر از اصول اخلاقی و درونی مبتنی بر منابع بیرونی و اجتماعی است</li>
                            </ul>
                            <p class="mt-5">افراد دارای تیپ شخصیتی سفیر با ارزش‌ها و استانداردهای برتر رشد کرده‌اند تا به بزرگسالانی معاشرتی و مردم دار تبدیل شوند. تیپ‌های ESFJ که در محیطهای کمتر برخوردار رشد یافته‌اند؛ احتمالاً در بزرگسالی با انحراف در اصول اخلاقی مواجه می‌شوند و احتمال فریبکاری و خود محوری در آنها بیشتر است.</p>
                            <p class="mt-5">آن‌ها به اعمال کنترل روی محیط اطرافشان گرایش دارند. سازماندهی، برنامه ریزی و زمانبندی به این افراد کمک می‌کند تا دنیای اطرافشان را تحت کنترل درآورند</p>
                            <p class="mt-5">این تیپ علاقمند به شناخت دیگران است. آنها به خوبی مراقب دیگران هستند و در حمایت و کمک به شکوفایی دیگران مهارت دارند. از آنجا که به خوبی حس خوبی را در دیگران ایجاد می‌کنند؛ دیگران هم نسبت به آنها گرایش دارند</p>
                            <p class="mt-5">یکی از برداشت‌های نادرست و رایج در مورد  ESFJ ها این است که آنها گاهی اوقات مثل پادری عمل می‌کنند و بدون ترس از طرد شدن یا عدم تأیید، به دیگران اجازه می‌دهند تا آنها را له کنند. با اینکه آنها افرادی مردم دار هستند ولی این امر به معنای سهل الوصول بودنشان نیست</p>
                        @elseif($scoreArray['mbti'] == 'enfp')
                        <p class="mt-5">تیپ شخصیتی محافظ (درونگرا، حسی، احساسی، قضاوتی) بر اساس نظریه شخصیت کارل یونگ طراحی شد. افراد دارای این تیپ شخصیتی به صورت افرادی آرام، راحت و صلح طلب توصیف می‌شوند.</p>

                            <h4 class="mt-5">ویژگیهای اصلی ENFP</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>این تیپ داراری مهارت‌های بین فردی عالی است. آن‌ها با ذوق فعالیت‌ میکنند و برای دیگران اهمیت قائل هستند. تیپ‌های ENFP به خوبی احساسات دیگران را درک می‌کنند. به خاطر داشتن ذوق، جذبه و خلاقیت به رهبران قوق العاده ای تبدیل می‌شوند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>افراد دارای این تیپ شخصیتی علاقه‌ای به کارهای تکراری ندارند و تمرکز روی آینده را ترجیح می‌دهند. با اینکه در ایده پردازی فوق العاده هستند ولی گاهی اوقات کارهای مهم را به دقیقه ۹۰ واگذار می‌کنند. رویا پردازی در مورد ایده‌ها بدون در نظر گرفتن عملی بودنشان، مشکلی متداول در بین این افراد است</li>
                                <li><i class="fas fa-caret-left ms-2"></i>حواس تیپ ENFP به راحتی پرت می‌شود؛ به ویژه اگر در حال انجام کاری خسته کننده باشند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>ن‌ها افرادی انعطاف پذیر هستند که تمامی گزینه‌ها را روی میز قرار می‌دهند. آن‌ها به طور خودجوش هم عمل کرده و با تغییر بسیار سازگار هستند. آن‌ها علاقه‌ای به کارهای تکراری ندارند و گاهی دچار بی‌نظمی و اهمالکاری می‌شوند.</li>
                            </ul>
                        @elseif($scoreArray['mbti'] == 'enfj')
                        <p class="mt-5">تیپ ENFJ تحت عنوان شخصیت امدادگر یا پیشرو هم شناخته می‌شود که یکی از ۱۶ تیپ شخصیتی در پرسشنامه شاخص تیپ مایرز- بریگز است. برخی دیگر از تیپ‌های شخصیتی که با نام مخفف شناخته می‌شوند؛ شامل ESFJ، ENFP، INFP، ISFJ و INTP هستند</p>
                        <p class="mt-5">افراد دارای تیپ شخصیتی ENFJ به صورت افرادی خونگرم، معاشرتی، وفادار و حساس شناخته می‌شوند.</p>
                        <p class="mt-5">افراد دارای تیپ ENFJ «قدرتمندترین افراد» در بین تمامی تیپ‌های شخصیتی محسوب می‌شوند. آن‌ها به خوبی با همه تیپ‌های شخصیتی حتی افراد درونگرا و منزوی دوست می‌شوند</p>
                        <p class="mt-5">چون به خوبی احساسات و عوامل اثرگذار بر رفتار دیگران را حس می‌کنند، قادر به نفوذ و اثرگذاری بر دیگران هستند. از طرف دیگر دارای سیستم ارزشی قدرتمند و گرایش برای کمک به دیگران هستند که این امر تمایل به نفوذ بر دیگران را متعادل می‌کند. تیپ ENFJ عکس تیپ شخصیتی ISTP عمل می‌کند</p>
                        <p class="mt-5">به گفته دیوید کیرسی روانشناس، تقریباً ۲ تا ۵ درصد از تمامی افراد دارای شخصیت ENFJ هستند</p>

                            <h4 class="mt-5">ویژگیهای اصلی ENFJ</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENFJ به عنوان برونگراهای قدرتمند، از وقت گذرانی با دیگران لذت می‌برند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها مهارتهای بین فردی عالی دارند و افرادی خونگرم، عاطفی و حمایتگر محسوب می‌شوند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به خوبی دیگران را تشویق می‌کنند و با کمک به دیگران به رضایت شخصی می‌رسند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>از وقت گذراندن با دیگران لذت می‌برند که باعث نادیده گرفتن نیازهای خودشان می‌شود</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به خودشان سخت می‌گیرند و اگر اشتباه کنند؛ خودشان را سرزنش می‌کنند و اگر کاری را درست انجام دهند هم ارزشی برایش قائل نیستند. به همین خاطر افراد دارای این تیپ شخصیتی باید وقتی را برای رسیدگی به نیازهای خودشان، اختصاص دهند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENFJ به خوبی می‌توانند افراد مختلف را به توافق برسانند. به همین دلیل می‌توانید به رهبرانی برجسته تبدیل شوند و شور و شوق را به گروه بیاورند که باعث ایجاد انگیزه شده و الهام بخش است</li>
                                <li><i class="fas fa-caret-left ms-2"></i>یکی از برداشت‌های نادرست در مورد شخصیت پیشرو این است که هموار معاشرتی هستند. با اینکه عاشق مردم هستند ولی برای تجدید قوا به خلوت کردن نیاز دارند.</li>
                            </ul>
                        @elseif($scoreArray['mbti'] == 'entp')
                        <p class="mt-5">افراد دارای این تیپ شخصیتی به عنوان افرادی خلاق، باهوش و با توانایی ابراز وجود مناسب توصیف می‌شوند. تیپ‌های ENTP افرادی ایده پرداز هستند به همین دلیل به عنوان شخصیت «نوآور»، «خیال اندیش» و «مجادله گر» هم معروف هستند.</p>
                        <p class="mt-5">تیپ شخصیتی ENTP علاقه چندانی به جزئیات حال حاضر ندارد و بیشتر در حال ایده پردازی و نظریه پردازی است. به همین دلیل گاهی اوقات بدون اینکه با برنامه پیش بروند و افکار خلاقانه را عملی نمایند، یکی پس از دیگری به ایده‌های جدید می‌رسند.</p>
                        <p class="mt-5">به گفته دیوید کیرسی روانشناس و طراح پرسشنامه Keirsey Temperament Sorter، تیپ‌های ENTP به عنوان افرادی مبتکر و منطقی شناخته می‌شوند. از نظر او این تیپ نادر است و در حدود ۵ تا ۱۰ درصد از جمعیت را در بر می‌گیرد.</p>

                            <h4 class="mt-5">ویژگیهای اصلی ENTP</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENTP از داشتن تعامل با طیف وسیعی از افراد، لذت می‌برند. آن‌ها گفتگو کننده‌هایی عالی و عاشق بحث کردن با دیگران هستند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها بیشتراز جزئیات زمان حال روی آینده متمرکز می‌شوند. شاید پروژه‌ای را شروع کنند و هیچگاه به اتمام نرسانند چون بیشتر از نیازهای زمان حال روی تصویر کلی متمرکز هستند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENTP از معاشرت با دیگران لذت می‌برند به ویژه اگر این معاشرت با بحث و گفتگو در مورد موضوعات مورد علاقه آنها همراه شود. آن‌ها بسیار راحت هستند و به راحتی با هر چیزی کنار می‌آیند. با این حال گاهی اوقات چنان غرق ایده‌ها و برنامه‌هایشان می‌شوند که روابط نزدیکشان را نادیده می‌گیرند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها تمایل به قضاوت دارند. به جای تصمیم گیری یا تعهد به مجموعه‌ای از اقدامات، بیشتر منتظر می‌مانند تا اتفاقات را مشاهده کنند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENTP افرادی بسیار کنجکاو و متمرکز بر شناخت دنیای اطرافشان هستند. آن‌ها همواره در حال جذب اطلاعات و ایده‌های جدید هستند و به سرعت نتیجه گیری می‌کنند. آن‌ها به سرعت تغییرات جدید را متوجه می‌شوند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>یکی از برداشت‌های نادرست در مورد ENTP ها این است که صرفاً به خاطر بحث کردن، عاشق این کار هستند. با اینکه افراد دارای این تیپ در بعضی موارد دیدگاه مخالف را ارائه می‌دهند ولی بحث کردن را روشی برای بررسی یک موضوع، شناخت دیدگاه دیگران و کمک به آنها برای دیدن جنبه دیگری از ماجرا می‌دانند.</li>
                            </ul>
                        @elseif($scoreArray['mbti'] == 'istp')
                        <p class="mt-5">افراد دارای این تیپ شخصیتی از فکر کردن در خلوت خودشان لذت می‌برند و بسیار مستقل هستند. تیپ‌های ISTP عاشق کار انفرادی، تجارب جدید، فعالیت‌های دستی و آزادی کاری هستند.</p>
                        <p class="mt-5">آن‌ها از جدا کردن قطعات یک دستگاه برای دیدن نحوه عملکردشان، لذت می‌برند. آن‌ها افرادی منطقی هستند ولی به فعالیتهای عملی بیشتر از ایده‌های انتزاعی علاقمند هستند. آن‌ها از کارهای جدید لذت می‌برند و به سرعت از کارهای تکراری دلزده می‌شوند.</p>
                        <h4 class="mt-5">ویژگیهای اصلی ISTP</h4>
                        <p class="mt-5">افراد دارای تیپ شخصیتی ISTP، نتیجه گرا هستند. هنگامیکه مشکلی پیش می‌آید به سرعت دلایل زیربنایی آن را می‌شناسند و برخی از راه حل‌ها را به کار می‌گیرند.</p>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها از تجارب جدید لذت می‌برند و گاهی اوقات درگیر رفتارهای هیجانی و خطرناک می‌شوند. آن‌ها سرگرمی‌های ریسکی و پرسرعتی مثل موتورسواری، بانجی جامپینگ، موج سواری یا هاکی روی یخ را انجام می‌دهند. آن‌ها در برخی موارد با انتخاب مشاغلی مثل اتومبیل رانی، پرواز یا آتش نشانی خودشان را به مخاطره می‌اندازند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به جای قضاوت براساس باورها یا ارزش‌های فردی به دنبال معیارهای عینی هستند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ISTP به صورت افرادی آرام توصیف می‌شوند که به راحتی به دیگران نزدیک می‌شوند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به خوبی حالات عاطفی دیگران را درک نمی‌کنند و گاهی اوقات به صورت افرادی بی احساس شناخته می‌شوند. همچنین از احساساتشان فاصله گرفته و آنها را انکار می‌کنند تا اینکه طاقتشان طاق می‌شود.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>یکی از برداشت‌های نادرست در مورد این تیپ شخصیتی، ساکت و بی عاطقه بودنشان است ولی این امر به معنای این نیست که آن‌ها هیجان‌های قوی را تجربه نمی‌کنند. در عوض می‌توانند خونسردی خودشان را حفظ کنند؛ واقعیت را درک می‌کنند و با بحران به خوبی کنار می‌آیند.</li>
                            </ul>

                        @endif
                    </div>
                </div>
                <div class="col-12 col-md-6 pe-0">
                    <div class="boxResult">
                        <h6 class="titleBox">نقاط قوت</h6>
                        <ul class="correct">
                            @if($scoreArray['mbti'] == 'intj')
                            <li><i class="fas fa-caret-left ms-2"></i>از مفاهیم نظری و انتزاعی لذت می‌برند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>انتظارات زیادی دارند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>به خوبی گوش می‌دهند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>از انتقاد استقبال می‌کنند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>دارای اعتماد به نفس و سختکوش هستند.</li>
                            @elseif($scoreArray['mbti'] == 'estp')
                                <li><i class="fas fa-caret-left ms-2"></i>معاشرتی، بامزه، پرانرژی</li>
                                <li><i class="fas fa-caret-left ms-2"></i>اثرگذار و متقاعد کننده</li>
                                <li><i class="fas fa-caret-left ms-2"></i>عملگرا</li>
                                <li><i class="fas fa-caret-left ms-2"></i>سازگار و مدیر</li>
                                <li><i class="fas fa-caret-left ms-2"></i>با ملاحظه</li>
                            @elseif($scoreArray['mbti'] == 'isfj')
                                <li><i class="fas fa-caret-left ms-2"></i>قابل اعتماد</li>
                                <li><i class="fas fa-caret-left ms-2"></i>عملگرا</li>
                                <li><i class="fas fa-caret-left ms-2"></i>حساس</li>
                                <li><i class="fas fa-caret-left ms-2"></i>جزئی نگر</li>
                            @elseif($scoreArray['mbti'] == 'entj')
                                <li><i class="fas fa-caret-left ms-2"></i>مهارت‌های رهبری قدرتمند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>دارای اعتماد به نفس</li>
                                <li><i class="fas fa-caret-left ms-2"></i>منظم</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تصمیم گیری عالی</li>
                                <li><i class="fas fa-caret-left ms-2"></i>قاطع و صریح</li>
                                <li><i class="fas fa-caret-left ms-2"></i>مهارتهای ارتباطی قوی</li>
                            @elseif($scoreArray['mbti'] == 'isfp')
                                <li><i class="fas fa-caret-left ms-2"></i>نسبت به محیط اطرافشان بسیار آگاه هستند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>عملگرا هستند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>منظم</li>
                                <li><i class="fas fa-caret-left ms-2"></i>از یادگیری عملی لذت می‌برند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>نسبت به ارزش‌ها و باورها، وفادار هستند.</li>
                            @elseif($scoreArray['mbti'] == 'istj')
                            <li><i class="fas fa-caret-left ms-2"></i>جزئی نگر</li>
                            <li><i class="fas fa-caret-left ms-2"></i>واقع گرا</li>
                            <li><i class="fas fa-caret-left ms-2"></i>متمرکز بر زمان حال</li>
                            <li><i class="fas fa-caret-left ms-2"></i>با ملاحظه</li>
                            <li><i class="fas fa-caret-left ms-2"></i>منطقی و عملگرا</li>
                            <li><i class="fas fa-caret-left ms-2"></i>منظم و ساختارمند</li>
                            @elseif($scoreArray['mbti'] == 'infp')
                            <li><i class="fas fa-caret-left ms-2"></i>وفادار و سرسپرده</li>
                            <li><i class="fas fa-caret-left ms-2"></i>حساس و علاقمند به دیگران</li>
                            <li><i class="fas fa-caret-left ms-2"></i>به تنهایی بهتر کار می‌کنند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>به روابط نزدیک اهمیت می‌دهند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>به خوبی تصویر کلی شرایط را می‌بینند</li>
                            @elseif($scoreArray['mbti'] == 'intp')
                            <li><i class="fas fa-caret-left ms-2"></i>منطقی و عینی</li>
                            <li><i class="fas fa-caret-left ms-2"></i>متفکر و انتزاعی</li>
                            <li><i class="fas fa-caret-left ms-2"></i>مستقل</li>
                            <li><i class="fas fa-caret-left ms-2"></i>وفادار و مهربان با عزیزانشان</li>
                            @elseif($scoreArray['mbti'] == 'infj')
                            <li><i class="fas fa-caret-left ms-2"></i>حساس نسبت به نیازهای دیگران</li>
                            <li><i class="fas fa-caret-left ms-2"></i>محافظه کار</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بسیار خلاق و هنرمند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>متمرکز بر آینده</li>
                            <li><i class="fas fa-caret-left ms-2"></i>برای روابط عمیق و صمیمانه ارزش قائل است</li>
                            <li><i class="fas fa-caret-left ms-2"></i>از فکر کردن به معنای زندگی لذت می‌برند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>ایده آل گرا</li>
                            @elseif($scoreArray['mbti'] == 'estj')
                            <li><i class="fas fa-caret-left ms-2"></i>عملگرا و واقعیت گرا</li>
                            <li><i class="fas fa-caret-left ms-2"></i>مستقل</li>
                            <li><i class="fas fa-caret-left ms-2"></i>دارای اعتماد به نفس</li>
                            <li><i class="fas fa-caret-left ms-2"></i>سختکوش</li>
                            <li><i class="fas fa-caret-left ms-2"></i>سنتی</li>
                            <li><i class="fas fa-caret-left ms-2"></i>دارای مهارتهای رهبری قدرتمند</li>
                            @elseif($scoreArray['mbti'] == 'esfp')
                            <li><i class="fas fa-caret-left ms-2"></i>خوش بین و خوش اخلاق</li>
                            <li><i class="fas fa-caret-left ms-2"></i>از معاشرت با مردم لذت می برند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>روی زمان حال متمرکزاند و خودجوش عمل می‌کنند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>عملگرا هستند</li>
                            @elseif($scoreArray['mbti'] == 'esfj')
                            <li><i class="fas fa-caret-left ms-2"></i>مهربان و وفادار</li>
                            <li><i class="fas fa-caret-left ms-2"></i>معاشرتی</li>
                            <li><i class="fas fa-caret-left ms-2"></i>منظم</li>
                            <li><i class="fas fa-caret-left ms-2"></i>علمی و مستقل</li>
                            <li><i class="fas fa-caret-left ms-2"></i>از کمک به دیگران لذت می‌برد</li>
                            <li><i class="fas fa-caret-left ms-2"></i>هوشیار</li>
                            @elseif($scoreArray['mbti'] == 'enfp')
                            <li><i class="fas fa-caret-left ms-2"></i>خونگرم و مشتاق</li>
                            <li><i class="fas fa-caret-left ms-2"></i>با ملاحظه و همدل</li>
                            <li><i class="fas fa-caret-left ms-2"></i>دارای مهارتهای بین فردی قوی</li>
                            <li><i class="fas fa-caret-left ms-2"></i>شوخ طبع و خودش جوش</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بسیار خلاق</li>
                            @elseif($scoreArray['mbti'] == 'enfj')
                            <li><i class="fas fa-caret-left ms-2"></i>معاشرتی و خونگرم</li>
                            <li><i class="fas fa-caret-left ms-2"></i>همدل</li>
                            <li><i class="fas fa-caret-left ms-2"></i>جمع آشنایان گسترده‌ای دارند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>افرادی ترغیب کننده هستند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>منظم</li>
                            <li><i class="fas fa-caret-left ms-2"></i>عاطفی</li>
                            <li><i class="fas fa-caret-left ms-2"></i>متقاعد کننده</li>
                            @elseif($scoreArray['mbti'] == 'entp')
                            <li><i class="fas fa-caret-left ms-2"></i>مبتکر</li>
                            <li><i class="fas fa-caret-left ms-2"></i>خلاق</li>
                            <li><i class="fas fa-caret-left ms-2"></i>مجادله گرانی خبره</li>
                            <li><i class="fas fa-caret-left ms-2"></i>از بحث لذت می‌برند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>برای دانش، ارزش قائل هستند</li>
                            @elseif($scoreArray['mbti'] == 'istp')
                            <li><i class="fas fa-caret-left ms-2"></i>منطقی</li>
                            <li><i class="fas fa-caret-left ms-2"></i>یادگیری از طریق تجربه</li>
                            <li><i class="fas fa-caret-left ms-2"></i>عملگرا</li>
                            <li><i class="fas fa-caret-left ms-2"></i>واقع گرا و عملی</li>
                            <li><i class="fas fa-caret-left ms-2"></i>علاقمند به چیزهای جدید</li>
                            <li><i class="fas fa-caret-left ms-2"></i>دارای اعتماد به نفس و آسان گیر</li>
                            @endif
                        </ul>
                    </div>
                </div>
                <div class="col-12 col-md-6 ps-0">
                    <div class="boxResult">
                        <h6 class="titleBox">نقاط ضعف</h6>
                        <ul class="wrong">
                            @if($scoreArray['mbti'] == 'intj')
                            <li><i class="fas fa-caret-left ms-2"></i>می‌توانند بیش از حد تحلیلی و قضاوتی عمل کنند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بسیار کمالگرا هستند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>علاقه‌ای به صحبت در مورد هیجاناتشان ندارند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>گاهی اوقات بی عاطفه و بی احساس به نظر می‌رسند.</li>
                            @elseif($scoreArray['mbti'] == 'estp')
                                <li><i class="fas fa-caret-left ms-2"></i>تکانشی</li>
                                <li><i class="fas fa-caret-left ms-2"></i>رقابتی</li>
                                <li><i class="fas fa-caret-left ms-2"></i>غالباًً نمایشی رفتار می‌کنند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>به سرعت دلزده می‌شوند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>بی احساس</li>
                            @elseif($scoreArray['mbti'] == 'isfj')
                                <li><i class="fas fa-caret-left ms-2"></i>بی علاقه نسبت به مفاهیم انتزاعی</li>
                                <li><i class="fas fa-caret-left ms-2"></i>گریزان از اختلاف</li>
                                <li><i class="fas fa-caret-left ms-2"></i>بی علاق نسبت به تغییر</li>
                                <li><i class="fas fa-caret-left ms-2"></i>نادیده گرفتن نیازهای شخصی</li>
                            @elseif($scoreArray['mbti'] == 'entj')
                                <li><i class="fas fa-caret-left ms-2"></i>بی صبر</li>
                                <li><i class="fas fa-caret-left ms-2"></i>یک دنده</li>
                                <li><i class="fas fa-caret-left ms-2"></i>بی عاطفه</li>
                                <li><i class="fas fa-caret-left ms-2"></i>پرخاشگر</li>
                                <li><i class="fas fa-caret-left ms-2"></i>متعصب</li>
                            @elseif($scoreArray['mbti'] == 'isfp')
                            <li><i class="fas fa-caret-left ms-2"></i>علاقه‌ای به اطلاعات نظری و انتزاعی ندارند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>محافظه کار و آرام هستند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>نیاز به فضای شخصی دارند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>از بحث و اختلاف، بیزار هستند</li>
                            @elseif($scoreArray['mbti'] == 'istj')
                            <li><i class="fas fa-caret-left ms-2"></i>قضاوت</li>
                            <li><i class="fas fa-caret-left ms-2"></i>ذهنیت</li>
                            <li><i class="fas fa-caret-left ms-2"></i>حساس</li>
                            <li><i class="fas fa-caret-left ms-2"></i>تمایل به سرزنش دیگران دارند</li>
                            @elseif($scoreArray['mbti'] == 'infp')
                            <li><i class="fas fa-caret-left ms-2"></i>می‌توانند بیش از حد ایده آل گرا عمل کنند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>شناخت آنها دشوار است</li>
                            <li><i class="fas fa-caret-left ms-2"></i>گاهی اوقات چیزهای کوچک را نادیده می‌گیرند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بی توجهی به جزئیات</li>
                            @elseif($scoreArray['mbti'] == 'intp')
                            <li><i class="fas fa-caret-left ms-2"></i>شناختن شان دشوار است.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>حساس هستند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>در معرض تردید نسبت به خودشان قرار دارند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>تبعیت از قواعد برایشان دشوار است.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>در ابراز احساساتشان مشکل دارند.</li>
                            @elseif($scoreArray['mbti'] == 'infj')
                            <li><i class="fas fa-caret-left ms-2"></i>بسیار حساس هستند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>گاهی اوقات شناخت آنها دشوار است</li>
                            <li><i class="fas fa-caret-left ms-2"></i>انتظارات بسایر زیادی دارند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>یک دنده</li>
                            <li><i class="fas fa-caret-left ms-2"></i>اختلاف را دوست ندارند</li>
                            @elseif($scoreArray['mbti'] == 'estj')
                            <li><i class="fas fa-caret-left ms-2"></i>بی احساس</li>
                            <li><i class="fas fa-caret-left ms-2"></i>غیرقابل انعطاف</li>
                            <li><i class="fas fa-caret-left ms-2"></i>در ابراز احساساتشان چندان خوب نیستند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>اهل بحث و گفتگو</li>
                            @elseif($scoreArray['mbti'] == 'esfp')
                            <li><i class="fas fa-caret-left ms-2"></i>علاقه‌ای به نظریه‌های انتزاعی ندارند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>به راحتی خسته می‌شوند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>از قبل برنامه ریزی ندارند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>تکانشی عمل می‌کنند</li>
                            @elseif($scoreArray['mbti'] == 'esfj')
                            <li><i class="fas fa-caret-left ms-2"></i>نیازمند توجه</li>
                            <li><i class="fas fa-caret-left ms-2"></i>تأیید طلب</li>
                            <li><i class="fas fa-caret-left ms-2"></i>حساس نسبت به انتقاد</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بی علاقه نسبت به تغییر</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بی صبر</li>
                            <li><i class="fas fa-caret-left ms-2"></i>کنترل کننده</li>
                            @elseif($scoreArray['mbti'] == 'enfp')
                            <li><i class="fas fa-caret-left ms-2"></i>نیازمند تأیید شدن از جانب دیگران</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بی نظم</li>
                            <li><i class="fas fa-caret-left ms-2"></i>به راحتی استرس می‌گیرند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>گاهی اوقات بیش از حد هیجانی عمل می‌کنند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بیش از حد فکر می‌کنند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>با پیروی از قوانین مشکل دارند.</li>
                            @elseif($scoreArray['mbti'] == 'enfj')
                            <li><i class="fas fa-caret-left ms-2"></i>به دنبال تأیید شدن از جانب دیگران هستند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بیش از حد حساس هستند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>دودل</li>
                            <li><i class="fas fa-caret-left ms-2"></i>فداکردن خود</li>
                            <li><i class="fas fa-caret-left ms-2"></i>سخت و سازش ناپذیر</li>
                            <li><i class="fas fa-caret-left ms-2"></i>حمایتگری بیش از حد</li>
                            <li><i class="fas fa-caret-left ms-2"></i>ریاکاری</li>
                            @elseif($scoreArray['mbti'] == 'entp')
                            <li><i class="fas fa-caret-left ms-2"></i>می‌توانند بیش از حد استدلال کنند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>علاقه‌ای به کارهای تکراری و برنامه ریزی ندارند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>تحت کنترل قرار گرفتن را دوست ندارند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>تمرکز ندارند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بی احساس</li>
                            @elseif($scoreArray['mbti'] == 'istp')
                            <li><i class="fas fa-caret-left ms-2"></i>شناختشان دشوار است</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بی احساس به نظر می‌رسند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>به سرعت خسته می‌شوند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>خطرپذیر</li>
                            <li><i class="fas fa-caret-left ms-2"></i>علاقه‌ای به تعهد ندارند</li>
                            @endif
                        </ul>
                    </div>
                </div>
                <div class="boxResult row mx-0 justify-content-center">
                    <div class="col-12 mt-4">
                        <div class="row title">
                            <div class="col-1"><i class="fas fa-user c-first-200" style="font-size: 70px"></i></div>
                            <div class="col-9"><h4>نمودار ویژگی های شخصیتی</h4></div>
                            <div class="col-2 mbtiTitle text-center">{{ strtoupper($scoreArray['mbti']) }}</div>
                        </div>
                        @php
                        $ei = $scoreArray['score']['i']+$scoreArray['score']['e'];
                        $sn = $scoreArray['score']['s']+$scoreArray['score']['n'];
                        $tf = $scoreArray['score']['t']+$scoreArray['score']['f'];
                        $jp = $scoreArray['score']['j']+$scoreArray['score']['p'];
                        $iPercent = ceil(($scoreArray['score']['i']*100)/$ei);
                        $ePercent = intval(($scoreArray['score']['e']*100)/$ei);
                        $sPercent = ceil(($scoreArray['score']['s']*100)/$sn);
                        $nPercent = intval(($scoreArray['score']['n']*100)/$sn);
                        $tPercent = ceil(($scoreArray['score']['t']*100)/$tf);
                        $fPercent = intval(($scoreArray['score']['f']*100)/$tf);
                        $jPercent = ceil(($scoreArray['score']['j']*100)/$jp);
                        $pPercent = intval(($scoreArray['score']['p']*100)/$jp);
                        @endphp
                        <div class="chart-container mt-5 row mx-0">
                            <div class="chart-wrapper col-12">
                                <h4 class="chart-title">ارتباط</h4>
                                <div class="chart-description">
                                    این ویژگی نشان می دهد چگونه با محیط اطراف خود ارتباط برقرار می
                                    کنید.
                                </div>
                                <div class="chart" id="chart1">
                                    <div class="chart-info-percentage">
                                        <div class="chart-info-percentage__front">
                                            <span class="text">برونگرایی E</span>
                                            <span class="number">{{ $ePercent }} %</span>
                                        </div>
                                        <div class="chart-info-percentage__back">
                                            <span class="text">درونگرایی I</span>
                                            <span class="number">{{ $iPercent }} %</span>
                                        </div>
                                    </div>
                                    <div class="chart-line">
                                        <div class="chart-line__front" style="width: {{ $ePercent }}%"></div>
                                    </div>
                                </div>
                            </div>
                            <div class="chart-wrapper col-12">
                                <h4 class="chart-title">پردازش اطلاعات</h4>
                                <div class="chart-description">
                                    این ویژگی نشان می دهد که چگونه اطلاعت محیط اطراف تان را درک می
                                    کنید.
                                </div>
                                <div class="chart" id="chart2">
                                    <div class="chart-info-percentage">
                                        <div class="chart-info-percentage__front">
                                            <span class="text">حسی S</span>
                                            <span class="number">{{ $sPercent }} %</span>
                                        </div>
                                        <div class="chart-info-percentage__back">
                                            <span class="text">شهودی N</span>
                                            <span class="number">{{ $nPercent }} %</span>
                                        </div>
                                    </div>
                                    <div class="chart-line">
                                        <div class="chart-line__front" style="width: {{ $sPercent }}%"></div>
                                    </div>
                                </div>
                            </div>
                            <div class="chart-wrapper col-12">
                                <h4 class="chart-title">تصمیم گیری</h4>
                                <div class="chart-description">
                                    این ویژگی نشان می دهد که تصمیم گیری شما در مورد مسائل بر چه
                                    مبنایی است.
                                </div>
                                <div class="chart" id="chart3">
                                    <div class="chart-info-percentage">
                                        <div class="chart-info-percentage__front">
                                            <span class="text">احساسی F</span>
                                            <span class="number">{{ $fPercent }} %</span>
                                        </div>
                                        <div class="chart-info-percentage__back">
                                            <span class="text">منطقی N</span>
                                            <span class="number">{{ $nPercent }} %</span>
                                        </div>
                                    </div>
                                    <div class="chart-line">
                                        <div class="chart-line__front" style="width: {{ $fPercent }}%"></div>
                                    </div>
                                </div>
                            </div>
                            <div class="chart-wrapper col-12">
                                <h4 class="chart-title">برنامه ریزی</h4>
                                <div class="chart-description">
                                    این ویژگی نشان می دهد روش برنامه ریزی شما در زندگی و کار چگونه
                                    است.
                                </div>
                                <div class="chart" id="chart4">
                                    <div class="chart-info-percentage">
                                        <div class="chart-info-percentage__front">
                                            <span class="text">قضاوتی J</span>
                                            <span class="number">{{ $jPercent }} %</span>
                                        </div>
                                        <div class="chart-info-percentage__back">
                                            <span class="text">ادراکی P</span>
                                            <span class="number">{{ $pPercent }} %</span>
                                        </div>
                                    </div>
                                    <div class="chart-line">
                                        <div class="chart-line__front" style="width: {{ $jPercent }}%"></div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="boxResult row mx-0 justify-content-center">
                    <div class="col-12 mt-4">
                        <div class="row title">
                            <div class="col-1"><i class="fas fa-user c-first-200" style="font-size: 70px"></i></div>
                            <div class="col-9"><h4>کارکردهای شناختی</h4></div>
                            <div class="col-2 mbtiTitle text-center">{{ strtoupper($scoreArray['mbti']) }}</div>
                        </div>
                        @if($scoreArray['mbti'] == 'intj')
                            <h4 class="mt-5">کارکرد غالب: شهودی درونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی INTJ از دیدگاه شهودی درونگرا برای بررسی الگوها، مفاهیم و احتمالات استفاده می‌کنند. آن‌ها بیشتر از واقعیت‌های ملموس به معنای واقعیت‌ها علاقمند هستند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>افراد دارای این تیپ از فکر کردن به آینده و بررسی احتمالات لذت می‌برند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>هنگامیکه رویدادی را فراموش می‌کنند؛ بیشتر از جزئیات اتفاق افتاده، برداشت‌ها از آن رویداد را به یاد می‌آورند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INTJ به خوبی می‌توانند معنای پنهان و واقعی نهفته در هر چیزی را درک کنند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کمکی: متفکر برونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>کارکرد متفکر برونگرا به عنوان کارکرد سوم در شخصیت INTJ قادر به اعمال نظم، کنترل و سازماندهی در دنیای اطرافشان هستند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>به همین دلیل در برخورد با مشکلات بسیار آگاهانه و روشمند عمل می‌کنند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>افراد دارای این تیپ شخصیتی به طور منطقی تصمیم گیری می‌کنند. آن‌ها افکارشان را سازماندهی می‌کنند تا به خوبی روابط علت و معلولی را بشناسند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد سوم: احساس درونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INTJ از کارکرد احساسی برونگرا استفاده می‌کنند ولی از آنجا که این کارکرد، سومین است پس کمتر از کارکرد غالب و کمکی مورد استفاده قرار می‌گیرد.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>افرادیکه این جنبه از شخصیت را کامل‌تر توسعه می‌دهند؛ در حین تصمیم گیری توجه بیشتری به ارزش‌ها و احساسات دارند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>در نتیجه نسبت به افراد و اموری که با ارزش‌هایشان هماهنگ هستند؛ گرایش بیشتری دارند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کم رنگ تر: حسی برونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>این کارکرد در INTJ ها چندان توسعه یافته نیست ولی باز هم اثر دارد.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>افراد با کمک این کارکرد می‌توانند پردازش اطلاعات با کمک حواسشان را تجربه کنند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>هنگامیکه این کارکرد فعال است؛ افراد در لحظه زندگی می‌کنند و از دنیای اطرافشان انرژی می‌گیرند.</li>
                            </ul>
                        @elseif($scoreArray['mbti'] == 'estp')
                            <h4 class="mt-5">کارکرد غالب: حسی برونگرا</h4>
                            <p class="mt-3">برونگراها از تعامل اجتماعی انرژی می‌گیرند. به همین دللی افرادی معاشرتی، تعاملی و اهل ماجراهایی جدید هستند. گرایش بیشتری به دنیای بیرون به خاطر دریافت محرکهای حسی بیشتر است.</p>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>متمرکز بر واقعیت: از آنجا که این تیپ روی زمان حال متمرکز است، واقع گرا محسوب می‌شود. آن‌ها به تصاویر، صداها و تجارب اطرافشان علاقمند هستند و گرایش کمی به خیالپردازی و رویا پردازی دارند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>ماجراجویی: این افراد حسی به دنبال لمس کردن، شنیدن، چشیدن و دیدن هر چیزی هستند که توجهشان را جلب کرده است. در هنگام یادگیری هم فقط به خواندن و شنیدن اکتفا نمی‌کنند و خودشان باید آن را تجربه کنند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>انرژی بالا: تیپ‌های ESTP انرژی زیادی دارند پس از محیطهای کسل کننده یا از موقعیت‌های یادگیری حاوی حجم بالای اطلاعات نظری، خسته می‌شوند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>عملگرا هستند: آن‌ها مجریان خوبی هستند. آن‌ها مستقیماً وارد عمل می‌شوند و در حین انجام کارها، خطرپذیر هستند. آن‌ها از فعال بودن لذت می‌برند و به فعالیتی که حس کاربردی بودن و بهره وری به آن‌ها می‌دهد، علاقمند هستند. برای مثال از ورزش‌های تکراری یا دویدن روزانه روی تردمیل خسته می‌شوند. آن‌ها به دنبال فعالیتهای جدید یا مفید می‌روند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کمکی: متفکر درونگرا</h4>
                            <p class="mt-3">تیپ‌های ESTP در حین قضاوت در مورد امورات دنیوی روی دنیای درونشان متمرکز شده و اطلاعات را به طور منطقی پردازش می‌کنند. از آنجا که این جنبه از شخصیت به صورت درونگرا است به همین دلیل این افراد به سرعت متوجه آن نمی‌شوند.</p>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>بسیار منظم: این حس کنترل درونی باعث خود نظم دهی به تیپ‌های ESTP می‌شود. آن‌ها مهارت فعالیت مستقل را دارند و برای رسیدن به هدفشان به خوبی عمل می‌کنند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>بسیار هوشیار: آن‌ها مهارتهای خوبی در زمینه مشاهده گری دارند و چیزهایی که دیگران نادیده می‌گیرند را به خوبی درک می‌کنند. آن‌ها با کمک منطق می‌توانند اطلاعات دریافتی را بررسی کنند و به راه حل‌های عملی و فوری برسند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد سوم: احساسی برونگرا</h4>
                            <p class="mt-3">این کارکرد روی ایجاد همرنگی اجتماعی و روابط با دیگران متمرکز است. با اینکه هیجانها قویترین جنبه شخصیتی ESTP ها نیستند ولی آنها به تعامل اجتماعی بسیار نیاز دارند.</p>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>معاشرتی: آن‌ها از مرکز توجه بودن لذت می‌برند و به خوبی می‌توانند روابط دوستانه‌ای را با سایر افراد تشکیل دهند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>جلب رضایت دیگران: با اینکه تیپ ESTP بسیار اجتماعی است ولی گاهی اوقات برای در میان گذاشتن عقاید و قضاوت‌هایش با دیگران چندان راحت نیستند. آن‌ها به جای اینکه به نفع خودشان عمل کنند؛ روی جلب رضایت دیگران و حفظ همرنگی متمرکز است. شاید بارها نیازهای خودشان را برای شاد کردن دیگران نادیده بگیرند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>بشر دوستانه: این جنبه از شخصیت ESTP ها هم آنها را در جهت کمک به دیگران برای ساختن دنیایی بهتر سوق می‌دهد. آن‌ها نگران دیگران هستند و می‌توانند راه حل‌های عملی مشکلات را پیدا کنند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کم رنگ تر: شهودی درونگرا</h4>
                            <p class="mt-3">این جنبه از شخصیت روی بررسی اطلاعات برای مشاهده الگوها و رسیدن به حس درونی در مورد موقعیت‌های پیش‌رو متمرکز است. آن‌ها با این کارکرد می‌توانند داده‌های ورودی را بررسی نموده و آینده را پیش بینی کنند.</p>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>جستجوی روابط: آن‌ها به دنبال روابطی هستند که آنها را به برداشت‌های مناسبی از احتمالات آتی خواهد رساند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>گاهی اوقات به واکنش‌های غریزی اعتماد ندارد: شهود جنبه قدرتمندی از شخصیت ESTP ها نیست ولی گاهی اوقات می‌توانند واکنش‌های غریزی نه چندان خوبی را به موقعیت نشان دهند. به همین دلیل حس می‌کنند که حس غریزی چندان خوبی ندارند.</li>
                            </ul>
                            <p class="mt-3">از آنجا که این جنبه شخصیتی چندان قدرتمند نیست گاهی اوقات به نقطه ضعفشان تبدیل می‌شود. هنگامیکه این جنبه به خوبی توسعه یابد به افرادی با بصیرت قوی می‌رسیم که می‌توانند از آموخته‌های حسی خودشان در جهت جستجوی الگوها و برقراری روابط میان آنها استفاده کنند. افرادیکه این جنبه در آنها ضعیف است در قضاوتهایی که تحت حمایت شواهد کافی قرار ندارد، دچار لغزش می‌شوند.</p>
                        @elseif($scoreArray['mbti'] == 'isfj')
                            <h4 class="mt-5">کارکرد غالب: حسی درونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>این کارکرد باعث تمرکز این درونگراهای حسی روی جزئیات و واقعیت‌ها می‌شود.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>این تیپ‌های شخصیتی، اطلاعات دقیق را به نظریه‌های انتزاعی ترجیح می‌دهند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به سرعت با محیطهای مشخص و واقعی، سازگار می‌شوند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>به خاطر اینکه روی مسائل آشنا متمرکز هستند و از آنها مخافظت می‌کنند در اغلب مواقع افرادی بسیار سنتی محسوب می‌شوند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها در حین تصمیم گیری، تجارب گذشته را مورد بررسی قرار می‌دهند تا بتوانند پیامدهای تصمیمات و رویدادهای آتی را پیش بینی کنند</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کمکی: احساسی برونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی ISFJ به برداشت‌های شخصی خودشان توجه زیادی دارند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>این احساسی‌های برونگرا روی ایجاد هماهنگی اجتماعی و روابط متمرکز هستند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها برای ایجاد این روابط از رفتارهای مناسب و مفید اجتماعی مثل مؤدب بودن، مهربانی، ملاحظه‌گری و یاری استفاده می‌کنند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ISFJ به دنبال تأمین نیازها و خواسته‌های دیگران هستند و گاهی اوقات منافع خودشان را برای اطمینان از شادی دیگران، قربانی می‌کنند</li>
                            </ul>
                            <h4 class="mt-5">کارکرد سوم: متفکر درونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی ISFJ برنامه ریز هستند و به سازماندهی و نظم زیاد، علاقه دارند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها از منطق در جهت درک عملکرد جهان استفاده می‌کنند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها بعد از دریافت اطلاعات و تجربیات جدید به دنبال برقراری ارتباط و هماهنگی میان آنها هستند تا الگوهای کلی‌تر را پیدا کنند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به جای شناخت بخش کوچکی از هر چیز به دنبال مشاهده نحوه هماهنگی آنها با یکدیگر و عملکرد کلی آنها هستند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کم رنگ تر: شهودی برونگرا</h4>
                            <p class="mt-3">با اینکه آنها روی زمان حال و واقعیت‌های دقیق متمرکز هستند؛ ولی این کارکرد تا حد زیادی ناهشیار است و با استفاده از تمرکز روی احتمالات به تعادل شخصیتی ISFJ ها کمک می‌کند</p>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>بررسی واقعیت‌ها و بعد بررسی احتمالات به نگرش‌های جدید در مورد مسائل می‌رسد.</li>
                            </ul>
                        @elseif($scoreArray['mbti'] == 'entj')
                            <h4 class="mt-5">کارکرد غالب: متفکر برونگرا (Extraverted Thinking)</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>این نوع ENTJ به دستورالعملهایی که روش تصمیم گیری و قضاوت را نشان می‌دهند؛ علاقمند است.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>این ENTJ ها بدون گوش دادن، اول از همه تمایل به حرف زدن دارند و قبل از اینکه تمامی جوانب یک موقعیت را در نظر بگیرند؛ به قضاوتهای شتابزده روی می‌آورند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>با اینکه تمایل به قضاوت شتابزده دارند؛ ولی بسیار منقطی و عینی عمل می‌کنند. آن‌ها روی اعمال نظم و استانداردها بر جهان اطرافشان متمرکز هستند. تعیین اهداف قابل اندازه گیری برایشان مهم است.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کمکی: شهودی درونگرا (Introverted Intuition)</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>افراد با این نوع تیپ شخصیتی روی آینده متمرکز هستند و همواره در حین تصمیم گیری، احتمالات را در نظر می‌گیرند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENTJ به آینده می‌اندیشند و ترسی از تغییر ندارند. آن‌ها به غرایزشان اعتماد می‌کنند ولی از نتیجه گیری شتابزده اجتناب می‌نمایند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد سوم: حسی برونگرا (Extraverted Sensing)</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>این کارکرد شناختی ذوق اکتشاف را به تیپ ENTJ می‌دهد. آن‌ها از تجارب جدید لذت می‌برند و گاهی اوقات هم به رفتارهای هیجان طلبانه روی می‌آروند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>از آنجا که تمرکز حسی آنها به سمت بیرون است، زیبایی‌های زندگی را درک می‌کنند. آن‌ها در اغلب مواقع دور و برشان را پر از چیزهای جالب و جذاب می‌کنند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد آخر : احساسی درونگرا (Introverted Feeling)</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>کارکرد احساسی درونگرا روی احساسات و ارزش‌های درونی متمرکز است. هیجان‌ها حوزه‌ای دشوار برای ENTJ ها است و غالباً درکی از این بعد شخصیتشان و اثرگذاری آن بر فرایند تصمیم گیری خودشان، ندارند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>هنگامیکه این جنبه از شخصیت ENTJ ها ضعیف است؛ آنها در مواقعی که باید واکنش عاطفی نشان دهند؛ دستپاچه شده و احساس ناخوشایندی پیدا می‌کنند.</li>
                            </ul>

                            @elseif($scoreArray['mbti'] == 'isfp')
                            <h4 class="mt-5">کارکرد غالب: احساسی درونگرا</h4>
                            <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ شخصیتی ISFP به مسائل شخصی بیشتر از اطلاعات عینی و منطقی اهمیت می‌دهد</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها بر اساس احساساتشان با اطلاعات و تجارب پیش رو، مواجه می‌شوند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها دارای سیستم ارزشی خاص خودشان هستند و براساس مسائل متناسب با ایده‌های خودشان به قضاوتهای خود جوش می‌رسند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کمکی: حسی برونگرا</h4>
                            <ul>
                            <li><i class="fas fa-caret-left ms-2"></i>افراد دارای شخصیت ISFP با دنیای اطرافشان بسیار هماهنگ هستند و با اطلاعات حسی سازگار هستند. حتی از کوچکترین تغییرات فوری در محیط اطرافشان هم آگاهی دارند. به همین خاطر به زیبایی شناسی و هنر اهمیت می‌دهند</li>
                            <li><i class="fas fa-caret-left ms-2"></i>روی زمان حال متمرکز هستند، اطلاعات جدید را در نظر می‌گیرند و بعد عمل می‌کنند. آن‌ها به خوبی از اطرافشان آگاهی دارند. به کوچکترین جزئیاتی که از دید دیگران دور می‌ماند، توجه می‌کنند. در حین یادآوری رویدادهای گذشته به خوبی تجسم‌های بصری، بوها و صداها را به خاطر می‌آورند و خاطرات مربوط به آنها را فراخوانی می‌کنند.</li>
                            </ul>
                            <h4 class="mt-5">کارکرد سوم: شهودی درونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>این کارکرد در پس زمینه شخصیتی عمل کرده و از کارکرد حسی برونگرا تغذیه می‌شود</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ شخصیتی ISFP جزئیات دنیا را در نظر می‌گیرد و دارای «حس درونی» در مورد رویدادها و موقعیت‌ها است. با اینکه در اغلب مواقع علاقه‌ای به مفاهیم یا ایده‌های انتزاعی ندارند؛ ولی کارکرد شهودی درونگرا می‌تواند آنها را به سمت برداشتهایی در مورد خودشان و دیگران سوق دهد</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کم رنگ تر: متفکر برونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها در سازماندهی ضعف دارند ولی می‌توانند از این کارکرد تحت شرایط خاصی استفاده کنند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>این کارکرد در مورد بهره وری در انجام امور است. تیپ ISFP می‌تواند روی جزئیات دقیق شود و  کارآمدترین روش برای بیان یک ایده را پیدا کند</li>
                            </ul>

                            @elseif($scoreArray['mbti'] == 'istj')
                            <h4 class="mt-5">کارکرد غالب: حسی درونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ شخصیتی ISFP به مسائل شخصی بیشتر از اطلاعات عینی و منطقی اهمیت می‌دهد</li>
                                <li><i class="fas fa-caret-left ms-2"></i>حسی‌های درونگرا روی زمان حال متمرکز هستند و اطلاعات زیادی را از اطرافشان جمع می‌کنند</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کمکی: متفکر برونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی ISTJ افرادی منطقی و  کارآمد هستند. آن‌ها از بررسی منطقی رویدادها لذت می‌برند</li>
                                <li><i class="fas fa-caret-left ms-2"></i> کارآمدی و بهره وری برای این افراد اهمیت زیادی دارد. آن‌ها دانش دارای کاربردهای عملی و فوری را به سرعت یاد می‌گیرند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها بیشتر از اطلاعات انتزاعی روی جزئیات متمرکز می‌شوند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ISTJ بیشتر از تصمیم گیری بر اساس احساسات شخصی، براساس منطق و داده‌های عینی تصمیم می‌گیرند</li>
                            </ul>
                            <h4 class="mt-5">کارکرد سوم: احساسی درونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ISTJ در حین تصمیم گیری براساس ارزش‌های درونی خودشان به تفسیرهای شخصی می‌پردازند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها این شرایط را به صورت «غریزی» یا «حس درونی» توصیف می‌کنند. آن‌ها شاید به طور منطقی تصمیم بگیرند؛ ولی حس درونی به آنها می‌گوید که علاوه بر واقعیت‌ها، احساساتشان را هم در نظر بگیرند</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کم رنگ تر: شهودی برونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>این جنبه از شخصیت از ایده‌ها و تجارب جدید لذت می‌برد</li>
                                <li><i class="fas fa-caret-left ms-2"></i>این کارکرد، ضعیف‌ترین بخش از شخصیت تیپ‌های ISTJ است ولی با توسعه آن گاهی اوقات به شخصیت متعادل‌تری می‌رسد</li>
                            </ul>

                            @elseif($scoreArray['mbti'] == 'infp')
                                <h4 class="mt-5">کارکرد غالب: احساسی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی INFP احساسات عمیقی را تجربه می‌کنند ولی به عنوان افرادی درونگرا تا حد زیادی به پردازش این هیجانهای درونی می‌پردازند. آن‌ها از دنیا شگفت زده‌اند و حس نوعدوستی و همدلی زیادی در قبال دیگران دارند. با اینکه احساسات بسیار قدرتمند دارند؛ ولی آنها را بیان نمی‌کنند به همین دلیل این رفتارشان را با کناره گیری یا سردی اشتباه می‌گیریم</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کمکی: شهودی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ شخصیتی INFP با کمک تخیل و سناریوهای «چه می‌شد، اگر» به بررسی موقعیت‌ها پرداخته و قبل از هر اقدامی، انواع احتمالات مختلف را بررسی می‌کند. زندگی درونی آنها بر شخصیتشان  غلبه دارد و با کمک قدرت شهود با دنیای بیرون تعامل برقرار می‌کنند. آن‌ها روی تصویر کلی و بزرگی از شرایط و مسائلی که آینده را شکل می‌دهند؛ متمرکز هستند. آن‌ها با کمک این توانایی می‌توانند به رهبرانی انقلابی تبدیل شوند که عاشق اعمال تغییرات مثبت در دنیا هستند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد سوم: حسی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INFP هنگامیکه اطلاعات را دریافت می‌کنند، حافظه روشنی از رویدادها می‌سازند. آن‌ها این رویدادها را بارها در ذهنشان تکراری می‌کنند؛ تا بتوانند در موقعیت‌هایی که تنش کمتری دارند به تحلیل رویدادها بپردازند. این خاطرات به طور معمول با هیجانات قدرتمندی در ارتباط هستند. پس فراخوانی یک خاطره را می‌توان مثل بازسازی یک تجربه در نظر گرفت</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کم رنگ تر: متفکر برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>این کارکرد شامل سازماندهی و معنادادن به دنیا با شیوه‌ای عینی و منطقی است. با اینکه این کارکرد دارای اثرگذاری ناخودآگاه بر شخصیت INFP است؛ ولی می‌تواند تحت شرایط تنش زا ظاهر شود. هنگامیکه شخصیت INFP  با استرس مواجه می‌شود؛ به ناگهان به صورت عملگرا و جزئی نگر درآمده و بیشتر از هیجان روی منطقش متمرکز  می‌شود. از آنجا که آنها در اغلب مواقع تحت سلطه شهود و هیجان‌ها قرار دارند؛ پس گاهی اوقات با حس عدم بهره وری و نا کارآمدی درگیر هستند. یادگیری در جهت توسعه کارکرد متفکر برونگرا به آنها کمک می‌کند تا به حس تعادل بهتری در این تیپ شخصیتی برسند</li>
                                </ul>

                            @elseif($scoreArray['mbti'] == 'intp')
                                <h4 class="mt-5">کارکرد غالب: متفکر درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>این کارکرد در مورد جذب اطلاعات در مورد دنیای اطراف است. تیپ‌های INTP به دنبال شناخت عملکرد هر چیزی هستند. آن‌ها وسایل بزرگ یا ایده‌ها را به اجزای کوچکتر تقسیم می‌کنند تا اجزایش را بررسی کرده و هماهنگی و عملکردشان در کنار یکدیگر را بررسی نمایند. آن‌ها متفکرانی بسیار توانمند و منطقی هستند و قبل از اینکه عقایدشان را با دیگران در میان بگذارند یا اقدامی صورت دهند؛ تمامی جوانب امور را می‌سنجند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کمکی: شهودی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌ های INTP در تصمیم گیری به بررسی احتمالات می پردازند. آن‌ها از نگرش، تجسم و تجارب گذشته برای شکل دهی به ایده‌هایشان استفاده می‌کنند. آن‌ها به بررسی دانسته‌هایشان پرداخته و به دنبال الگوها و روابط می‌گردند تا به درک و بینش کاملی نسبت به مشکل یا مسأله پیش رو برسند. آن‌ها زمان زیادی را صرف فکر کردن به آینده می‌کنند و تمامی احتمالات را می‌سنجند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد سوم: حسی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی INTP بسیار جزئی نگر هستند و با دقت تمامی واقعیت‌ها و تجارب قبلی را در نظر می‌گیرند. و در حین جمع آوری اطلاعات به مقایسه آنها با دانسته‌های قبلی می‌پردازند تا به پیش بینی رویدادهای آتی برسند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کم رنگ تر: احساسی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به دنبال همرنگ شدن با گروهها هستند. با اینکه درونگرا هستند ولی اگر در جمع افراد آشنا قرار گیرند به خوبی ابراز وجود می‌کنند. با این حال تحت تنش، احساسات شان را سرکوب می‌کنند و در برقراری ارتباط با دیگران به مشکل بر می‌خورند. تحت استرس بیشتر از احساسات به منطق شان تکیه می‌کنند</li>
                                </ul>

                            @elseif($scoreArray['mbti'] == 'infj')
                                <h4 class="mt-5">کارکرد غالب: شهودی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>یعنی آنها بیش از حد روی نگرش‌های درونی خودشان متکی هستند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>هنگامیکه در مورد چیزی به شهود می‌رسند، بسیار به آن توجه می‌کنند تا به یک تمرکز یک جانبه برسند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>به همین خاطر گاهی اوقات به عنوان افرادی یک دنده و لجباز محسوب می‌شوند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کمکی: احساسی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>این ویژگی باعث آگاهی تیپ INFJ از احساسات دیگران می‌شود؛ ولی این بدان معناست که گاهی اوقات نسبت به هیجانهای خودشان، آگاهی کمتری دارند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INFJ گاهی اوقات به خاطر وجود همین کارکرد با نه گفتن به تقاضای دیگران مشکل دارند. آن‌ها به خوبی احساسات دیگران را درک می‌کنند و نمی‌خواهند باعث ناامیدی یا لطمه زدن به احساسات دیگران شوند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد سوم: متفکر درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های INFJ بر اساس ایده‌ها و نظریه‌های مبتنی برنگرش‌های خودشان به تصمیم گیری می‌پردازند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها در حین تصمیم گیری به ویژه در کنار دیگران اول روی کارکرد شهودی درونگرا و احساسی برونگرا متمرکز می‌شوند؛ ولی هنگامیکه تنها هستند بیشتر روی کارکر د متفکر درونگرا متمرکز هستند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها در شرایط تنش زا برای تصمیم گیری روی هیجانهایشان متمرکز هستند؛ به ویژه اگر بخواهند رضایت دیگران را جلب کنند. با این حال تحت شرایطی با تنش کمتر، بیشتر روی توانایی شهودی خودشان متمرکز می‌شوند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کم رنگ تر: حسی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>با اینکه این کارکرد چندان در این افراد توسعه پیدا نکرده و تا حد زیادی جنبه ناهشیار شخصیت INFJ محسوب می‌شود. ولی روی شخصیت آنها اثر دارد</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>این جنبه از شخصیت به INFJ کمک می‌کند تا به دنیای اطرافشان توجه کنند و نسبت به اطرافشان به آگاهی برسند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>کارکرد حسی برونگرا به زندگی کردن در زمان حال به جای نگرانی در مورد آینده کمک می‌کند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>این جنبه از شخصیت به آنها کمک می‌کند تا فعالیت‌های بدنی مثل پیاده روی و رقصیدن را درک کنند</li>
                                </ul>
                            @elseif($scoreArray['mbti'] == 'estj')
                                <h4 class="mt-5">کارکرد غالب: متفکر برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی ESTJ در حین تصمیم گیری به جای احساسات شخصی، روی اطلاعات عینی و منطقی متکی هستند. آن‌ها مهارت خاصی در تصمیم گیری عینی و بی طرفانه دارند. آن‌ها در حین قضاوت کردن به جای تمرکز روی احساسات ذهنی خودشان، واقعیت‌ها و منطق را برای اتخاذ تصمیم‌های منطقی در نظر می‌گیرند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>افراد دارای تیپ ESTJ بسیار عملگرا هستند. آن‌ها از یادگیری موضوعات واقعی که کاربرد فوری در جهان دارند، لذت می‌برند ولی علاقه‌ای به موضوعات نظری و انتزاعی نشان نمی‌دهند. آن‌ها از حقایق مشخص، بیشتر از اطلاعات انتزاعی لذت می‌برند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>آنها به خوبی تصمیمات سریع و دقیق می‌گیرند ولی احتمال قضاوت شتابزده بدون در نظر گرفتن تمامی اطلاعات موقعیتی هم وجود دارد. این ویژگی از جنبه مثبت خودش، آن‌ها را به رهبرانی خوب تبدیل می‌کند ولی گاهی اوقات هم آنها را افرادی خشن و متحجر نشان می‌دهد</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کمکی: حسی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به خوبی هر چیزی را با جزئیات کامل به خاطر می‌آورند. حافظه‌ای که از رویدادهای گذشته دارند کاملاً واضح است و از فراخوانی تجارب گذشته برای برقراری ارتباط با رویدادهای حال استفاده می‌کنند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>از آنجا که کارکرد حسی این تیپ شخصیتی بر دنیای درونشان متمرکز است؛ چندان اهمیتی به مسائل جدید نمی‌دهند و بیشتر روی موضوعات آشنا، متمرکز هستند. آن‌ها از عادت‌ها و کارهای روتین لذت می‌برند؛ چون این شرایط حس ثبات و پیش بینی پذیری را به آنها می‌دهد ولی می‌تواند آنها را به افرادی سرسخت و تسلیم ناپذیر تبدیل کند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد سوم: شهودی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>این جنبه از شخصیت آنها به دنبال ایده‌ها و احتمالات جدید است. این کارکرد باعث می‌شود تا این تیپ شخصیتی، خلاقیتش را بررسی کند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>آنها با پردازش ایده‌ها و اطلاعات جدید به بررسی مفاهیم احتمالی می‌پردازند تا بتوانند روابط یا الگوهای جدید را پیدا کنند. با این کار می‌توانند اطلاعات ورودی را بررسی کرده و تفسیرها یا پیامدهای احتمالی و متنوع را پیدا کنند.</li>

                                </ul>
                                <h4 class="mt-5">کارکرد کم رنگ تر: احساسی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>شخصیت‌های ESTJ با کمک این کارکرد به جای تصمیم گیری منطقی، بیشتر به تصمصم گیری احساسی روی می‌آورند. این ارزش‌های درونی هستند که به احساسات درونی در مورد برخی از موقعیت‌ها می‌رسند. با اینکه این کارکرد در اغلب مواقع به کار نمی‌رود ولی در برخی موارد به فرد اجازه می‌دهد تا احساسات ذهنی را به تفسیر عینی از موقعیت ترجیح دهد</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ESTJ به هیجاناتشان خیلی فکر می‌کنند. پس این کارکرد در اغلب موارد به صورت بسیار ناخودآگاه عمل می‌کند.</li>
                                </ul>
                            @elseif($scoreArray['mbti'] == 'esfp')
                                <h4 class="mt-5">کارکرد غالب: احساسی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها وقت زیادی را صرف برنامه ریزی و سازماندهی نمی‌کنند. در عوض گزینه‌های مختلفی را پیش رویشان قرار می‌دهند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها در حین حل مسأله به غرایزشان اعتماد می‌کنند و برای رسیدن به راه حل، به توانمندیهایشان اعتماد دارند. با اینکه منطقی و عملگرا هستند؛ ولی علاقه‌ای به نظم و برنامه ریزی ندارند. در عوض به طور خودجوش عمل کرده و وقت چندانی را صرف برنامه و زمانبندی نمی‌کنند.</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کمکی: احساسی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>افراد دارای این تیپ شخصیتی دارای سیستم درونی ارزش‌ها هستند که تصمیم گیری‌هایشان را براساس آن انجام می‌دهند. آن‌ها به خوبی از هیجانها و عواطفشان آگاهی دارند و با دیگران همدلی می‌کنند. آن‌ها به خوبی می‌توانند خودشان را جای دیگران بگذارند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد سوم: متفکر برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>این کارکرد روی اعمال نظم در دنیای بیرون متمرکز است. این کارکرد روی بهره وری، منطق و پیامدها تکیه می‌کند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>از آنجا که این کارکرد، جنبه ضعیف‌تر شخصیت محسوب می‌شود؛ پس ESFP ها هم همواره از در میان گذاشتن قضاوت‌هایشان احساس امنیت نمی‌کنند. به ویژه اگر این کار، هماهنگی گروهی را از بین ببرد.</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کم رنگ تر: شهودی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>چون این کارکرد، آخرین جنبه برجسته از شخصیت است پس به ESFP در جهت شناخت الگوها و برقراری روابط میان اجزای مشاهده شده کمک می‌کند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصتی SEFP چندان در به کارگیری منطق برای دسته بندی مفاهیم انتزاعی، خبره نیستند ولی گاهی اوقات از بینش و شهود در مورد خودشان و دنیا استفاده می‌کنند</li>
                                </ul>
                            @elseif($scoreArray['mbti'] == 'esfj')
                                <h4 class="mt-5">کارکرد غالب: احساسی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ESFJ براساس احساس‌ها و هیجانهای فردی و نگرانی در قبال دیگران به تصمیم گیری می‌پردازند. آن‌ها بیشتر از در نظر گرفتن معیار عینی به تأثیر فردی آن تصمیم فکر می‌کنند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ESFJ بر اساس «احساسات درونی» خودشان به قضاوت در مورد افراد و موقعیت‌ها می‌پردازند. آن‌ها در اغلب مواقع به تصمیم گیری‌های شتابزده می‌پردازند و به سرعت احساسات و عقایدشان را با دیگران در میان می‌گذارند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>این گرایش در برخی مواقع بسیار عالی است چون می‌توانند به سرعت تصمیم گیری کنند. البته این کار دارای جنبه منفی هم هست و گاهی اوقات باعث قضاوتهای نادرست درباره دیگران می‌شود.</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کمکی: حسی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ESFJ بیشتر از آینده روی زمان حال متمرکز هستند. آن‌ها به جزئیات دقیق و فوری بیشتر از اطلاعات انتزاعی و نظری علاقه دارند.</li>
                                </ul>
                                <h4 class="mt-5">کارکرد سوم: شهودی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>این کارکرد شناختی به تیپ‌های ESFJ کمک می‌کند تا روابط بین فردی را برقرار نموده و راه حل‌های خلاقه‌ای را برای مشکلات پیدا کنند. آن‌ها در حین بررسی یک موقعیت به احتمالات توجه می‌کنند. آن‌ها غالباً به الگوهایی می‌رسند که به آنها در شناخت افراد و کسب تجربه کمک می‌کند.</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کم رنگ تر: متفکر درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ESFJ اهل نظم و برنامه ریزی از ابتدای کار هستند. آن‌ها با برنامه ریزی به حس کنترل بیشتری روی دنیای اطرافشان می‌رسند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>این جنبه از شخصیت ESFJ به آنها در جهت تحلیل اطلاعات پیچیده کمک می‌کند ولی این امر در اغلب مواقع به عنوان نقطه ضعفشان محسوب می‌شود به ویژه هنگامیکه باید به مفاهیم نظری و انتزاعی معنا بدهند.</li>
                                </ul>
                            @elseif($scoreArray['mbti'] == 'enfp')
                                <h4 class="mt-5">کارکرد غالب: شهودی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی ENFP معمولاً روی دنیای احتمالات متمرکز می‌شود. آن‌ها در تفکر انتزاعی خبره هستند و چندان علاقه‌ای به تمرکز روی جزئیات ریز ندارند. آن‌ها مبتکر هستند و روی آینده متمرکز می‌شوند. آن‌ها به جای اینکه هر چیزی را همانگونه که هست ببینند به خوبی قابلیت و توان بالقوه آن را بررسی می‌کنند. آن‌ها به خوبی روی روابط متمرکز می‌شوند و با مهارت می‌توانند الگوها و تعاملات موجود در میان انسان‌ها، موقعیت‌ها و ایده‌ها را بشناسند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کمکی: احساسی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENFP در حین تصمیم گیری بیشتر از منطق و معیار عینی به احساسات و ارزش‌ها توجه می‌کنند. آن‌ها به ندای قلبشان گوش می‌کنند؛ با دیگران همدلی می‌کنند و اجازه می‌دهند تا عواطفشان به راهنمای زندگی آنها تبدیل شوند. آن‌ها با خودشان و ارزشهایشان روراست هستند. در دنیای ایده ال آن‌ها، ارزشهاشان هماهنگ با ارزشهای دنیا است</li>
                                </ul>
                                <h4 class="mt-5">کارکرد سوم: متفکر برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>این کارکرد مبتنی بر سازماندهی منطقی ایده‌ها و اطلاعات است. تیپ ENFP در حین بررسی اطلاعات می‌تواند از این کارکرد برای مرتب کردن داده‌های مجزا در جهت رسیدن به روابط میان آنها استفاده کند. برای مثال این تیپ می‌تواند در حین حل مسأله با صدای بلند فکر کند و به تمامی اطلاعات طوری نظم دهد که ریلی از افکار به راحتی شکل بگیرد.</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کم رنگ تر: حسی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENFP این کارکرد را با مقایسه تجارب فعلی و گذشته خودشان، بیان می‌کنند. آن‌ها برای این منظور به خوبی قادر به فراخوانی خاطرات، احساسات و عواطف مرتبط با رویدادها هستند. با این کار به دنبال الگوها می‌گردند و تجارب آتی را بر اساس تجارب قبلی شکل می‌دهند.</li>
                                </ul>
                            @elseif($scoreArray['mbti'] == 'enfj')
                                <h4 class="mt-5">کارکرد غالب: احساسی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENFJ با مشارکت در رفتارهای اجتماعی و روابط اجتماعی به خوبی این کارکرد را ابراز می‌کنند. آن‌ها به خوبی احساسات افراد را درک می‌کنند و این نوع دوستی گاهی اوقات آنقدر پیش می‌رود که نیازهای خودشان را برای راضی کردن دیگران نادیده می‌گیرند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>افراد دارای شخصیت پیشرو در حین تصمیم گیری، بیشتر از معیارهای عینی، روی ملاحظات ذهنی تأکید دارند. اولین نگرانی آنها هم تأثیر تصمیمشان روی دیگران است.</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کمکی: شهودی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENFJ بیشتر از زمان حال در مورد آینده فکر می‌کنند. آن‌ها بیشتر اوقات روی اهداف بزرگی متمرکز می‌شوند که آنها را از توجه به جزئیات باز می‌دارد</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENFJ در حین گرفتن اطلاعات در مورد دنیای اطرافشان با کارکرد شهودی درونگرا به پردازش این داده‌ها می‌پردازند تا به برداشت‌ها، ایده‌ها و افکار مدنظرشان برسند. با این کار می‌توانند الگوها را مشخص نموده و به داده‌های پیچیده یا انتزاعی معنا دهند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد سوم: حسی برونگرا</h4>
                                <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>کارکرد حسی برونگرا، تیپ‌های ENFJ را به زمان حال می‌برد تا جزئیات دقیق و اطلاعات حسی را از محیط اطرافشان گردآوری کنند. به همین خاطر در اغلب مواقع به دنبال تجارب و احساسات جدید و جالب هستند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>افراد دارای تیپ شخصیت پیشرو از محیط حال حاضرشان آگاهی زیادی دارند. همین امر باعث درک عالی جنبه‌های زیبایی شناختی و گرایش به ایجاد فضایی خوشایند می‌شود</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کم رنگ تر: متفکر درونگرا</h4>
                            <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENFJ افرادی منظم هستند که از سازماندهی و برنامه ریزی دقیق لذت می‌برند. آن‌ها با داشتن برنامه زمانی قابل پیش بینی به خوبی کنترل دنیای اطرافشان را به دست می‌گیرند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>از آنجا که این کارکرد، پست‌تر محسوب می‌شود؛ پس شاید ENFJ ها به قابلیت منطقی بودن خودشان چندان اعتماد نکنند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها با توسعه این کارکرد به حس تعادل و کنترل بهتری روی فرایند تصمیم گیری خودشان می‌رسند. بی توجهی به این جنبه از شخصیت در حین تصمیم گیری، تنها باعث تکیه بر ارزش‌های فردی می‌شود</li>
                                </ul>
                            @elseif($scoreArray['mbti'] == 'entp')
                                <h4 class="mt-5">کارکرد غالب: شهودی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENTP به سرعت اطلاعات را دریافت می‌کنند و افرادی بسیار روشن فکر هستند</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>هنگامیکه این اطلاعات را جمع آوری کردند به برقراری ارتباط میان روابط درونی و پیچیده می‌روند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به خوبی می‌توانند روابطی را که از دید دیگران دور مانده را مشاهده کرده و روی احتمالات متمرکز می‌شوند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها ذهنی کارآفرین دارند و همواره به ایده‌های جدید و جذاب می‌رسند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کمکی: متفکر درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENTP این کارکرد شناختی را در طول پردازش فکری ابراز می‌کنند. افراد دارای این تیپ، بیشتر روی کسب اطلاعات در مورد دنیای اطرافشان متمرکز می‌شوند. آن‌ها به طور بسیار منطقی از این اطلاعات برای رسیدن به نتیجه گیری استفاده می‌کنند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ENTP افرادی منطقی و عینی هستند. آن‌ها در حین تصمیم گیری به شواهد منطقی، بیشتر از اطلاعات ذهنی و هیجانی اهمیت می‌دهند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>این کارکرد به تیپ ENTP در جهت درک اطلاعات حاصل از کارکرد شهودی برونگرا کمک می‌کند. یعنی برای معنادادن به ایده‌ها و اطلاعات مجزا از منطق و نظم حاصل از این کارکرد، استفاده می‌شود. تیپ‌های ENTP تنها به شناخت عملکرد چیزهای اطرافشان اکتفا نمی‌کنند؛ بلکه به دنبال شناخت چرایی و نحوه عملکردشان هستند.</li>
                                </ul>
                                <h4 class="mt-5">کارکرد سوم: احساسی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>این کارکرد در درجه سوم اهمیت قرار می‌گیرد؛ پس جنبه چندان توسعه یافته‌ای از شخصیت محسوب نمی‌شود.
هنگامیکه این کارکرد توسعه یابد؛ تیپ‌های ENTP به افرادی جذاب در فضای اجتماعی تبدیل می‌شوند که به خوبی با دیگران کنار می‌آیند.
</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>هنگامیکه این جنبه از شخصیت، ضعیف‌تر است؛ تیپ ENTP هم نسبت به رفتار دیگران حساس می‌شود و حتی به عنوان افرادی منزوی و نامهربان محسوب می‌شوند</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کم رنگ تر: حسی درونگرا</h4>
                            <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>کارکرد حسی درونگرا روی شناخت گذشته متمرکز است و در اغلب موارد در مورد تجارب فعلی و نگرانی‌های آتی به کار می‌رود</li>
                                <li><i class="fas fa-caret-left ms-2"></i>این کارکرد بیشتر به عنوان نقطه ضعف شخصیت‌های ENTP محسوب می‌شود. آن‌ها در اغلب موارد روی احتمالات متمرکز می‌شوند و برای در نظر گرفتن پیشامدهای قبلی در جهت پیش بینی پیامدهای آتی شکست می‌خورند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>همچنین این تیپ‌ها بسیاری از جزئیات پیش پا افتاده زندگی روزمره را نادیده می‌گیرند، به ویژه اگر کاملاً غرق یک پروژه یا برنامه شوند</li>
                                <li><i class="fas fa-caret-left ms-2"></i></li>
                                </ul>
                            @elseif($scoreArray['mbti'] == 'istp')
                                <h4 class="mt-5">کارکرد غالب: متفکر درونگرا</h4>
                                <ul>
                                <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی ISTP وقت زیادی را صرف فکر کردن و بررسی اطلاعات درون ذهنشان می‌کنند یعنی برای ابراز وجود کلامی چندان وقت نمی‌گذارند؛ در نتیجه به عنوان افرادی آرام شناخته می‌شوند</li>
                                <li><i class="fas fa-caret-left ms-2"></i>شاید رویکرد تصمیم گیری ISTP ها خیلی تصادفی به نظر برسد؛ ولی اقداماتشان مبتنی بر مشاهده و تفکر دقیق است.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به طور منطقی عمل می‌کنند؛ پس غالباً روی کارهای عملی و مفید متمرکز می‌شوند.</li>
                                <li><i class="fas fa-caret-left ms-2"></i>آن‌ها به خوبی شرایط را به طور عینی بررسی می‌کنند و از عوامل ذهنی یا هیجانی در حین تصیمیم گیری‌ها اجتناب می‌کنند. افراد دارای این تیپ شخصیتی را به سختی می‌توان شناخت، چون بیشتر از عواطف روی اقدام و نتایجش متمرکز می‌شوند</li>
                            </ul>
                            <h4 class="mt-5">کارکرد کمکی: حسی برونگرا</h4>
                            <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های شخصیتی ISTP روی زمان حال متمرکز هستند و هر بار فقط یک مسأله را بررسی می‌کنند. آن‌ها علاقه‌ای به تعهد بلندمدت ندارند و بیشتر از برنامه‌های آتی روی زمان حال متمرکز می‌شوند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>آن‌ها بسیار منطقی هستند و از یادگیری و شناخت عملکرد چیزهای دور و برشان لذت می‌برند. شاید اجزای یک وسیله مکانیکی را از هم جدا کنند تا به نحوه عملکردش پی ببرند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>با اینکه به خوبی اطلاعات انتزاعی و نظری را درک می‌کنند ولی تا زمانیکه متوجه کاربرد عملی آنها نشوند؛ علاقه‌ای به این اطلاعات نشان نمی‌دهند.</li>
                                </ul>
                                <h4 class="mt-5">کارکرد سوم: شهودی درونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>این کارکرد در شخصیت ISTP تا حد زیادی ناهشیار است. با اینکه این شخصیت علاقه چندانی به ایده‌های انتزاعی ندارد؛ ولی از آنها برای تبدیلشان به اقدامات و راه حل‌های عملی استفاده می‌کند.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>این کارکرد همان حس درونی است که ISTP ها گاهی اوقات در حین تصمیم گیری آن را حس می‌کنند. این جنبه از شخصیت می‌تواند اطلاعات حاصل از کارکردهای غالب و کمکی را با هم ترکیب کند و به بصیرت ناگهانی یا همان لحظات «آهان، فهمیدم» برسد.</li>
                                </ul>
                                <h4 class="mt-5">کارکرد کم رنگ تر: احساسی برونگرا</h4>
                                <ul>
                                    <li><i class="fas fa-caret-left ms-2"></i>این جنبه از شخصیت در پس شخصیت ISTP عمل می‌کند ولی در دوران بروز تنش، آشکارتر می‌شود.</li>
                                    <li><i class="fas fa-caret-left ms-2"></i>تیپ‌های ISTP در شرایط بسیار اضطراری می‌توانند هیجانات آنی را پشت سر بگذارند. آن‌ها در اغلب اوقات، احساساتشان را نادیده می‌گیرند تا اینک به نقطه جوش می‌رسند و در آنجا هیجاناتشان را به روش‌های نامناسب، ابراز می‌کنند.</li>
                                </ul>
                        @endif
                    </div>
                </div>
                <div class="boxResult row mx-0 justify-content-center">
                    <div class="col-12 mt-4">
                        <div class="row title">
                            <div class="col-1"><i class="far fa-laugh c-first-200" style="font-size: 70px"></i></div>
                            <div class="col-9"><h4>تیپ‌های {{ strtoupper($scoreArray['mbti']) }} معروفی که احتمالاً می‌شناسید</h4></div>
                            <div class="col-2 mbtiTitle text-center">{{ strtoupper($scoreArray['mbti']) }}</div>
                        </div>
                        <div class="row mx-0 mt-4">
                        @if($scoreArray['mbti'] == 'intj')
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/intj1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">توماس جفرسون، رئیس جمهور امریکا</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/intj2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">سی. اس، لوسین، نویسنده</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/intj3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">آرنولد شوارزینگر، بازیگر و پرورش اندام</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/intj4.png') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">لنس آرمسترانگ، دوچرخه سوار</span></div>
                        @elseif($scoreArray['mbti'] == 'estp')
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/estp1.png') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">دونالد ترامپ، رئیس جمهور امریکا</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/estp2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">مدونا، خواننده</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/estp3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">ارنست همینگوی، نویسنده</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/estp4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">توماس ادیسون، مخترع</span></div>
                        @elseif($scoreArray['mbti'] == 'isfj')
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/isfj1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">لوئیزا می آلکوت ، نویسنده</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/isfj2.png') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">دیوید پترائوس ، ژنرال ۴ ستاره ارتش امریکا</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/isfj3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">مادر ترزا ، راهبه و برنده نوبل صلح</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/isfj4.png') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">کریستا یاماگوچی، اسکیت باز المپیکی</span></div>
                        @elseif($scoreArray['mbti'] == 'entj')
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/entj1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">فرانکلین روزولت، رئیس جمهور امریکا</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/entj2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">بیل گیتس، مؤسس مایکروسافت</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/entj3.png') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">وینس لومباردی، مربی نامدار فوتبال</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/entj4.png') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">کارل ساگان، دانشمند و فضانورد</span></div>
                        @elseif($scoreArray['mbti'] == 'isfp')
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/isfp1.webp') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">آگوست رادین، مجسمه ساز</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/isfp2.webp') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3"> دیوید بکهام، بازیکن فوتبال</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/isfp3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">نیل سیمون، نمایشنامه نویس</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/isfp4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">هث لجر: بازیگر آمریکایی</span></div>
                        @elseif($scoreArray['mbti'] == 'istj')
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/istj1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">جورج واشنگتون، رئیس جمهور ایالات متحده</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/istj2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3"> هنری فورد، مخترع</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/istj3.webp') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">الیزابت دوم، ملکه انگلستان</span></div>
                            <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/istj4.webp') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">اواندر هالیفیلد، بوکسور</span></div>

                        @elseif($scoreArray['mbti'] == 'infp')
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/infp1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">جی آر آر تولکین، نویسنده</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/infp2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">پرنسس دایانا، از اعضای خانواده سلطنتی انگلستان</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/infp3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">ویلیام شکسیپر، نمایشنامه نویس</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/infp4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">آدری هپبورن، بازیگر</span></div>

                        @elseif($scoreArray['mbti'] == 'intp')
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/intp1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">آلبرت انیشتین، دانشمند</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/intp2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">دوایت دی آیزنهاور، رئیس جمهور ایالات متحده</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/intp3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">ادوارد اسنودن (کارمند سابق سازمان اطلاعات مرکزی آمریکا)</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/intp4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">شلدون کوپر، نویسنده کتاب نظریه Big Bang</span></div>
                        @elseif($scoreArray['mbti'] == 'infj')
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/infj1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">آل پاچینو (بازیگر آمریکایی)</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/infj2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">آدولف هیتلر (دیکتاتور نازی)</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/infj3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">تیلور سویفت: خواننده</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/infj4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">کارل یونگ: روانشناس</span></div>
                        @elseif($scoreArray['mbti'] == 'estj')
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/estj1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">لیندون بی جانسون، رئیس جمهور ایالات متحده</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/estj2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">بیلی گراهام، کشیش</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/estj3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">الک بالدوین، بازیگر</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/estj4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">کارل یونگ: روانشناس</span></div>
                        @elseif($scoreArray['mbti'] == 'esfp')
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/esfp1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">بیل کلینتون، رئیس جمهور ایالات متحده</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/esfp2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">پابلو پیکاسو، هنرمند</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/esfp3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">مارک کوبان، کارآفرین</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/esfp4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">ویل اسمیت، بازیگر</span></div>
                        @elseif($scoreArray['mbti'] == 'esfj')
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/esfj1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">هیو جکمن ، بازیگر</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/esfj2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">سم والتون، مؤسس والمارت</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/esfj3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">ویلیام مک کینلی، رئیس جمهور ایالات متحده</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/esfj4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">باربارا والترز، خبرنگار تلویزیونی</span></div>
                        @elseif($scoreArray['mbti'] == 'enfp')
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/enfp1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">اندی کافمن، کمدین</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/enfp2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">دکتر سئوس، نویسنده کتاب کودک</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/enfp3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">سالوادور دالی، هنرمند</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/enfp4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">الن دجنرس، کمدین و مجری</span></div>
                        @elseif($scoreArray['mbti'] == 'enfj')
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/enfj1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">آبراهام مازلو، روانشناس</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/enfj2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">پیتون مانینگ، بازیکن فوتبال</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/enfj3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">باراک اوباما، رئیس جمهور ایالات متحده</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/enfj4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">بونو، موسیقی دان</span></div>
                        @elseif($scoreArray['mbti'] == 'entp')
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/entp1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">توماس ادیسون، مخترع</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/entp2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">جان آدامز، رئیس جمهور ایالات متحده</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/entp3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">والت دیزنی، فیلم ساز</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/entp4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">تام هنکس ، بازیگر</span></div>
                        @elseif($scoreArray['mbti'] == 'istp')
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/istp1.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">کلینت ایست وود، بازیگر</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/istp2.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">زاخاری تیلور، رئیس جمهور ایالات متحده</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/istp3.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">آلان شفرد، فضانورد</span></div>
                        <div class="col-12 col-lg-3 imgdiv position-relative"><img src="{{ asset('assets-front/img/tests/istp4.jpg') }}" alt=""><div class="grad"></div><span class="w-100 text-center px-3">امیلیا ایرهارت، هوانورد</span></div>
                        @endif
                        </div>
                    </div>
                </div>
                <div class="boxResult row mx-0 justify-content-center">
                    <div class="col-12 mt-4">
                        <div class="row title">
                            <div class="col-1"><i class="fas fa-user-friends c-first-200" style="font-size: 70px"></i></div>
                            <div class="col-9"><h4>روابط فردی</h4></div>
                            <div class="col-2 mbtiTitle text-center">{{ strtoupper($scoreArray['mbti']) }}</div>
                        </div>
                        @if($scoreArray['mbti'] == 'intj')
                        <p class="mt-5">افراد دارای این تیپ، درونگرا هستند و زمان زیادی را در دنیای ذهنی خودشان سر می‌کنند. آن‌ها به طور انفرای بهتر از حالت گروهی کار می‌کنند و به فعالیت انفرادی علاقه دارند. با اینکه علاقه‌ای به افکار و احساسات دیگران ندارند ولی به هیجانهای نزدیکانشان اهمیت می‌دهند. آن‌ها برای موفقیت در روابط فردی، وقت و انرژی صرف می‌کنند.
                            آن‌ها از نظر سایر افراد به صورت افرادی خونسرد، منزوی و بی طرف توصیف می‌شوند که این صفات می‌تواند دوستی‌های جدید را به چالش بکشد. این افراد اهمیتی به رسومات اجتماعی نمی‌دهند؛ کم حرف می‌زنند و شناختشان دشوار است. آن‌ها به انزوا علاقه دارند و تنها تعامل با گروه کوچکی از دوستان و خانواده را ترجیح می‌دهند.
                        </p>
                        @elseif($scoreArray['mbti'] == 'estp')
                        <p class="mt-5">تیپ‌های شخصیتی ESTP به عنوان افرادی برونگرا از آدم‌های اطرافشان انرژی می‌گیرند. این تیپ در موقعیت‌های اجتماعی به عنوان افرادی بامزه، دوستانه و مجلس گرم کن شناخته می‌شود.</p>
                        <ul>
                            <li><i class="fas fa-caret-left ms-2"></i>مهارت‌های تعاملی قدرتمند: به گفته کیرسی افراد دارای این تیپ شخصیتی به خوبی دیگران را تحت تأثیر قرار می‌دهند. آن‌ها در تعامل با دیگران خبره هستند و توانایی طبیعی برای درک و برقراری تعاملات غیرکلامی دارند.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>مشکلات تعهدی: با اینکه با دیگران خیلی خوب رفتار می‌کنند ولی زندگی در لحظه را دوست دارند که همین امر تعهد نسبت به رابطه را برایشان دشوار می‌کند. چون خیلی روی زمان حال متمرکز هستند فکر کردن به برنامه‌های بلندمدت برایشان دشوار است.</li>
                            <li><i class="fas fa-caret-left ms-2"></i>بی احساس به نظر می‌رسند: گاهی اوقات ESTP ها در کنار آمدن با افکار و احساسات دیگران مشکل دارند. گاهی اوقات چیزهایی می‌گویند که آنها را افرادی بی عاطفه نشان می‌دهد پس باید بیشتر به دوستان و همکارانشان توجه کنند.</li>
                        </ul>
                        @elseif($scoreArray['mbti'] == 'isfj')
                            <p class="mt-5">چون این تیپ شخصیتی، آرام است؛ برخی این رفتار را با گوشه گیری اشتباه می‌گیرند. آن‌ها نسبت به دیگران دلسوز هستند و بدون هرگونه چشم داشتی در جهت امنیت و بهزیستی دیگران، تلاش می‌کنند.
                                تیپ‌های ISFJ در اغلب مواقع به صورت مهربان، راز دار و قابل اعتماد توصیف می‌شوند.
                                آن‌ها افرادی سختکوش و مستقل هستند که کمتر بابت موفقیت‌هایشان به دنبال تقدیر و تشکر می‌روند. آن‌ها گاهی اوقت به عنوان افراد امین در میان اطرافیانشان شناخته می‌شوند. در برخی از موارد هم، اطرافیان از اعتماد آنها سوء استفاده می‌کنند.
                                تیپ‌های ISFJ دارای گروه کوچکی از دوستان نزدیک هستند. با اینکه در کنار افرادیکه به خوبی نمی‌شناسند، آرام و محافظه کار هستند؛ ولی تنها با دوستان مورد اعتمادشان درد و دل می‌کنند. آنها ارزش زیادی برای این دسته از دوستانشان قائل هستند و همواره مراقب و حامی آنها هستند.
                            </p>
                        @elseif($scoreArray['mbti'] == 'entj')
                            <p class="mt-5">از آنجا که تیپ‌های ENTJ، برونگرا هستند، از معاشرت اجتماعی، انرژی می‌گیرند (برخلاف درونگراها که در طول معاشرت اجتماعی، انرژی از دست می‌دهند). آن‌ها عاشق گفتگو و بحث‌های پرشور هستند. در برخی موارد، سایر افراد، محصور اعتماد به نفس و مهارتهای کلامی قوی در بین ENTJ ها می‌شوند. آن‌ها در هنگامیکه به ایده خوبی می‌رسند؛ حس می‌کنند که باید دیدگاهشان را با دیگران در میان بگذارند.
                                آن‌ها با وجود توانایی‌های کلامی؛ همیشه قادر به درک هیجانهای دیگران، نیستند. ابراز هیجان برایشان در اغلب موارد دشوار است و گرایش آنها برای بحث کردن، آنها را افرادی پرخاشگر و علاقمند به بحث و جدل نشان می‌دهد. ما با تفکر هشیارانه نسبت به نحوه احساسات دیگران می‌توانیم بر این مشکل غلبه کنیم.
                                شاید آنها برای درک کردن یا همراهی با تیپ‌های شخصیتی بسیار حساس با مشکل مواجه شوند. با اینکه این تیپ‌های شخصیتی، برونگرا هستند ولی اهل ابراز هیجانات نیستند و به همین دلیل هم شاید دیگران آنها را افرادی بی احساس بدانند.
                            </p>
                        @elseif($scoreArray['mbti'] == 'isfp')
                        <p class="mt-5">آن‌ها افرادی درونگرا هستند. آن‌ها آرام و محافظه کار هستند. این حالتها در جمع افرادیکه خیلی خوب آنها را نمی‌شناسند؛ بیشتر است. آن‌ها به وقت گذرانی با گروه کوچکی از دوستان و اعضای خانواده، علاقه دارند</p>
                        <p class="mt-5">تیپ‌های شخصیتی ISFP بسیار تودار هستند و احساسات واقعی خودشان را بروز نمی‌دهند. آن‌ها در برخی موارد از ابراز افکار، احساسات و عقایدشان در برابر سایر افراد زندگی از جمله همسرانشان هم اجتناب می‌کنند. چون نمی‌خواهند درونی‌ترین احساساتشان را با کسی در میان بگذارند و از اختلاف اجتناب می‌کنند؛ به همین دلیل در برابر نیازها و خواسته‌های دیگران تسلیم می‌شوند.</p>
                        <p class="mt-5">تیپ‌های ISFP، به ارزش‌های قدرتمندی پایبند هستند ولی با بیان دیدگاهشان به دنبال متقاعد کردن دیگران نیستند. آن‌ها به دیگران به ویژه دوستان نزدیک و اعضای خانواده بسیار اهمیت می‌دهند. آن‌ها عملگرا هستند و می‌خواهند نگرانی و ملاحظه گری را به جای ابراز کلامی احساسات به صورت عملی نشان دهند.</p>

                        @elseif($scoreArray['mbti'] == 'istj')
                            <p class="mt-5">تیپ‌های ISTJ وقت گذرانی به تنهایی یا با گروههای کوچکی از دوستان نزدیکشان را ترجیح می‌دهند. افراد دارای این تیپ شخصیتی بسیار وفادار هستند و خودشان را وقف خانواده و دوستان می‌کنند؛ ولی در شناخت هیجانها و احساسات خودشان و دیگران با مشکل مواجه می‌شوند. آن‌ها کاملاً محافظه کار هستند و گاهی اوقات متوجه نشانه‌های عاطفی ارسالی از جانب سایرین نمی‌شوند. با این حال، هنگامیکه متوجه نیازها و احساسات نزدیکانشان می‌شوند، حداکثر تلاششان را در جهت تأمین این نیازها می‌کنند</p>

                        @elseif($scoreArray['mbti'] == 'infp')
                            <p class="mt-5">تیپ‌های  INFP بسیار ایده آل گرا هستند؛ پس انتظارات بالایی به ویژه در روابط زناشویی دارند. احتمالاً تصویر ایده آلی در ذهنشان از شریک زندگی ایده آلشان دارند که پر کردن جای آن بسیار دشوار است.</p>
                            <p class="mt-5">افراد دارای این تیپ شخصیتی، عمیقاً به دیگران اهمیت می‌دهند؛ با اینکه درک این شرایط برای افراد درونگرا بسیار دشوار است. آن‌ها می‌خواهند به افراد معدودی نزدیک شده؛ نسبت به آنها متعهد شوند و روابط صمیمانه‌ای را با آنها تشکیل دهند</p>
                            <p class="mt-5">آن‌ها اختلاف نظر را دوست ندارند و از آن اجتناب می‌کنند. هنگامیکه بحث و جدلی در می‌گیرد، آن‌ها به جای متمرکز شدن روی جزئیات بحث، بیشتری روی احساسی که این بحث در آنها به وجود آورده؛ متمرکز می‌شوند. آنها در طول بحث، بیش از حد هیجانی شده و حتی غیرمنطقی به نظر می‌رسند. با این حال آنها با کمک به افراد درگیر اختلاف به خوبی به عنوان میانجی عمل کرده و به دیگران در جهت بیان احساساتشان کمک می‌کنند</p>
                            <p class="mt-5">از آنجا که این افراد، بسیار محافظه کار هستند، شناختشان بسیار دشوار است. آنها دوست دارند که خودشان را وقف دوستان نزدیک و خانواده خودشان کنند و اهمیت زیادی برای احساسات و عواطف عزیزانشان قائل هستند. غالب انرژی آنها در درونشان متمرکز است و مشخصه آنها هم داشتن احساسات شدید و ارزش‌های قدرتمند است. آن‌ها به معشوق خود بسیار وفادار بوده و باورها و ارزش‌هایشان را می‌پرستند</p>

                        @elseif($scoreArray['mbti'] == 'intp')
                        <p class="mt-5">تیپ‌های INTP به عنوان افرادی درونگرا، اغلب اوقات در خلوت خودشان به سر می‌برند. افراد برونگرا از بودن در جمع و تعامل با گروه بزرگی از افراد انرژی می‌گیرند؛ ولی افراد درونگرا در طول معاشرت اجتماعی، انرژی از دست می‌دهند. تیپ INTP پس از آنکه در کنار تعداد زیادی از افراد قرار می‌گیرد؛ باید خلوت کند تا بتواند به تعادل رسیده و تجدید قوا کند. با اینکه در کنار افراد ناشناس، خجالت زده می‌شوند ولی در کنار گروه دوستان نزدیک و اعضای خانواده کاملاً گرم و صمیمی رفتار می‌کنند.</p>
                        <p class="mt-5">آن‌ها از تنهایی و تفکر لذت می‌برند به همین دلیل دیگران گاهی اوقات آنها را افرادی منزوی در نظر می‌گیرند. آن‌ها همواره در افکارشان غرق می‌شوند و دنیای بیرون را فراموش می‌کنند. عاشق ایده پردازی هستند و برای هوش و دانش، اهمیت زیادی قائل‌اند</p>
                        <p class="mt-5">تیپ‌های INTP در موقعیت‌های اجتماعی کاملاً انعطاف پذیر و صبور هستند. با این وجود اگر عقایدشان به چالش کشیده شود کاملاً مقاومت می‌کنند. با این حال اگر دیگران بحث‌های غیرمنطقی را مطرح کنند، این تیپ به دنبال اصلاح استدلال آنها می‌رود. چون بیشتر از افکار دیگران به ذهن خودشان اعتماد دارند؛ پس متقاعد کردنشان بسیار دشوار است</p>
                        @elseif($scoreArray['mbti'] == 'infj')
                        <p class="mt-5">تیپ‌های شخصیتی INFJ توانایی زبانی بسیار خوبی دارند و به خوبی به ابراز وجود می‌پردازند. آن‌ها زندگی درونی روشنی دارند ولی غالباً در مورد درد و دل با دیگران تردید دارند، ولی با دوستان نزدیکشان بسیار راحت هستند. با اینکه آرام و حساس هستند ولی رهبران خوبی محسوب می‌شوند. با اینکه رهبری آشکار را بر عهده نمی‌گیرند ولی غالباً در پشت صحنه به عنوان افرادی اثرگذار عمل می‌کنند</p>
                        <p class="mt-5">تیپ‌های شخصیتی INFJ تحت حمایت ارزش‌های قدرتمندشان قرار دارند و به دنبال معنا دادن به تمامی حوزه‌های زندگی از جمله روابط و کارشان هستند. افراد دارای این تیپ شخصیتی به عنوان افرادی عمیق و پیچیده محسوب می‌شوند. آن‌ها محفل‌های آشنایی گسترده‌ای ندارند ولی با دوستان نزدیکشان دارای روابط صمیمانه و بلندمدت هستند</p>
                        <p class="mt-5">تیپ INFJ کمک به دیگران را دوست دارد و می‌خواهد دنیا را به جای بهتری برای زندگی تبدیل کند. آن‌ها به خوبی به حرفهای دیگران گوش می‌کنند و با افراد صمیمی و نزدیکانشان به خوبی تعامل برقرار می‌کنند. با اینکه به دیگران خیلی اهمیت می‌دهند ولی افرادی درونگرا هستند که می‌خواهند با افراد معدود و منتخب درد و دل کنند. آن‌ها بعد از تعامل اجتماعی به خلوت کردن نیاز دارند تا دوباره تجدید قوا کنند.</p>
                        @elseif($scoreArray['mbti'] == 'estj')
                        <p class="mt-5">تیپ‌های ESTJ به عنوان افرادی برونگرا، رفتار بسیار دوستانه‌ای دارند و از وقت گذرانی در جمع لذت می‌برند. آن‌ها در موقعیت‌های اجتماعی بسیار سرزنده و بامزه هستند و در اغلب مواقع از مرکز توجه بودن، لذت می‌برند</p>
                        <p class="mt-5">خانواده اهمیت زیادی برای ESTJ ها دارد. آن‌ها برای انجام تعهدات خانوادگی تلاش می‌کنند. رویدادهای اجتماعی هم برایشان مهم است و رویدادهای مهمی مثل تولدها و سالگردها را به خاطر می‌سپارند. آن‌ها بی صبرانه منتظر شرکت در مراسم عروسی، جمع‌های خانوادگی، جشن‌ها، اجتماعات کلاسی و سایر مناسبت‌ها هستند.</p>
                        <p class="mt-5">یکی از نقاط ضعف احتمالی ESTJ ها سختگیری در صورتی است که پای قوانین و روندها به میان می‌آید. آن‌ها عقایدشان را بسیار جدی می‌گیرند و تمایلی به شنیدن صحبت‌های دیگران در مورد یک موضوع ندارند.</p>
                        @elseif($scoreArray['mbti'] == 'esfp')
                        <p class="mt-5">تیپ‌های ESFP، برونگراهایی هستند که از وقت گذرانی با دیگران لذت می‌برند و مهارتهای بین فردی عالی دارند. آن‌ها به خوبی احساسات دیگران را درک می‌کنند و به طور  کارآمد به عواطف آنها پاسخ می‌دهند. به همین دلیل، رهبران خوبی هستند و توانایی بسیج کردن، انگیزه دادن و متقاعد کردن اعضای گروه را دارند.</p>
                        <p class="mt-5">این تیپ شخصیتی غالباً به صورت خونگرم، مهربان و با ملاحظه توصیف می‌شود که آنها را به افرادی محبوب تبدیل می‌کند. آن‌ها از ملاقات با افراد جدید، لذت می‌برند و تشنه تجارب جدید هستند. آن‌ها به طور کلی روی زمان حال متمرکز هستند. ولی غالباً اولین فردی هستند که وسایل جدید شهربازی و ماجراجویی‌های ورزشی جدید را امتحان می‌کنند</p>
                        @elseif($scoreArray['mbti'] == 'esfj')
                        <p class="mt-5">تیپ‌های ESFJ به عنوان افرادی برونگرا از وقت گذرانی با دیگران، لذت می‌برند. آن‌ها از تعاملا اجتماعی انرژی می‌گیرند و به بهزیستی دیگران علاقمند هستند. آن‌ها به عنوان افرادی خوش قلب و همدل توصیف می‌شوند که نیازهای دیگران را به نیاز خودشان ترجیح می‌دهند</p>
                        <p class="mt-5">آن‌ها در موقعیت‌های نامطمئن یا آشفته احساس ناامنی دارند. این گرایش آنها را مناسب سمت‌های سرپرستی و مدیریتی کرده است. البته هنگامیکه به دنبال کنترل افرادی هستند که علاقه‌ای به این گرایش ندارند، احتمال بروز اختلافات فردی وجود دارد</p>
                        <p class="mt-5">از آنجا که ESFJ ها افرادی مستقل و وفادار هستند به دنبال برقراری روابط دوستانه قوی و بلندمدت می‌روند.</p>
                        @elseif($scoreArray['mbti'] == 'enfp')
                        <p class="mt-5">تیپ‌های ENFP افرادی برونگرایی هستند؛ یعنی عاشق وقت گذراندن با دیگران هستند. معاشرت انرژی بیشتر به آنها داده و حس سرزندگی و شوق زندگی را به آن‌ها می‌بخشد. با اینکه سایر تیپ‌های برونگرا علاقه‌ای به تنهایی ندارند ولی ENFP ها به کمی تنهایی برای تفکر و تأمل نیاز دارند.</p>
                        <p class="mt-5">آن‌ها در طول روابط، خونگرم و صبور هستند. به عنوان افرادی برونگرا به طور طبیعی خوش مشرب و خوش ذوق هستند. همواره در طول روابط به دنبال رشد و قوی‌تر شدن رابطه هستند. آن‌ها افرادی خودجوش و توجه طلب هستند. تمایل به خطرپذیری آنها، گاهی اوقات برای عزیزانشان تنش زا می‌شود</p>
                        @elseif($scoreArray['mbti'] == 'enfj')
                        <p class="mt-5">تیپ‌های ENFJ به دیگران بسیار اهمیت می‌دهند و افرادی خونگرم و حمایتگر در روابط شخصی هستند. آن‌ها اغلب اوقات درگیر مشکلات دیگران می‌شوند.</p>
                        <p class="mt-5">آن‌ها افرادی نوعدوست هستند که به کمک کردن علاقه دارند. این کار گاهی اوقات بسیار طاقت فرسا می‌شود</p>
                        <p class="mt-5">والدین دارای تیپ ENFJ افرادی مراقب و خونگرم هستند ولی گاهی اوقات آنها را والدین هلی‌کوپتری می‌نامند. آن‌ها به طور مستقیم در زندگی فرزندانشان نقش دارند ولی گاهی اوقات به افرادی خشک و سختگیر تبدیل می‌شوند.</p>
                        <p class="mt-5">آن‌ها باید امکان اکتشاف خود و ابراز وجود را به کودکانشان بدهند. این کار با رسیدن فرزندان به دوره نوجوانی اهمیت زیادی دارد.</p>
                        <p class="mt-5">آن‌ها شخصیت معاشرتی دارند و از بودن در کنار دیگران لذت می‌برند. آن‌ها با قرارگیری در موقعیت‌های اجتماعی، انرژی می‌گیرند.</p>
                        <p class="mt-5">شخصیت پیشرو در روابط دوستانه و سایر روابط، حمایتگر و شوخ طبع است. آن‌ها در برقراری ارتباط با دیگران عالی عمل می‌کنند و می توانند افراد دور و برشان را به بهترین نسخه از آن فرد تبدیل کنند.</p>
                        @elseif($scoreArray['mbti'] == 'entp')
                        <p class="mt-5">چون این تیپ شخصیتی به عنوان افرادی برونگرا شناخته می‌شوند؛ پس مهارتهای بین فردی بسیار خوبی دارند. آن‌ها از تعامل با جمع وسیعی از اعضای خانواده، دوستان و آشنایان لذت می‌برند و در این کار مهارت خوبی دارند. آن‌ها در بحث کردن هم از نظر دیگران افرادی حاضر جواب هستند</p>
                        <p class="mt-5">تیپ‌های  ENTP به سادگی وارد بحث می‌شوند؛ چون از زورآزمایی در این زمینه لذت می‌برند. آن‌ها گاهی اوقات به خاطر علاقمندی به بحث کردن به خوبی عقاید و دیدگاه مخالف را بر می‌گزینند که گاهی اوقات باعث بروز اختلاف با دیگران می‌شود و این شبهه را ایجاد می‌کند که آنها عمداً به دنبال درگیری و مخالفت هستند.</p>
                        @elseif($scoreArray['mbti'] == 'istp')
                        <p class="mt-5">تیپ‌های ISTP افرادی درونگرا، آرام و محافظه کار هستند. آن‌ها تجارب جدید را دوست دارند و علاقه‌ای به کارهای تکراری ندارند. آن‌ها در طول روابط مستقل هستند و کنترل شدن را دوست ندارند. متعهد شدن برایشان دشوار است ولی برای روابط مورد علاقه خودشان بسیار تلاش خواهند کرد.</p>
                        <p class="mt-5">آن‌ها در اغلب موارد، احساساتشان را با دیگران در میان نمی‌گذارند. با اینکه از شنیدن طرز تفکر دیگران لذت می‌برند ولی عقاید خودشان را ابراز نمی‌کنند. به همین دلیل دیگران، شناخت آنها را دشوار می‌دانند. آن‌ها غالباً دوستانی با علایق مشابه پیدا می‌کنند و با این دوستان از فعالیت‌های مورد علاقه خودشان لذت می‌برند.</p>
                        @endif
                    </div>
                </div>
                <div class="boxResult row mx-0 justify-content-center">
                    <div class="col-12 mt-4">
                        <div class="row title">
                            <div class="col-1"><i class="fas fa-tools c-first-200" style="font-size: 70px"></i></div>
                            <div class="col-9"><h4>آینده شغلی</h4></div>
                            <div class="col-2 mbtiTitle text-center">{{ strtoupper($scoreArray['mbti']) }}</div>
                        </div>
                        @if($scoreArray['mbti'] == 'intj')
                            <p class="mt-5">هنگامیکه INTJ  ها به چیزی علاقمند می‌شوند برای کسب دانش و مهارت در آن حوزه بسیار تلاش می‌کنند. آن‌ها انتظارات زیادی دارند و به حداکثر استانداردهای ممکن پایبند هستند.
                                آن‌ها به خوبی اطلاعات را از دنیای اطرافشان جمع آوری می‌کنند و به تحلیلشان می‌پردازند تا به نگرش‌های جدیدی برسند. افراد دارای این تیپ بسیار تحلیلی و منطقی عمل می‌کنند. آن‌ها برای اطلاعات، دانش و هوشمندی ارزش قائل هستند و می‌توانند به بهترین دانشمندان و ریاضیدان‌ها تبدیل شوند. آن‌ها در رشته‌های نیازمند کارآیی به خوبی عمل می‌کنند و می‌توانند اطلاعات پیچیده مهندسی، علمی، حقوقی و پژوهشی را تفسیر کنند.
                                 تیپ‌های INTJ در حرفه‌هایی که امکان تلفیق توانایی درک و ارزیابی اطلاعات پیچیده با کاربرد عملی آنها وجود دارد؛ موفق هستند. حرفه‌هایی که امکان فعالیت مستقل و آزادانه را برای این تیپ فراهم می‌کنند هم ایده آل هستند. مشاغل محبوب این تیپ شخصیتی عبارتند از:
                            </p>
                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">دانشمند</span>
                                <span class="badge bg-info p-4 mt-1">ریاضیدان</span>
                                <span class="badge bg-info p-4 mt-1">مهندس</span>
                                <span class="badge bg-info p-4 mt-1">دندانپزشک</span>
                                <span class="badge bg-info p-4 mt-1">پزشک</span>
                                <span class="badge bg-info p-4 mt-1">معلم</span>
                                <span class="badge bg-info p-4 mt-1">قاضی</span>
                                <span class="badge bg-info p-4 mt-1">وکیل</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'estp')
                            <p class="mt-5">طبق پرسشنامه MBTI، هر تیپ شخصیتی دارای اولویت‌ها و نقاط قوت خاص خودش است که با حرفه یا شغل خاصی هماهنگ است. تیپ شخصیتی ESTP از تعامل با دیگران انرژی می‌گیرد، پس در مشاغل نیازمند تعامل با دیگران بهتر عمل می‌کنند. آن‌ها علاقه‌ای به کارهای تکراری و یکنواخت ندارند؛ پس کارهای متغیر و سریع برایشان مناسب است.
                                آن‌ها دارای ویژگیهای شخصیتی مختلفی هستند که آنها را مناسب مشاغل خاصی می‌کند. آنها به خاطر داشتن مهارتهای تعاملی قدرتمند در مشاغل مرتبط با فروش و بازاریابی موفق هستند.
                                از آنجا که افرادی عملگرا و مدبر هستند؛ در سمت‌های پاسخگویی که به تفکر و واکنش سریع نیاز دارد مثل پرسنل اورژانس پزشکی و افسران پلیس، موفق‌تر هستند. مشاغل محبوب این تیپ شخصیتی عبارتند از:
                            </p>
                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">تکنسین پشتیبانی کامپیوتر</span>
                                <span class="badge bg-info p-4 mt-1">بازرس</span>
                                <span class="badge bg-info p-4 mt-1">کارآفرین</span>
                                <span class="badge bg-info p-4 mt-1">پیراپزشک</span>
                                <span class="badge bg-info p-4 mt-1">افسر پلیس</span>
                                <span class="badge bg-info p-4 mt-1">نمایندگی فروش</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'isfj')
                            <p class="mt-5">ویژگیهای شخصیتی ISFJ ها آن‌ها را مناسب مشاغل خاصی نموده است. چون خیلی به احساسات دیگران اهمیت می‌دهند؛ مشاغل حوزه سلامت روان یا صنعت بهداشت به خوبی برایشان مناسب است.
                                آن‌ها بسیار دقیق و منظم هستند که همین امر آنها را به گزینه مناسبی برای مشاغل نیازمند برنامه ریزی، سازماندهی و توجه به جزئیات تبدیل نموده است. تعهد کاری، قابلیت اطمینان و توانایی کار مستقل، آنها را به کارجویانی جذاب برای طیف وسیعی از کارفرماها تبدیل کرده است.
                                از آنجا که مهارتها و تمایلات خوبی در جهت ایجاد نظم دارند؛ در اغلب اوقات برای نقش‌های مدیریتی و اجرایی، عالی هستند. انها در ارائه نقشه‌ها و کمک به همکاری سایرین برای رسیدن به هدفی مشترک، فوق العاده عمل می‌کنند. مشاغل محبوب این تیپ شخصیتی عبارتند از:
                            </p>
                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">حسابداری</span>
                                <span class="badge bg-info p-4 mt-1">مدیریت</span>
                                <span class="badge bg-info p-4 mt-1">بانکداری</span>
                                <span class="badge bg-info p-4 mt-1">کتابداری</span>
                                <span class="badge bg-info p-4 mt-1">پرستاری کودک</span>
                                <span class="badge bg-info p-4 mt-1">مشاوره</span>
                                <span class="badge bg-info p-4 mt-1">پرستاری</span>
                                <span class="badge bg-info p-4 mt-1">مدیر دفتری</span>
                                <span class="badge bg-info p-4 mt-1">دستیار حقوقی</span>
                                <span class="badge bg-info p-4 mt-1">مددکار اجتماعی</span>
                                <span class="badge bg-info p-4 mt-1">معلم</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'entj')
                            <p class="mt-5">تیپ‌های ENTJ به لطف قرارگیری در کانون توجه، توانایی برقراری ارتباط و تمایل برای اتخاذ تصمیم‌های فوری به طور طبیعی تمایل به پذیرش نقش‌های رهبری دارند.
                                گاهی اوقات این افراد بدون اینکه بفهمند، ناگهان خودشان را در مقام کنترل گروهی از افراد می‌بینند. آن‌ها عاشق سازماندهی و نظم هستند و در قبول سرپرستی و هدایت سایرین فوق العاده عمل میکنند. آن‌ها به گروهها در جهت انجام وظایف و دستیابی به اهداف به خوبی کمک می‌کنند. آن‌ها به سرعت می‌توانند نیازها را شناسایی کرده، طرح و برنامه اقدامات را مشخص نموده و وظایف اعضای گروه را به آنها محول ‌کنند.
                                تیپ‌های ENTJ در مشاغل بسیار سازمان یافته به همراه بخش‌های بسیار متنوع، موفق هستند. مشاغلی که امکان ملاقات و تعامل با تعداد افراد زیادی را فراهم می‌کند؛ برایشان ایده آل است. افراد دارای این تیپ شخصیتی، مهارت‌های زیادی از جمله مهارتهای عالی رهبری و روابط بین فردی را دارند؛ به سختکوشی معتقدند و برای آینده به خوبی برنامه ریزی می‌کنند.</p>
                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">مدیر منابع انسانی</span>
                                <span class="badge bg-info p-4 mt-1">مدیر عامل یا مدیر شرکت</span>
                                <span class="badge bg-info p-4 mt-1">وکیل</span>
                                <span class="badge bg-info p-4 mt-1">دانشمند</span>
                                <span class="badge bg-info p-4 mt-1">توسعه دهنده نرم افزار</span>
                                <span class="badge bg-info p-4 mt-1">تحلیلگر کسب و کار</span>
                                <span class="badge bg-info p-4 mt-1">کارآفرین</span>
                                <span class="badge bg-info p-4 mt-1">استاد دانشگاه</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'isfp')
                            <p class="mt-5">افراد دارای شخصیت ISFP عاشق حیوانات هستند و احترام زیادی برای طبیعت قائل هستند. آن‌ها به دنبال مشاغل و سرگرمی‌هایی می‌روند که آنها را در تعامل با فضای بیرون و حیوانات قرار می‌دهد.</p>
                            <p class="mt-5">از آنجا که آنها تمرکز روی زمان حال را ترجیح می‌دهند؛ به خوبی در مشاغل عملی و مرتبط با مشکلات واقعی موفق هستند. مشاغل دارای آزادی و استقلال شخصی زیاد برایشان بسیار خوشایند است.</p>
                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">هنرمند</span>
                                <span class="badge bg-info p-4 mt-1">موسیقی دان</span>
                                <span class="badge bg-info p-4 mt-1">آشپز</span>
                                <span class="badge bg-info p-4 mt-1">طراح</span>
                                <span class="badge bg-info p-4 mt-1">جنگلبان</span>
                                <span class="badge bg-info p-4 mt-1">پرستار</span>
                                <span class="badge bg-info p-4 mt-1">طبیعت شناس</span>
                                <span class="badge bg-info p-4 mt-1">متخصص اطفال</span>
                                <span class="badge bg-info p-4 mt-1">روانشناس</span>
                                <span class="badge bg-info p-4 mt-1">مددکار</span>
                                <span class="badge bg-info p-4 mt-1">معلم</span>
                                <span class="badge bg-info p-4 mt-1">دامپزشک</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'istj')
                            <p class="mt-5">از آنجا که به نظم نیاز دارند در محیط‌های یادگیری و کاری دارای برنامه و وظایف مشخص به خوبی عمل نموده و روی کارشان متمرکز می‌شوند. آن‌ها در یادگیری موضوعات کاربردی در دنیای واقعی عالی عمل می‌کنند. آن‌ها اطلاعات دقیق و واقعی را دوست دارند و اطلاعات نظری و انتزاعی ارزشی برایشان ندارد؛ مگر اینکه کاربرد عملی آن را مشاهده کنند. آن‌ها برای انجام پروژه‌های مهم، بسیار تلاش می‌کنند ولی علاقه‌ای برای صرف وقت و انرژی روی کارهای بی فایده و غیرعملی ندارند.</p>
                            <p class="mt-5">آن‌ها در حرفه‌های نیازمند نظم، سازماندهی و پشتکار  به خوبی عمل می‌کنند. مشاغلی که با واقعیت‌ها و ارقام سروکار دارند (حسابداری، کتابداری، برنامه نویسی کامپیوتر و غیره) برایشان مناسب است. مشاغل نیازمند دقت، احترام به قوانین و با ثبات هم برای شخصیت  ISTJ خوشایند است</p>

                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">حسابدار</span>
                                <span class="badge bg-info p-4 mt-1">برنامه نویس کامپیوتر</span>
                                <span class="badge bg-info p-4 mt-1">دندانپزشک</span>
                                <span class="badge bg-info p-4 mt-1">پزشک</span>
                                <span class="badge bg-info p-4 mt-1">کتابدار</span>
                                <span class="badge bg-info p-4 mt-1">وکیل</span>
                                <span class="badge bg-info p-4 mt-1">افسر پلیس یا بازرس</span>
                                <span class="badge bg-info p-4 mt-1">رهبر ارتشی</span>
                                <span class="badge bg-info p-4 mt-1">روانشناس</span>
                                <span class="badge bg-info p-4 mt-1">مددکار</span>
                                <span class="badge bg-info p-4 mt-1">معلم</span>
                                <span class="badge bg-info p-4 mt-1">دامپزشک</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'infp')
                            <p class="mt-5">تیپ‌های شخصیتی INFP در مشاغلی که به راحتی خلاقیت و دیدگاهشان را ابراز کنند، موفق هستند. با اینکه به خوبی با دیگران همکاری می‌کنند؛ ولی کار انفرادی را بیشتر دوست دارند</p>
                            <p class="mt-5">آن‌ها بسیار خلاق، هنرمند و معنوی هستند. آن‌ها مهارتهای زبانی خوبی دارند ولی بیشتر از میان افکار و احساساتشان به نوشتن آنها علاقه دارند</p>
                            <p class="mt-5">از آنجا که به اصول اخلاقی و ارزش‌های قدرتمندی پایبند هستند به خوبی از باورهایشان دفاع می‌کنند. با اینکه به ارزش‌هایشان بسیار معتقدند ولی به شناخت دیگران هم علاقمند بوده و تمایل به شنیدن و بررسی جنبه‌های مختلف یک مسأله را دارند</p>


                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">هنرمند</span>
                                <span class="badge bg-info p-4 mt-1">مشاور</span>
                                <span class="badge bg-info p-4 mt-1">طراح گرافیکی</span>
                                <span class="badge bg-info p-4 mt-1">کتابدار</span>
                                <span class="badge bg-info p-4 mt-1">روانشناس</span>
                                <span class="badge bg-info p-4 mt-1">کار درمانگر</span>
                                <span class="badge bg-info p-4 mt-1">مددکار اجتماعی</span>
                                <span class="badge bg-info p-4 mt-1">نویسنده</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'intp')
                        <p class="mt-5">از آنجا که تیپ INTP از مفاهیم نظری و انتزاعی لذت می‌برند پس در مشاغل علمی موفق هستند. آن‌ها افرادی منطقی هستند و مهارتهای استدلالی قدرتمندی دارند به همین خاطر در تفکر خلاق، عالی عمل می‌کنند</p>
                        <p class="mt-5">آن‌ها افرادی بسیار منطقی و برای آزادی شخصی و استقلال ارزش زیادی قائل هستند. آن‌ها در برخی موارد اگر احساس کنند که توانایی تفکر و عملکردشان محدود شده است از دست مراجع قدرت خشمگین می‌شوند؛ به همین دلیل در مشاغل بسیار انعطاف پذیر و مستقل به خوبی عمل می‌کنند</p>


                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">شیمی دان</span>
                                <span class="badge bg-info p-4 mt-1">فیزیکدان</span>
                                <span class="badge bg-info p-4 mt-1">برنامه نویس کامپیوتر</span>
                                <span class="badge bg-info p-4 mt-1">پزشکی قانونی</span>
                                <span class="badge bg-info p-4 mt-1">مهندس</span>
                                <span class="badge bg-info p-4 mt-1">ریاضیدان</span>
                                <span class="badge bg-info p-4 mt-1">داروساز</span>
                                <span class="badge bg-info p-4 mt-1">توسعه دهنده نرم افزار</span>
                                <span class="badge bg-info p-4 mt-1">زمین شناس</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'infj')
                        <p class="mt-5">تیپ‌های شخصیتی INFJ در مشاغلی که امکان ابراز خلاقیت دارند؛ به خوبی عمل می‌کنند. از آنجا که شخصیت  INFJ به ارزش‌ها و عقاید بسیار عمیقی معتقد است؛ در مشاغلی  که از این اصول حمایت می‌کنند هم موفق هستند. آن‌ها در مشاغلی که به پرورش خلاقیت و اعمال تغییرات معنادار در دنیا نیاز دارند هم بهترین عملکرد را دارند</p>
                        <p class="mt-5">آن‌ها افرادی بسیار موفق و پیشگام در حوزه‌های تحصیلی و کاری هستند. آن‌ها گاهی کمال گرا هستند و برای کارشان بسیار تلاش می‌کنند. همکارانشان هم آنها را افرادی سختکوش و مثبت نگر می‌دانند که به راحتی می‌توان با آنها کنار آمد. با اینکه افرادی درونگرا هستند ولی گاهی اوقات به انزوا و تجدید قوا نیاز دارند.</p>
                        <p class="mt-5">گاهی اوقات تیپ‌های INFJ در نقش‌های مدیریتی برای اعمال قدرت با مشکل مواجه هستند. آن‌ها می‌خواهند با حساسیت تمام، رهبری کنند و به خوبی احساسات زیر دستانشان در محیط کار را درک می‌کنند. انجام مشاغل حاوی فعالیت‌های تکراری یا پایبندی به مقررات دقیق هم برایشان دشوار است</p>

                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">هنرمند</span>
                                <span class="badge bg-info p-4 mt-1">بازیگر</span>
                                <span class="badge bg-info p-4 mt-1">کارآفرین</span>
                                <span class="badge bg-info p-4 mt-1">مبلغ مذهبی</span>
                                <span class="badge bg-info p-4 mt-1">موسیقیدان</span>
                                <span class="badge bg-info p-4 mt-1">کتابدار</span>
                                <span class="badge bg-info p-4 mt-1">مشاور</span>
                                <span class="badge bg-info p-4 mt-1">روانشناس</span>
                                <span class="badge bg-info p-4 mt-1">نویسنده</span>
                                <span class="badge bg-info p-4 mt-1">معلم</span>
                                <span class="badge bg-info p-4 mt-1">عکاس</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'estj')
                        <p class="mt-5">از آنجا که عاشق نظم و سازماندهی هستند؛ در نقش‌های سرپرستی و نظارتی عملکرد خوبی دارند. در این سمت‌ها از پایبندی اعضای گروه به قوانین و اصول مقامات بالاتر، اطمینان پیدا می‌کنند.</p>
                        <p class="mt-5">تیپ‌های شخصیتی ESTJ در موقعیت‌های تحصیلی و کاری افرادی سختکوش و قابل اعتماد هستند. آنها کلمه به کلمه دستورالعمل‌ها را دنبال می‌کنند و احترام و سر سپردگی خاصی برای مراجع قدرت قائل هستند. آن‌ها در مورد اتمام کارشان، دقیق و وقت شناس هستند و به ندرت از کارشان شکایت کرده یا آن را زیر سوال می‌برند</p>
                        <p class="mt-5">این تیپ شخصیتی دارای ویژگیهای بسیار گسترده‌ای است که آنها را در حرفه‌های مختلفی موفق می‌کنند. تأکیدشان بر قوانین و فرایندها، آنها را مناسب سمت‌های سرپرستی و مدیریت می‌کند در حالیکه با احترام به قوانین، قدرت و نظم به خوبی می‌توانند نقش‌های مربوط به اجرای مقررات را در پیش بگیرند</p>

                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">افسر پلیس</span>
                                <span class="badge bg-info p-4 mt-1">ارتشی</span>
                                <span class="badge bg-info p-4 mt-1">قاضی</span>
                                <span class="badge bg-info p-4 mt-1">سیاستمدار</span>
                                <span class="badge bg-info p-4 mt-1">معلم</span>
                                <span class="badge bg-info p-4 mt-1">مدیر آموزشی</span>
                                <span class="badge bg-info p-4 mt-1">مدیر کسب و کار</span>
                                <span class="badge bg-info p-4 mt-1">حسابدار</span>
                                <span class="badge bg-info p-4 mt-1">بانکدار</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'esfp')
                        <p class="mt-5">آن‌ها علاقه‌ای به کارهای تکراری ندارند و در شغل‌های حاوی فعالیت های متنوع موفق هستند. مشاغلی که نیازمند معاشرت اجتماعی زیاد است برایشان مناسب هستند و به خوبی از مهارتهای خودشان در این شرایط استفاده می‌کنند. مشاغل نیازمند نظم زیاد و غیره قابل انعطاف برایشان دشوار است و تحت این شرایط، سر خورده می‌شوند.</p>

                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">هنرمند</span>
                                <span class="badge bg-info p-4 mt-1">بازیگر</span>
                                <span class="badge bg-info p-4 mt-1">پرستار کودک</span>
                                <span class="badge bg-info p-4 mt-1">موسیقی دان</span>
                                <span class="badge bg-info p-4 mt-1">روانشناس</span>
                                <span class="badge bg-info p-4 mt-1">متخصص منابع انسانی</span>
                                <span class="badge bg-info p-4 mt-1">طراح مد</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'esfj')
                        <p class="mt-5">چون تیپ شخصیتی ESFJ از کمک کردن به دیگران لذت می‌برد در موقعیت‌های عملی شامل قبول نقش مراقبتی؛ موفق هستند. مشاغل خدمات اجتماعی و مراقبت بهداشتی دو حوزه مناسب برای آنها است تا ماهیت حمایتی و گرایش به نظم را در آنجا به کار ببرند. این تیپ‌ها دارای صفاتی هستند که آنها را به افرادی ایده آل برای مشاغل خاصی تبدیل می‌کند. برای مثال وابستگی و نیاز درونی برای مراقبت از دیگران به معنای موفقیت آنها در مشاغل حمایتی و مراقبتی مثل پرستاری و معلمی است.</p>

                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">پرستار کودک</span>
                                <span class="badge bg-info p-4 mt-1">پرستاری</span>
                                <span class="badge bg-info p-4 mt-1">معلمی</span>
                                <span class="badge bg-info p-4 mt-1">مددکار اجتماعی</span>
                                <span class="badge bg-info p-4 mt-1">مشاور</span>
                                <span class="badge bg-info p-4 mt-1">پزشک</span>
                                <span class="badge bg-info p-4 mt-1">مسئول پذیرش</span>
                                <span class="badge bg-info p-4 mt-1">دفتردار</span>
                                <span class="badge bg-info p-4 mt-1">مدیر اداری</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'enfp')
                        <p class="mt-5">شناخت نقاط قوت و ضعف در حین انتخاب مسیر شغلی اهمیت زیادی دارد. افراد دارای تیپ ENFP در مشاغل بسیار انعطاف پذیر به خوبی عمل می‌کنند.</p>
                        <p class="mt-5">چون افرادی همدل و نوع دوست هستند در مشاغل خدماتی به خوبی عمل می‌کنند. آن‌ها باید از مشاغل دارای وظایف تکراری و جزئیات زیاد، اجتناب کنند.</p>

                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">روانشناس</span>
                                <span class="badge bg-info p-4 mt-1">روزنامه نگار</span>
                                <span class="badge bg-info p-4 mt-1">بازیگر</span>
                                <span class="badge bg-info p-4 mt-1">گزارشگر تلویزیونی</span>
                                <span class="badge bg-info p-4 mt-1">متخصص تغذیه</span>
                                <span class="badge bg-info p-4 mt-1">پرستار</span>
                                <span class="badge bg-info p-4 mt-1">مددکار اجتماعی</span>
                                <span class="badge bg-info p-4 mt-1">سیاستمدار</span>
                                <span class="badge bg-info p-4 mt-1">مشاور</span>
                                <span class="badge bg-info p-4 mt-1">نکاتی برای تعامل با تیپ ENFP</span>
                                <span class="badge bg-info p-4 mt-1">دوستی</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'enfj')
                        <p class="mt-5">آن‌ها در مشاغل نیازمند کمک و تعامل زیاد با دیگران، موفق هستند. چون مهارتهای ارتباطی و سازماندهی عالی دارند می‌توانند به رهبران و مدیرانی فوق العاده تبدیل شوند</p>
                        <p class="mt-5">آن‌ها در سازماندهی فعالیت‌ها، عالی عمل می‌کنند و به هر عضو برای رسیدن به توان بالقوه و حل و فصل اختلافات بین فردی کمک می‌کنند. آن‌ها به برقراری هماهنگی در تمامی موقعیت‌ها تلاش نموده و همواره می‌دانند که برای رفع تنش و کاهش اختلافات چه باید کرد.</p>

                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">مشاور</span>
                                <span class="badge bg-info p-4 mt-1">روانشناس</span>
                                <span class="badge bg-info p-4 mt-1">مددکار اجتماعی</span>
                                <span class="badge bg-info p-4 mt-1">مدیر منابع انسانی</span>
                                <span class="badge bg-info p-4 mt-1">نمایندگی فروش</span>
                                <span class="badge bg-info p-4 mt-1">مدیر</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'entp')
                        <p class="mt-5">کارهای تکراری و خسته کننده برای تیپ ENTP چندان خوشایند نیست. آن‌ها اهل همرنگ شدن با جماعت نیستند و هنگامیکه از کاری هیجان زده شوند و بتوانند خلاقیتشان را ابراز کنند؛ بهترین عملکرد را نشان می‌دهند. تیپ‌های ENTP در مشاغل مختلف در صورتیکه دلزده و محدود نشوند؛ موفق می‌شوند.</p>
                        <p class="mt-5">چون تیپ‌های ENTP، شخصیت مجادله گری دارند؛ مشاغل حقوقی برایشان مناسب است و چالش‌های متنوعی را در اختیارشان قرار می‌دهد. مشاغل تجاری هم که نیازمند تلفیق مهارتهای استدلال، خلاقیت و رهبری در تیپ‌های ENTP هستند هم بسیار برایشان سودمند است</p>

                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">مهندس</span>
                                <span class="badge bg-info p-4 mt-1">وکیل</span>
                                <span class="badge bg-info p-4 mt-1">دانشمند</span>
                                <span class="badge bg-info p-4 mt-1">روانشناس</span>
                                <span class="badge bg-info p-4 mt-1">مخترع</span>
                                <span class="badge bg-info p-4 mt-1">روانپزشک</span>
                                <span class="badge bg-info p-4 mt-1">روزنامه نگار</span>
                            </div>
                        @elseif($scoreArray['mbti'] == 'istp')
                        <p class="mt-5">از آنجا که ISTP ها درونگرا هستند؛ در کارهای انفرادی هم موفق هستند. آن‌ها به نظم زیاد علاقه‌ای ندارند و در مشاغل دارای آزادی و استقلال، موفق هستند. چون افرادی بسیار منطقی هستند؛ از کارهای نیازمند استدلال و تجارب دستی لذت می‌برند. آن‌ها کارهای عملی در دنیای واقعی را دوست دارند./p>

                            <div class="mt-4 text-center">
                                <span class="badge bg-info p-4 mt-1">پزشکی قانونی</span>
                                <span class="badge bg-info p-4 mt-1">مهندسی مکانیک</span>
                                <span class="badge bg-info p-4 mt-1">برنامه نویسی کامپیوتر</span>
                                <span class="badge bg-info p-4 mt-1">نجاری</span>
                                <span class="badge bg-info p-4 mt-1">مجری قانون</span>
                                <span class="badge bg-info p-4 mt-1">مهندسی نرم افزار</span>
                                <span class="badge bg-info p-4 mt-1">طراحی بازی ویدئویی</span>
                                <span class="badge bg-info p-4 mt-1">تکنیسین برق</span>
                                <span class="badge bg-info p-4 mt-1">خلبان</span>
                                <span class="badge bg-info p-4 mt-1">آتش نشان</span>
                            </div>
                        @endif
                    </div>
                </div>
                <div class="boxResult row mx-0 justify-content-center">
                    <div class="col-12 mt-4">
                        <div class="row title">
                            <div class="col-1"><i class="fas fa-users c-first-200" style="font-size: 70px"></i></div>
                            <div class="col-9"><h4>نکاتی برای تعامل با این تیپ شخصیتی</h4></div>
                            <div class="col-2 mbtiTitle text-center">{{ strtoupper($scoreArray['mbti']) }}</div>
                        </div>
                        @if($scoreArray['mbti'] == 'intj')
                            <h6 class="my-5">دوستی INTJ</h6>
                            <p>                            تیپ‌های INTJ تمایل به انزوا دارند و افرادی خودکفا هستند. پس دوستی با آنها گاهی اوقات دشوار می‌شود. چون این تیپ شخصیتی خیلی به آینده فکر می‌کند. زیاد تمایلی به شناخت دیگران ندارد چون به نظرشان دوستی‌های بلندمدت به ثمر نخواهند رسید. خبر خوب اینجاست که با اینکه آنها دوستان زیادی ندارند ولی به خوبی با افرادی که سماجت دارند، متعهد و صمیمی می‌شوند. آن‌ها دوستان درونگرا و منطقی با ابراز هیجانی کمتر را ترجیح می‌دهند.</p>
                            <h6 class="my-5">والدگری INTJ</h6>
                            <p>                            والدین INTJ بسیار با ملاحظه و مراقب هستند ولی خیلی مهربان نیستند. آن‌ها انتظارات زیادی از کودکانشان دارند و به تفکر منطقی کودکانشان در حین تصمیم گیری کمک می‌کنند. والدین دارای این تیپ شخصیتی، کودکان را در جهت تبدیل شدن به متفکران تحلیلی تشویق می‌کنند تا خودشان به تنهایی از عهده حل مشکلاتشان برآیند.
                                اگر کودکتان دارای تیپ INTJ است به دنبال تقویت قوای ذهنی او بروید. ولی جانب تعادل را رعایت کنید و از کمالگرایی افراطی اجتناب نمایید. می‌توانید به کودکتان در جهت توسعه قوای هیجانی کمک کنید و به دنبال روشهایی برای بیان کردن احساساتشان بگردید.</p>
                            <h6 class="my-5">روابط زناشویی</h6>
                            <p>                            از آنجا که شناخت INTJ ها دشوار است؛ روابط عاشقانه با آنها هم گاهی اوقات دچار مشکل می‌شود. اگر همسرتان دارای این تیپ شخصیتی است باید بدانید که وفاداری و درک شدن برایش مهم است. نشان دهید که به شریک INTJ متعهد هستید ولی آنها را برای برون ریزی احساساتشان تحت فشار قرار ندهید. روابط هم اهمیت حیاتی دارند. به جای آنکه انتظار داشته باشید تا همسرتان نشانه‌های غیرکلامی رفتارتان را بفهمد؛ باید به طور مستقیم و صریح در مورد انتظاراتتان صحبت کنید.</p>
                        @elseif($scoreArray['mbti'] == 'estp')
                            <p class="my-5">اگر دوست، همکار، یک عزیر یا همسرتان دارای تیپ  ESTP است؛ پس برای بهبود ارتباط و تعامل خودتان با او می‌توانید کارهای خاصی انجام دهید. یادگیری بیشتر در مورد ویژگیهای این تیپ شخصیتی به شما در جهت درک بهتر آنها کمک خواهد کرد.</p>
                            <h6 class="my-5">دوستی ESTP</h6>
                            <p>تیپ‌های ESTP تشنه ماجراجویی هستند. پس با رقم زدن تجارب جدید یا برنامه‌های هیجانی، جدید و چالشی می‌توانید به بهترین دوست این تیپ شخصیتی تبدیل شوید.</p>
                            <h6 class="my-5">والدگری ESTP</h6>
                            <p>کودک ESTP به ماجراجویی پرداخته و کودکی مستقل است. پس والدینش باید محدودیت‌هایی را مشخص کنند و نظم پایدار و منصفانه‌ای را اعمال نمایند. افراد دارای این تیپ شخصیتی باید با فعالیت زیاد سرشان را گرم کنند ولی چون از کارهای تکراری زود خسته می‌شوند، قرارگیری در موقعیت کلاسی برایشان دشوار است.</p>
                            <h6 class="my-5">روابط زناشویی</h6>
                            <p>تیپ‌های شخصیتی ESTP عاشق سرگرمی و هیجان هستند ولی از کارهای یکنواخت دلزده می‌شوند. آن‌ها از بحث‌های طولانی و فلسفی لذت نمی‌برند؛ ولی بحث در مورد علایق مشترک را دوست دارند. همسری که این تیپ را دارد امورات را روزمره بررسی می‌کند؛ با تعهدات با بلندمدت مشکل دارد و به سختی برای آینده برنامه ریزی می‌کند.</p>
                        @elseif($scoreArray['mbti'] == 'isfj')
                            <h6 class="my-5">دوستی ISFJ</h6>
                            <p class="my-5">اگر با تیپ ISFJ دوست هستید؛ پس تا به حال فهمیده‌اید که فردی صمیمی و فداکار است. آن‌ها با وجود درونگرا بودن، کاملاً هم اجتماعی هستند ولی همواره نمی‌توانند احساساتشان را به خوبی بیان کنند. از آنها بپرسید که در چه شرایطی راحت هستند تا به آب شدن یخشان کمک کنید.
                                با توجه کردن به نیازهایشان به دوستی خوب برای آنها تبدیل می‌شوید. وقت بگذارید و ببینید که قادر به تأمین کدامیک از نیازهایشان هستید.</p>
                            <h6 class="my-5">والدگری ISFJ</h6>
                            <p class="my-5">این تیپ‌های شخصیتی، مراقبان خوبی هستند و به خوبی از کودکانشان مراقبت می‌کنند. آن‌ها نظم را به کودکانشان یاد می‌دهند؛ ولی گاهی اوقات هم در اجرای این نظم به مشکل بر می‌خورند.
                                اگر والد کودکی با تیپ شخصیتی ISFJ هستید پس از نیاز کودکتان به تنهایی، آگاه شوید. باید بدانید که شاید کودکتان برای خوشحال کردن دیگران، کارهای مهمش را رها میکند. آن‌ها را در جهت دنبال کردن علایق و اهدافشان تشویق کنید و به آنها خاطرنشان نمایند که تأمین نیازهای خودشان هم اهمیت دارد</p>
                            <h6 class="my-5">روابط زناشویی</h6>
                            <p class="my-5">تیپ‌های شخصیتی ISFJ  بسیار وفادار هستند و با هیجان و صمیمت زیادی وارد رابطه می‌شوند. با اینکه احساسات قدرتمندی دارند؛ ولی همواره در ابراز آنها موفق نیستند.
                                اگر همسرتان دارای تیپ ISFJ است؛ پس در اغلب مواقع به نیازهایتان اهمیت می‌دهد. ولی شما هم باید به طور متقابل، همین کار را برایش انجام دهید. به همسرتان نشان دهید که او را درک می‌کنید تا بتواند به حس رضایت بیشتری از روابط زناشویی برسد.</p>
                        @elseif($scoreArray['mbti'] == 'entj')
                            <h6 class="my-5">دوستی ENTJ</h6>
                                <p class="my-5">تیپ‌های ENTJ افرادی اجتماعی و عاشق گفتگو هستند. با اینکه شاید اهل بحث و جدل به نظر برسند ولی این تنها بخشی از سبک ارتباطی آنها است و نباید این رفتار آنها را به خودتان بگیرید. آن‌ها به راحتی با افرادی که علایق و دیدگاههایشان را با آنها در میان می‌گذارند؛ دوست می‌شوند و با شناخت افراد بسیار درونگرا، حساس یا عاطفی هم مشکل دارند.</p>
                            <h6 class="my-5">والدگری ENTJ</h6>
                                <p class="my-5">والدین کودکان ENTJ باید بدانند که کودکشان می‌خواهد مستقل باشد و به لحاظ منطقی هم فردی کنجکاو است. به کودکانتان اجازه دهید تا کنجکاوی خودشان را دنبال کنند. اگر می‌خواهید کودکتان نقش خاصی را قبول کند پس باید استدلال خودتان را برایش توضیح دهید.
                                    با صحبت آزادانه در مورد احساسات کودکتان به او اجازه دهید تا به شناخت هیجانی بهتری رسیده و آن را توسعه دهد. به احساسات مختلف افراد در قبال تجارب مختلف، اشاره کنید تا کودک ENTJ بهتر بتواند هیجان‌های خودش و دیگران را تفسیر کند.</p>
                            <h6 class="my-5">روابط زناشویی</h6>
                                <p class="my-5">معشوق دارای تیپ ENTJ در اغلب مواقع فردی کاملاً سلطه طلب در روابط زناشویی دیده می‌شود. برای این افراد مواجهه با هیجانها چندان طبیعی به نظر نمی‌رسد؛ پس شاید افرادی بی ملاحظه نسبت به احساسات شریک زندگی به نظر برسند. باید بدانید که این امر به معنای بی احساس بودن ENTJ ها نیست. آن‌ها باید کاملاً احساس راحتی کنند تا بتوانند هیجانها و عواطفشان را به خوبی ابراز کنند. آن‌ها نسبت به روابطشان، کاملاً متعهد هستند و همواره به دنبال روش‌های تقویت روابط می‌گردند. اگر مشکلی با همسرتان دارید پس روراست و صادقانه به او بگویید. او به جای حدس زدن حقیقت به شنیدنش علاقه دارد.</p>
                        @elseif($scoreArray['mbti'] == 'isfp')
                            <h6 class="my-5">دوستی ISFP</h6>
                                <p>تیپ‌های ISFP رفتار دوستانه‌ای دارند و به خوبی با دیگران کنار می آیند ولی قبل از اینکه با شما راحت رفتار کنند باید شما را بشناسند.</p>
                                <p>با پذیرش فرد ISFP می‌توانید به دوستی خوب برایش تبدیل شوید.</p>
                                <p>آن‌ها بسیار خوش قلب و بامزه هستند؛ ولی در اغلب اوقات آرام هستند. آن‌ها گاهی اوقات می‌خواهند با شما در و دل کنند و گاهی اوقات هم می‌خواهند به سمت فضای شخصی خودشان کناره گیری کنند</p>
                            <h6 class="my-5">والدگری ISFP</h6>
                            <p>کودک ISFP فردی کمالگرا است و سختگیرترین منتقد خودش محسوب می‌شود</p>
                            <p>چون انتظارات زیادی از خودشان دارند، در اغلب موارد مهارتها و استعدادهایشان را دست کم می‌گیرند</p>
                            <p>اگر والد کودک ISFP هستید؛ می‌توانید او را در جهت مهربانی با خودش و پی بردن به ارزش خودش، تشویق کنید</p>
                            <h6 class="my-5">روابط زناشویی ISFP</h6>
                            <p>تیپ‌های شخصیتی ISFP افرادی با ملاحظه در طول روابط هستند و در اغلب موارد در برابر خواسته‌های همسرشان تسلیم می‌شوند.</p>
                            <p>از آنجا که در ابراز احساسات و نیازهایشان چندان خوب عمل نمی‌کنند؛ پس خودتان باید آنها را بشناسید</p>
                            <p>در حین تصمیم گیری هم به حرف همسرتان گوش کنید و به احساساتش اهمیت دهید</p>
                        @elseif($scoreArray['mbti'] == 'istj')
                            <h6 class="my-5">دوستی ISTJ</h6>
                                <p>آن‌ها به خوبی با افراد مشابه خودشان دوست می‌شوند. با اینکه می‌خواهند کمی جدی و عصا قورت داده باشند؛ ولی بامزه بودن هم از آنها بر می‌آید. آن‌ها علاقه‌ای به امتحان کردن کارهای جدید ندارند ولی اگر به آنها در جهت دنبال کردن علایق و فعالیتهای لذت بخش کمک کنید به دوستی فوق العاده تبدیل می‌شوند.</p>
                            <h6 class="my-5">والدگری ISTJ</h6>
                            <p>والدین  ISTJ می‌خواهند روی سنتها متمرکز شوند و به خوبی امنیت و ثبات را برای کودکانشان فراهم می‌کنند. کودکان والدین ISTJ هم می‌بینند که والدینشان با ملاحظه هستند و به آنها احترام می‌گذارند و به طور متقابل انتظار چنین رفتاری را از آنها دارند</p>
                            <p>والدین کودکان ISTJ هم با رفتار با ثبات، حس امنیت را به کودکانشان می‌دهند. به کارهای متداول می‌پردازند، تغییر را به کندی اعمال می کنند و فرصت سازگاری با موقعیت‌های جدید را به کودکانشان می‌دهند</p>
                            <h6 class="my-5">روابط زناشویی ISTJ</h6>
                            <p>با اینکه تجربه احساسات عمیق در ISTJ ها متداول است ولی با ابراز این جنبه از شخصیت خودشان در روابط عاشقانه مشکل دارند. پس انتظار نداشته باشید که از همان ابتدا سفره دلشان را برایتان باز کنند. گاهی اوقات ارتباط با این افراد مثل این است که توجهی به احساسات شما ندارند؛ ولی با ارائه توضیحات و حقایق منطقی خودتان می‌توانید به آنها کمک کنید تا دیدگاهتان را به خوبی بشناسند</p>

                        @elseif($scoreArray['mbti'] == 'infp')
                            <h6 class="my-5">دوستی INFP</h6>
                                <p>تیپ شخصیتی INFP معمولاً چند دوست نزدیک دارد ولی این روابط، بلندمدت هستند. با اینکه این تیپ‌ها به خوبی هیجانهای دیگران را درک می‌کنند ولی در ابراز احساسات خودشان مشکل دارند. با اینکه آنها به دنبال صمیمت عاطفی و روابط عمیق هستند، ولی باز هم برقراری ارتباط اجتماعی برایشان دشوار است. شناخت یک INFP زمان می‌برد ولی افراد صبور و فهیم به راحتی در این زمینه موفق می‌شوند</p>
                            <h6 class="my-5">والدگری INFP</h6>
                                <p>والدین دارای تیپ INFP افرادی حمایتگر، مراقب و خونگرم هستند. آنها به خوبی دستورالعمل‌ها را مشخص کرده و به کودکانشان در جهت پایبندی به ارزش‌های قوی، کمک می‌کنند. هدفشان هم کمک به رشد کودکان به عنوان افرادی مستقل و آگاه نسبت به مسائل جهان است. آن‌ها گاهی اوقات برای در میان گذاشتن عواطفشان با کودکانشان مشکل دارند و غالباً روی ایجاد هماهنگی در خانه متمرکز می‌شوند</p>
                            <h6 class="my-5">روابط زناشویی INFP</h6>
                            <p>تیپ شخصیتی INFP در مسائل زناشویی هم مثل موقعیت‌های دوستانه گاهی اوقات برای نزدیک شدن به شریک عاطفی به مشکل بر می‌خورند. هنگامیکه آن‌ها رابطه زناشویی تشکیل دهنده تا حد زیادی به آن وفادار هستند. آن‌ها گاهی اوقات دیدگاه بیش از حد رمانتیک و انتظارات بالایی از روابط زناشویی دارند که تأمین این شرایط برای همسرشان بسیار دشوار می‌شود. آن‌ها در عین اجتناب از اختلاف، بسیاری از نظرات فرد مقابل را به خودشان می‌گیرند. اگر همسرتان دارای تیپ INFP است؛ پس بدانید که در اغلب مواقع با افشاگری در مورد احساساتش، مشکل دارد؛ بیش از حد در مقابل انتقاد، حساس است و در اغلب مواقع، شاد کردن شما را نسبت به شادی خودش در اولویت قرار می‌دهد.</p>
                        @elseif($scoreArray['mbti'] == 'intp')
                            <h6 class="my-5">دوستی INTP</h6>
                                <p>یکی از بهترین روش‌ها برای برقراری روابط دوستانه با INTP ها، داشتن علایق مشترک با آنها است. آن‌ها بیش از هر چیزی به منطق اهمیت می‌دهند و در دوستیابی بسیار کند عمل می کنند و دیر به دیگران نزدیک می شوند. به همین دلیل دوستان کمی دارند که بسیار با آنها صمیمی هستند. دوستان INTP شما در مواجهه با هیجانهای افراطی چندان خوب عمل نمی‌کنند ولی به تشکیل رابطه براساس بحث‌های عمیقی و علایق مشترک، علاقمند هستند</p>
                                <h6 class="my-5">والدگری INTP</h6>
                                <p>اگر کودکتان دارای تیپ INTP است؛ پس به حرفهای منطقی و مستدل بهتر از گرایش‌های هیجانی واکنش نشان می‌دهد. به آنها اجازه دهید تا توانایی هوشی خودشان را تقویت نمایند و شرایط توسعه روابط دوستانه را برایشان فراهم کنید. کودکتان احتمالاً در این حوزه مشکل دارد؛ ولی آنها را در تعامل با سایر کودکانی که علایق مشترکی با فرزندتان دارند قرار دهید تا به آنها کمک کنید</p>
                                <h6 class="my-5">روابط زناشویی INTP</h6>
                                <p>تیپ‌های INTP زندگی در دنیای ذهنی خودشان را دوست دارند؛ پس شناخت این افراد بسیار دشوار است. انها حتی در روابط عاشقانه هم پیش قدم نمی‌شوند تا اینکه مطمئن شوند که طرف مقابلشان آنها را شایسته شنیدن افکار و احساسات درونی خودش می‌داند</p>
                                <p>آن‌ها به روابط عاشقانه متعهد هستند و با احساسات طرف مقابل بازی نمی‌کنند. با آنها صادقانه و رو راست رفتار کنید. از آنجا که INTP ها در شناخت نیازهای عاطفی دیگران چندان خوب عمل نمی‌کنند؛ پس باید با آنها رو راست رفتار کنید و نیازها و انتظارات خودتان را بیان کنید. آن‌ها در بیان احساساتشان هم مشکل دارند؛ پس باید به نشانه‌های ظریفی که ارسال می‌کنند؛ توجه کنید</p>
                        @elseif($scoreArray['mbti'] == 'infj')
                            <h6 class="my-5">دوستی INFJ</h6>
                                <p>از آنجا که این افراد، محافظه کار و تودار هستند؛ شناختشان هم دشوار است. آن‌ها برای روابط نزدیک و صمیمانه ارزش زیادی قائل هستند و با اینکه احساساتشان را از دیگران مخفی می‌کنند ولی به راحتی لطمه می‌بینند. تعامل با INFJ شامل درک آنها و حمایت از نیاز به خلوت کردن و تجدید قوای آنها است. افراد دارای این تیپ شخصیتی، گاهی اوقات هم دچار سوء تفاهم می‌شوند. اگر برای شناخت دیدگاهشان وقت بگذارید و نقاط قوت آنها را بشناسید به بهترین دوستشان تبدیل می‌شوید</p>
                            <h6 class="my-5">والدگری INFJ</h6>
                            <p>از آنجا که INFJ ها به خوبی احساسات دیگران را درک می‌کنند به بهترین دوستان کودکانشان تبدیل می‌شوند. آن‌ها به استانداردهای بالایی قائل هستند و انتظارات بالایی دارند. آن‌ها به دنبال پرورش کودکانی مهربان، با ملاحظه و دلسوز هستند. آن‌ها کودکانشان را در جهت دنبال کردن علایق و استعدادهایشان تشویق می‌کنند تا بتوانند پتانسیل فردی خودشان را به طور کامل شکوفا کنند</p>
                            <h6 class="my-5">روابط زناشویی INFJ</h6>
                            <p>تیپ‌های INFJ دارای توانایی ذاتی برای درک احساسات دیگران هستند و از روابط نزدیک و صمیمانه لذت می‌برند. آن‌ها در روابط عاشقانه با افراد پایبند به ارزش‌های مشابه آنها؛ بسیار موفق عمل می‌کنند. شما به عنوان همسر این تیپ شخصیتی باید از آنها حمایت کرده و صمیمیت عاطفی مورد نیازشان را فراهم کنید. صداقت، صمیمت و اصالت اهمیت زیادی برای آنها دارد و به دنبال آنها در شریک زندگی خودشان هستند</p>
                        @elseif($scoreArray['mbti'] == 'estj')
                            <h6 class="my-5">دوستی ESTJ</h6>
                                <p>افراد داری این تیپ شخصیتی بسیار خوش مشرب هستند و از اینکه دوستانشان را در کارهای مورد علاقه خودشان همراه نمایند؛ لذت می‌برند. این افراد به قابل اطمینان بودن بیشتر از هر چیز دیگری اهمیت می‌دهند. اگر دوستی هستید که به تعهداتش پایبند است؛ پس احتمالاً می‌توانید رابطه دوستی قدرتمندی را با تیپ شخصیتی ESTJ تشکیل دهید</p>

                            <h6 class="my-5">والدگری ESTJ</h6>
                                <p>کودکان ESTJ بسیار مسئولیت پذیر و هدفگرا هستند؛ ولی نباید مسئولیت‌های بسیار زیادی را به آنها محول کنید. آن‌ها از سازماندهی و کارهای متداول لذت می‌برند. با اینکه به خوبی به کارهایشان نظم می‌دهند ولی باز هم به راهنمایی و قوانین نیاز دارند تا به حس امنیت برسند</p>
                            <h6 class="my-5">روابط زناشویی ESTJ</h6>
                                <p>تیپ‌های ESTJ افرادی قابل اطمینان هستند و تعهداتشان را جدی می‌گیرند. هنگامیکه خودشان را وقف یک رابطه کنند؛ یک عمر به آن وفادار می‌مانند. آن‌ها تمایل به اجتناب از هیجان‌ها و احساس‌ها دارند که گاهی اوقات شرایط را برای همسرشان دشوار می‌کند. با اینکه احساساتشان را به زبان نمی‌آورند؛ ولی هیجاناتشان را در رفتارهایشان نشان خواهند داد.</p>
                        @elseif($scoreArray['mbti'] == 'esfp')
                            <h6 class="my-5">دوستی ESFP</h6>
                            <p>تیپ‌های شخصیتی ESFP از کارهای متداول و خسته کننده زود خسته می‌شوند و همواره آماده ماجراجویی جدید هستند. شما برای همراهی با این تیپ شخصیتی، همواره باید آماده تجارب جدید شوید که از گشت و گذار در مکان‌های جدید گرفته تا ملاقات با افراد جدید را در بر می‌گیرد. جذاب بودن امور برایشان اهمیت دارد؛ آنها همواره به دنبال همدستی قابل اعتماد و آماده خوشی کردن می‌گردند</p>

                            <h6 class="my-5">والدگری ESFP</h6>
                                <p>می‌توانید امکان تخلیه این انرژی را به روش‌های مختلفی فراهم کنید. ورزش‌های مختلف، سرگرمی‌ها و گردش در بیرون از خانه، همگی منابع سرگرمی خوبی برای کودکان ESFP هستند. با اینکه کودکان برونگرا، عاشق مردم هستند ولی برای پردازش احساساتشان در هنگامیکه ناراحت هستند به کمی تنها ماندن نیاز دارند. باید قبل از آنکه از آنها در مورد احساساتشان توضیح بخواهید، اول وقت کافی را در اختیارشان قرار دهید.</p>
                            <h6 class="my-5">روابط زناشویی ESFP</h6>
                                <p>این تیپ شخصیتی در روابط زناشویی به طور صادقانه و روراست رفتار می‌کند. آنها علاقه‌ای به بازی درآوردن ندارند و افرادی خونگرم و خوش ذوق در روابط عاشقانه هستند. آن‌ها علاقه‌ای به اختلاف ندارند و انتقادها را به خودشان می‌گیرند. در رابطه زناشویی با یک ESFP روراست رفتار کنید و از تند خویی و بحث اجتناب کنید.</p>
                        @elseif($scoreArray['mbti'] == 'esfj')
                            <h6 class="my-5">دوستی ESFJ</h6>
                            <p>تیپ ESFJ می‌تواند فداکاری را به جایی برساند که نیازهای خودش را نادیده بگیرد تا از شاد کردن دیگران اطمینان پیدا کند. دوستی با این تیپ یعنی باید از ماهیت بخشنده وجودشان قدردانی کنید و مطمئن شوید که مهربانی آنها را تلافی می‌کنید</p>
                            <p>این تیپ شخصیتی با افرادی که قدرشان را می‌دانند؛ خیلی خوب کنار می‌آیند. روابط برای شخصیت سفیر بسیار مهم است و از روابط حاوی اختلافات یا انتقاد زیاد هم اجتناب می‌کنند</p>

                            <h6 class="my-5">والدگری ESFJ</h6>
                            <p>کودکان ESFJ رفتاری مسئولانه دارند و از وقت گذراندن در کنار خانواده لذت می‌برند. کودک شما نیازمند تشویق مرتب است. از علایق و فعالیت‌های آنها حمایت کرده و ذوق زدگی خودتان را نشان دهید</p>
                            <p>این کودکان نیازمند داشتن روال زندگی مشخص هستند. قواعد را مشخص کرده و به آنها پایبند بمانید. کودکان ESFJ در هنگامیکه از انتظارات مطلع می‌شوند با اطمینان و اعتماد به نفس بیشتری زندگی می‌کنند</p>
                            <h6 class="my-5">روابط زناشویی ESFJ</h6>
                            <p>آن‌ها در روابط عاشقانه فداکارانه، حمایتگرانه و وفادارانه رفتار می‌کنند. آن‌ها علاقه‌ای به روابط موقت ندارند و روی تعهدات بلندمدت متمرکز می‌شوند. با نشان دادن عشق و قدردانی خودتان از این تیپ شخصیتی حمایت کنید. به عواطف و حالات عاشقانه آنها با مهربانی و عشق پاسخ دهید</p>
                            <p>تیپ‌های ESFJ در روابط عاشقانه به دنبال افراد صادقی هستند که عواطف و هیجان‌های آن‌ها را با آغوش باز می‌پذیرند. آن‌ها برای صمیمیت دوستی و تعهدات بلندمدت، ارزش قائل هستند.</p>
                        @elseif($scoreArray['mbti'] == 'enfp')
                            <h6 class="my-5">دوستی ENFP</h6>
                            <p>تیپ‌های ENFP دوستان بامزه و پرشوری هستند. آن‌ها از انجام کارهای جدید لذت می‌برند و جمع بزرگی از دوستان و آشنایان در اطرافشان حضور دارد. آن‌ها به خوبی احساسات دیگران را درک می‌کنند. با حمایت عاطفی از دوستان ENFP خودتان می‌توانید به آنها در جهت دستیابی به اهدفشان کمک کنید.</p>

                            <h6 class="my-5">والدگری ENFP</h6>
                            <p>چون ENFP ها علاقه‌ای به کارهای تکراری ندارند، گاهشی اوقات از نظر کودکانشان افرادی بی صبر دیده می‌شوند. روابط قدرتمند و دوستانه‌ای با کودکانشان دارند و احساسات و ارزش‌هایشان را به خوبی با آنها در میان می‌گذارند. والدین کودکان ENFP به خوبی تخیل قدرتمند کودکشان و اشتیاق او  برای زندگی را درک می‌کنند. گاهی اوقات، انرژی این کودکان شما را از پا در می‌آورد؛ ولی باید با روش‌های مختلف به ابراز خلاقیت کودکتان کمک کنید.</p>
                            <p>یکی از مشکلات این کودکان در سازماندهی و تعیین محدودیت‌ها است. با اینکه نیاز به این موارد را می‌شناسند ولی همواره در تعیین محدودیت‌ها، مشکل دارند. والدین ENFP باید کودکانشان را در جهت خلاقیت تشویق کنند؛ ولی قواعد و راهنمایی لازم را هم در اختیارشان قرار دهند.</p>

                            <h6 class="my-5">روابط زناشویی ENFP</h6>
                            <p>تیپ‌های ENFP در روابط عاشقانه، پرشور و شوق هستند. گاهی اوقات در روابط بلندمدت به مانع بر می‌خورند چون این تیپ همواره به جای تمرکز روی شرایط فعلی روی احتمالات متمرکز می‌شود. برای پایداری روابط عاشقانه با این افراد به دنبال روش‌های جدید ایجاد هیجان در رابطه بگردید.</p>
                        @elseif($scoreArray['mbti'] == 'enfj')
                            <h6 class="my-5">دوستی ENFJ</h6>
                            <p>یکی از بهترین روش‌ها برای تبدیل شدن به بهترین دوست تیپ ENFJ، پذیرش حمایت و مراقبت ارائه شده از جانب آنها است. افراد دارای این تیپ شخصیتی از کمک کردن به دوستانشان لذت می‌برند و باید نشان دهید که هر آنچه را به شما عرضه می‌کنند؛ می‌پذیرید و مورد تأیید قرار دهید</p>
                            <p>با این حال باید در مقابل، حمایت آنها را تلافی کنید. تیپ‌های ENFJ در موارد مورد نیازشان چندان برای دریافت کمک خوب عمل نمی‌کنند. در بسیاری از موارد تنها با رغبت به گفته‌هایشان گوش دهید. این کار بسیار برای ارتباط شما مفید است</p>

                            <h6 class="my-5">والدگری ENFJ</h6>
                            <p>کودکان دارای والدین تیپ ENFJ کنار آمدن با انتظارات بالای والدینشان را دشوار می‌دانند. این والدین در بعضی موارد بسیار کنترل کننده هستند که کودکان را از اکتشاف در دنیای اطرافشان باز می‌دارند</p>
                            <p>والدین کودکان دارای تیپ ENFJ هم کودکانشان را بسیار همدل می‌دانند. حتی این گرایش در برخی موارد از حد می‌گذرد و والدین در اثر عواطف قدرتمندی که دیگران در کودکانشان بر می‌انگیزند؛ جا می‌خورند. این کودکان بسیار بخشنده و حمایتگر هستند ولی دیگران را درگیر مشکلات خودشان نمی‌کنند.</p>
                            <p>اگر کودکتان دارای شخصیت پیشرو است، او را در جهت مراقبت از دیگران در عین حمایت از بهزیستی عاطفی خودش سوق دهید</p>
                            <h6 class="my-5">روابط زناشویی ENFJ</h6>
                            <p>از آنجا که تیپ‌های ENFJ نسبت به احساسات دیگران بسیار حساس هستند؛ پس شادکامی شما وابستگی زیادی به شادکامی همسرتان دارد. حواستان را جمع کنید؛ شاید همسرتان به خاطر تأمین نیازهای شما دیگر به نیازها خودش اهمیت ندهد</p>
                            <p>همسر ENFJ باید بداند که قدر مراقبت‌ها و حمایت‌هایش را می‌دانید و می‌خواهید همین کار را در قبالش انجام دهید. هر چند آنها با ابراز تقاضای کمک هم مشکل دارند.</p>
                        @elseif($scoreArray['mbti'] == 'entp')
                            <h6 class="my-5">دوستی ENTP</h6>
                            <p>تیپ‌های ENTP به خوبی با هر تیپ شخصیتی کنار می‌آیند. با اینکه خیلی راحت هستند ولی کاملاً به طور رقابتی عمل می‌کنند. اگر دوست ENTP دارید؛ پس سعی نکنید تا از یکدیگر سبقت بگیرید. آن‌ها عاشق بحث هستند پس مراقب باشید که بحث‌های عادی به مبارزات خشن تبدیل نشود.</p>

                            <h6 class="my-5">والدگری ENTP</h6>
                            <p>والدین ENTP عاشق سرگرمی هستند و از در میان گذاشتن هیجاناتشان با کودکانشان، لذت می‌برند. این والدین، افرادی حمایتگر هستند؛ ولی می‌خواهند هر موقعیتی را به فرصت یادگیری تبدیل کنند</p>
                            <p>والدین کودکان ENTP باید از مجادله گری کودکانشان آگاه بوده و آن را به حساب علاقمندی آن‌ها به بحث و گفتگو بگذارند. شاید این کودکان در برخی مواقع دمدمی مزاج به نظر برسند. یعنی گاهی اوقات خونگرم و مهربان باشند و لحظه دیگری که به فکر ایده جدیدی می افتند؛ منزوی می‌شوند. والدین باید این کودکان را در جهت تمرکز روی اهدافشان و اتمام کارهای نیمه تمام، تشویق نمایند.</p>

                            <h6 class="my-5">روابط زناشویی ENTP</h6>
                            <p>تیپ شخصیتی ENTP می‌تواند در طول روابط صمیمانه، پرشور و هیجان رفتار کند. آن‌ها افرادی خونگرم و دوست داشتنی هستند که نیازهای شریک زندگی خودشان را به خوبی درک می‌کنند. شاید وفای به عهدها و قول‌ها برایشان دشوار شود؛ که این امر گاهی اوقات باعث ناامیدی طرف مقابل می‌شود.</p>
                            <p>باید بدانید که همسر ENTP نیازمند خود انگیختگی است. می‌توانید از نظر هیجانی و عملی به همسرتان در جهت رسیدن به اهدافش کمک کنید تا بتواند تکانشگری خودش را تحت کنترل درآورد.</p>
                        @elseif($scoreArray['mbti'] == 'istp')
                            <h6 class="my-5">دوستی ISTP</h6>
                            <p>تیپ‌های ISTP کنجکاو و ماجراجو هستند ولی به تنهایی هم نیاز دارند. اگر از آنها بخواهید که با شما بیرون بیایند و کارهای جدید را با هم امتحان کنید به دوست خوبی برایشان تبدیل می‌شوید؛ ولی باید نیاز آنها به آرامش و سکوت در هنگامیکه حس بیرون رفتن ندارند را درک کنید.</p>

                            <h6 class="my-5">والدگری ISTP</h6>
                            <p>اگر والد کودک ISTP هستید؛ پس به خوبی ماهیت مستقل و ماجراجوی این کودک را می‌شناسید. می‌توانید با تأمین شرایط امن و سالم در جهت ماجراجویی، حس اعتماد به نفسشان را تقویت کنید. قوانین و راهنمایی را ارائه کنید ولی خیلی آنها را محدود نکنید. امکان یادگیری عملی، ماجراجویی در بیرون از خانه و فرصت آشنایی با عملکرد وسایل مختلف را برایشان فراهم کنید.</p>

                            <h6 class="my-5">روابط زناشویی ISTP</h6>
                            <p>از آنجا که ISTP ها در زمان حال زندگی می‌کنند؛ پس تعهدات بلند مدت برایشان در حکم یک چالش واقعی است. با بررسی کارها به صورت روزانه و جدی گرفتن حس استقلال طلبی همسر ISTP می‌توانید به رابطه زناشویی قدرمندی برسید.</p>
                        @endif
                    </div>
                </div>

                <a href="{{ route('home') }}" class="btn bg-first-100">برگشت به صفحه اصلی</a>
            </div>
        </div>
    </div>
@endsection

@section('js')
    <script src="{{ asset('assets/libs/chart-js/Chart.bundle.min.js') }}"></script>
    <script>
        const radar = document.getElementById('radar');
        const data = {
            labels: {!! json_encode(array_keys($scoreArray),JSON_UNESCAPED_UNICODE) !!},
            datasets: [{
                label: 'تایپ شخصیتی',
                data: {{ json_encode(array_values($scoreArray)) }},
                fill: true,
                backgroundColor: 'rgba(255, 99, 132, 0.2)',
                borderColor: 'rgb(255, 99, 132)',
                pointBackgroundColor: 'rgb(255, 99, 132)',
                pointBorderColor: '#fff',
                pointHoverBackgroundColor: '#fff',
                pointHoverBorderColor: 'rgb(255, 99, 132)'
            }]
        };
        new Chart(radar, {
            type: 'radar',
            data: data,
            options: {
                elements: {
                    line: {
                        borderWidth: 3
                    }
                }
            },
        });
    </script>
    <script>
        function updateSegmentOpacities(score) {
            const text = document.querySelector('text#text');
            const segments = document.querySelectorAll("#chart-iq path");
            segments.forEach((segment) => {
                const segmentValue = parseInt(segment.getAttribute("data-value"), 10);
                segment.setAttribute("fill-opacity", score >= segmentValue ? 1 : 0.15);
            });

            text.textContent = score;
        }

        const score = parseInt(
            document.getElementById("chart-iq").getAttribute("data-score"),
            10
        );
        updateSegmentOpacities(score);

    </script>
@endsection
