@extends('home::layouts.master')

@section('title','آزمون های هدایت شغلی')
<meta name="description" content="آزمون های هدایت شغلی کارآمد شامل آزمون شخصیت شناسی ، آزمون
استعدادیابی شغلی و تحصیلی ، آزمون هوش کاربر دی و هوش هیجانی میباشد
که در ترسیم مسیر شغلی شما مورد استفاده قرار میگیرد ">
<meta name="keywords" content="آزمون های هدایت شغلی">
@section('content')
    <section class="container test-pages-body">
        <div class="test-pages__content">
            <div class="test-pages__boxes-container">
                <a href="{{ route('test.mbti') }}" class="test-pages__box">
                    <div class="test-pages__box-text">
                        <h2>
                            <strong>تست شخصیت شناسی MBTI</strong>
                        </h2>
                        <p>
                            با تست شخصیت، نقاط قوت و ضعف خود را بشناسید. در انتخاب شغل،
                            روابط و تصمیم‌گیری‌های مهم زندگی، بهترین انتخاب‌ها را داشته
                            باشید. خودشناسی، راهنمای شماست!
                        </p>
                    </div>
                    <div class="test-pages__box-image">
                        <img src="{{ asset('assets-front/img/mbti.svg') }}" alt="mbti test picture"/>
                    </div>
                </a>
                <a href="{{ route('test.raven') }}" class="test-pages__box">
                    <div class="test-pages__box-text">
                        <h2>
                            <strong>تست ریون</strong>
                        </h2>
                        <p>
                            با تست شخصیت، نقاط قوت و ضعف خود را بشناسید. در انتخاب شغل،
                            روابط و تصمیم‌گیری‌های مهم زندگی، بهترین انتخاب‌ها را داشته
                            باشید. خودشناسی، راهنمای شماست!
                        </p>
                    </div>
                    <div class="test-pages__box-image">
                        <img src="{{ asset('assets-front/img/raven.svg') }}" alt="mbti test picture"/>
                    </div>
                </a>
                <a href="{{ route('test.eq') }}" class="test-pages__box">
                    <div class="test-pages__box-text">
                        <h2>
                            <strong>تست هوش هیجانی EQ</strong>
                        </h2>
                        <p>
                            با تست شخصیت، نقاط قوت و ضعف خود را بشناسید. در انتخاب شغل،
                            روابط و تصمیم‌گیری‌های مهم زندگی، بهترین انتخاب‌ها را داشته
                            باشید. خودشناسی، راهنمای شماست!
                        </p>
                    </div>
                    <div class="test-pages__box-image">
                        <img src="{{ asset('assets-front/img/job.svg') }}" alt="mbti test picture"/>
                    </div>
                </a>
                <a href="{{ route('test.holland') }}" class="test-pages__box">
                    <div class="test-pages__box-text">
                        <h2>
                            <strong>تست استعدادیابی شغلی هالند</strong>
                        </h2>
                        <p>
                            با تست شخصیت، نقاط قوت و ضعف خود را بشناسید. در انتخاب شغل،
                            روابط و تصمیم‌گیری‌های مهم زندگی، بهترین انتخاب‌ها را داشته
                            باشید. خودشناسی، راهنمای شماست!
                        </p>
                    </div>
                    <div class="test-pages__box-image">
                        <img src="{{ asset('assets-front/img/abilities.svg') }}" alt="mbti test picture"/>
                    </div>
                </a>
                {{--                <div class="test-pages__box">--}}
                {{--                    <div class="test-pages__box-text">--}}
                {{--                        <h2>--}}
                {{--                            <strong>تست شخصیت شناسی</strong>--}}
                {{--                        </h2>--}}
                {{--                        <p>--}}
                {{--                            با تست شخصیت، نقاط قوت و ضعف خود را بشناسید. در انتخاب شغل،--}}
                {{--                            روابط و تصمیم‌گیری‌های مهم زندگی، بهترین انتخاب‌ها را داشته--}}
                {{--                            باشید. خودشناسی، راهنمای شماست!--}}
                {{--                        </p>--}}
                {{--                    </div>--}}
                {{--                    <div class="test-pages__box-image">--}}
                {{--                        <img src="{{ asset('assets-front/img/mbti.svg') }}" alt="mbti test picture" />--}}
                {{--                    </div>--}}
                {{--                </div>--}}
            </div>
            {{--            <div class="test-pages__description">--}}
            {{--                <div class="test-pages__description-mbti">--}}
            {{--                    <div class="d-flex flex-column gap-4">--}}
            {{--                        <h2>تست MBTI: سفری به درون شخصیت خود</h2>--}}
            {{--                        <div class="d-flex flex-column gap-2">--}}
            {{--                            <h3>تست MBTI چیست؟</h3>--}}
            {{--                            <p>--}}
            {{--                                تست MBTI (Myers-Briggs Type Indicator) یکی از شناخته‌شده‌ترین--}}
            {{--                                و پرکاربردترین ابزارهای سنجش شخصیت در جهان است. این تست بر--}}
            {{--                                اساس نظریات کارل یونگ، روان‌شناس سوئیسی، طراحی شده و به افراد--}}
            {{--                                کمک می‌کند تا به درک عمیق‌تری از ویژگی‌های شخصیتی خود برسند.--}}
            {{--                            </p>--}}
            {{--                        </div>--}}
            {{--                        <div class="d-flex flex-column gap-2">--}}
            {{--                            <h3>اصول اولیه تست MBTI</h3>--}}
            {{--                            <h4 class="mt-3">--}}
            {{--                                تست MBTI بر اساس چهار ترجیح ذهنی اصلی افراد بنا شده است:--}}
            {{--                            </h4>--}}
            {{--                            <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                                <li class="d-flex flex-row">--}}
            {{--                                    <span>برون‌گرایی (E) یا درون‌گرایی (I):</span>--}}
            {{--                                    <span--}}
            {{--                                    >نشان می‌دهد که فرد انرژی خود را از کجا می‌گیرد؛ از تعامل--}}
            {{--                      با دیگران (برون‌گرا) یا از درون خود (درون‌گرا).</span--}}
            {{--                                    >--}}
            {{--                                </li>--}}
            {{--                                <li class="d-flex flex-row">--}}
            {{--                                    <span>حسی (S) یا شهودی (N):</span>--}}
            {{--                                    <span--}}
            {{--                                    >نحوه دریافت اطلاعات را نشان می‌دهد؛ از طریق حواس پنج‌گانه--}}
            {{--                      (حسی) یا از طریق الگوها و مفاهیم (شهودی).</span--}}
            {{--                                    >--}}
            {{--                                </li>--}}
            {{--                                <li class="d-flex flex-row">--}}
            {{--                                    <span>تفکری (T) یا احساسی (F):</span>--}}
            {{--                                    <span--}}
            {{--                                    >نحوه تصمیم‌گیری را نشان می‌دهد؛ بر اساس منطق و تحلیل--}}
            {{--                      (تفکری) یا بر اساس ارزش‌ها و احساسات (احساسی).</span--}}
            {{--                                    >--}}
            {{--                                </li>--}}
            {{--                                <li class="d-flex flex-row">--}}
            {{--                                    <span>قضاوت‌گرایی (J) یا ادراکی (P):</span>--}}
            {{--                                    <span>--}}
            {{--                      نشان می‌دهد که فرد چگونه با دنیای بیرون تعامل می‌کند؛--}}
            {{--                      ترجیح می‌دهد مسائل را سازماندهی کند و تصمیم بگیرد--}}
            {{--                      (قضاوت‌گرا) یا ترجیح می‌دهد انعطاف‌پذیر باشد و گزینه‌های--}}
            {{--                      مختلف را بررسی کند (ادراکی).</span--}}
            {{--                                    >--}}
            {{--                                </li>--}}
            {{--                            </ul>--}}
            {{--                            <p>--}}
            {{--                                با ترکیب این چهار ترجیح، 16 تیپ شخصیتی مختلف ایجاد می‌شود که--}}
            {{--                                هر کدام ویژگی‌ها و ترجیحات منحصر به فرد خود را دارند.--}}
            {{--                            </p>--}}
            {{--                        </div>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>تاریخچه تست MBTI</h2>--}}
            {{--                        <p>--}}
            {{--                            تست MBTI در دهه 1940 توسط ایسابل مایرز و دخترش کاترین بریگز--}}
            {{--                            طراحی شد. آن‌ها با الهام از نظریات کارل یونگ، این تست را به--}}
            {{--                            عنوان ابزاری برای کمک به زنان وارد بازار کار شدند. با گذشت زمان،--}}
            {{--                            تست MBTI به یکی از محبوب‌ترین ابزارهای سنجش شخصیت در دنیای--}}
            {{--                            کسب‌وکار، آموزش و روان‌شناسی تبدیل شد.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>نحوه انجام تست MBTI</h2>--}}
            {{--                        <p>--}}
            {{--                            تست MBTI معمولاً به صورت پرسشنامه‌ای طراحی می‌شود که شامل--}}
            {{--                            مجموعه‌ای از سوالات دو گزینه ای است. هر سوال دو گزینه متضاد را--}}
            {{--                            ارائه می‌دهد که نشان‌دهنده یکی از ترجیحات چهارگانه است. با پاسخ--}}
            {{--                            دادن به این سوالات، فرد به یکی از 16 تیپ شخصیتی تعلق می‌گیرد.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>مزایای استفاده از تست MBTI</h2>--}}
            {{--                        <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>خودشناسی:</span>--}}
            {{--                                <span--}}
            {{--                                >تست MBTI به افراد کمک می‌کند تا ویژگی‌های شخصیتی خود را--}}
            {{--                    بهتر بشناسند و نقاط قوت و ضعف خود را شناسایی کنند.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>ارتباطات بهتر:</span>--}}
            {{--                                <span--}}
            {{--                                >با شناخت تیپ شخصیتی خود و دیگران، می‌توان ارتباطات مؤثرتر و--}}
            {{--                     کارآمدتری برقرار کرد.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>توسعه فردی:</span>--}}
            {{--                                <span--}}
            {{--                                >تست MBTI می‌تواند به افراد در انتخاب شغل مناسب، بهبود روابط--}}
            {{--                    بین فردی و رشد شخصی کمک کند.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>تیم‌سازی:</span>--}}
            {{--                                <span--}}
            {{--                                >در محیط‌های کاری، تست MBTI می‌تواند برای ایجاد تیم‌های--}}
            {{--                    مؤثرتر و افزایش همکاری بین اعضای تیم استفاده شود.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                        </ul>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>نتیجه‌گیری</h2>--}}
            {{--                        <p>--}}
            {{--                            تست MBTI ابزاری ارزشمند برای خودشناسی و توسعه فردی است. با این--}}
            {{--                            حال، مهم است که به یاد داشته باشیم که این تست تنها یک ابزار است--}}
            {{--                            و نباید به عنوان یک برچسب ثابت برای شخصیت افراد استفاده شود.--}}
            {{--                            برای درک کامل خود، بهتر است از منابع مختلف و مشورت با متخصصان--}}
            {{--                            نیز استفاده کنیم.--}}
            {{--                        </p>--}}
            {{--                        <p>--}}
            {{--                            توجه: این متن تنها یک معرفی کلی از تست MBTI است و برای اطلاعات--}}
            {{--                            دقیق‌تر، بهتر است به منابع معتبر مراجعه کنید.--}}
            {{--                        </p>--}}
            {{--                        <p>--}}
            {{--                            آیا می‌خواهید در مورد یک تیپ شخصیتی خاص یا کاربردهای خاص تست--}}
            {{--                            MBTI اطلاعات بیشتری کسب کنید؟--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                </div>--}}
            {{--                <div class="test-pages__description-mbti">--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>تست ریون: پنجره‌ای به سوی هوش سیال</h2>--}}
            {{--                        <p>--}}
            {{--                            تست ریون یا ماتریس‌های پیش‌رونده ریون یکی از مشهورترین و--}}
            {{--                            پرکاربردترین ابزارهای سنجش هوش غیرکلامی است. این تست، توانایی--}}
            {{--                            استدلال قیاسی، درک مفاهیم انتزاعی و تشخیص الگوها را مورد سنجش--}}
            {{--                            قرار می‌دهد. به عبارت ساده‌تر، تست ریون به ما نشان می‌دهد که مغز--}}
            {{--                            ما چقدر خوب می‌تواند الگوها را شناسایی کرده و آن‌ها را به--}}
            {{--                            وضعیت‌های جدید تعمیم دهد.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>تاریخچه‌ای مختصر</h2>--}}
            {{--                        <p>--}}
            {{--                            تست ریون در دهه 1930 توسط جان سی. ریون، روان‌شناس انگلیسی، طراحی--}}
            {{--                            شد. هدف او ایجاد تستی بود که بتواند هوش عمومی را بدون وابستگی به--}}
            {{--                            زبان و فرهنگ اندازه‌گیری کند. به همین دلیل، تست ریون از تصاویر و--}}
            {{--                            شکل‌ها استفاده می‌کند و نیاز به خواندن و نوشتن ندارد.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>نحوه انجام تست</h2>--}}
            {{--                        <p>--}}
            {{--                            تست ریون شامل مجموعه‌ای از ماتریس‌ها است. در هر ماتریس، بخشی از--}}
            {{--                            تصویر ناقص است. وظیفه آزمودنی این است که از بین گزینه‌های داده--}}
            {{--                            شده، قسمت گم شده را پیدا کرده و انتخاب کند. با پیشرفت در تست،--}}
            {{--                            ماتریس‌ها پیچیده‌تر می‌شوند و نیاز به استدلال‌های پیچیده‌تری--}}
            {{--                            دارند.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>مزایای تست ریون</h2>--}}
            {{--                        <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>سادگی و روایی:</span>--}}
            {{--                                <span--}}
            {{--                                >تست ریون به دلیل سادگی و روایی بالا، یکی از محبوب‌ترین--}}
            {{--                    ابزارهای سنجش هوش است.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>عدم وابستگی به فرهنگ و زبان:</span>--}}
            {{--                                <span--}}
            {{--                                >این تست برای افراد با فرهنگ‌ها و زبان‌های مختلف قابل--}}
            {{--                    استفاده است.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>سنجش هوش سیال:</span>--}}
            {{--                                <span--}}
            {{--                                >هوش سیال یکی از مهم‌ترین جنبه‌های هوش است و تست ریون به--}}
            {{--                    خوبی آن را می‌سنجد.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>کاربرد گسترده:</span>--}}
            {{--                                <span--}}
            {{--                                >در زمینه‌های مختلفی مانند روانشناسی، آموزش، استخدام و--}}
            {{--                    تحقیقات مورد استفاده قرار می‌گیرد.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                        </ul>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>کاربردهای تست ریون</h2>--}}
            {{--                        <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>ارزیابی هوش:</span>--}}
            {{--                                <span>--}}
            {{--                    برای ارزیابی هوش افراد در زمینه‌های مختلف مانند آموزش،--}}
            {{--                    استخدام و تحقیقات.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>تشخیص اختلالات یادگیری:</span>--}}
            {{--                                <span--}}
            {{--                                >برای تشخیص اختلالات یادگیری و شناسایی کودکان با--}}
            {{--                    استعداد.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>پژوهش‌های روانشناسی:</span>--}}
            {{--                                <span--}}
            {{--                                >برای مطالعه فرآیندهای شناختی و توسعه نظریه‌های هوش.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                        </ul>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>ویژگی‌های تست ریون</h2>--}}
            {{--                        <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>غیرکلامی بودن:</span>--}}
            {{--                                <span--}}
            {{--                                >تست ریون از تصاویر و شکل‌های هندسی استفاده می‌کند و نیاز به--}}
            {{--                    دانش زبانی ندارد.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>سنجش هوش سیال:</span>--}}
            {{--                                <span--}}
            {{--                                >این تست عمدتاً هوش سیال را می‌سنجد که توانایی حل مسائل جدید--}}
            {{--                    و استفاده از منطق برای استدلال است.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>مناسب برای همه سنین:</span>--}}
            {{--                                <span--}}
            {{--                                >تست ریون برای افراد با سنین و فرهنگ‌های مختلف قابل استفاده--}}
            {{--                    است.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>کاربرد گسترده:</span>--}}
            {{--                                <span--}}
            {{--                                >در زمینه‌های مختلفی مانند روانشناسی، آموزش، استخدام و--}}
            {{--                    تحقیقات مورد استفاده قرار می‌گیرد.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                        </ul>--}}
            {{--                    </div>--}}
            {{--                    <p>--}}
            {{--                        در کل، تست ریون یک ابزار ارزشمند برای سنجش توانایی‌های شناختی است.--}}
            {{--                        با این حال، برای ارزیابی کامل هوش یک فرد، بهتر است از چندین ابزار--}}
            {{--                        سنجش استفاده شود.--}}
            {{--                    </p>--}}
            {{--                </div>--}}
            {{--                <div class="test-pages__description-mbti">--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>تست هالند: نقشه راهی برای کشف علاقه‌های شغلی</h2>--}}
            {{--                        <p>--}}
            {{--                            تست هالند یا آزمون هالند یکی از ابزارهای پرکاربرد در حوزه--}}
            {{--                            روان‌شناسی شغلی است که به افراد کمک می‌کند تا علاقه‌ها و--}}
            {{--                            توانایی‌های شغلی خود را بهتر بشناسند. این تست بر اساس نظریه جان--}}
            {{--                            هالند، روان‌شناس آمریکایی، طراحی شده است که معتقد بود افراد--}}
            {{--                            تمایل دارند مشاغلی را انتخاب کنند که با شخصیت و علایق آن‌ها--}}
            {{--                            سازگاری داشته باشد.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>تاریخچه‌ای مختصر</h2>--}}
            {{--                        <p>--}}
            {{--                            جان هالند، نظریه خود را بر اساس این فرضیه بنا نهاد که افراد با--}}
            {{--                            توجه به شخصیت و علایق خود، به شش گروه اصلی تقسیم می‌شوند. این شش--}}
            {{--                            گروه عبارتند از: واقع‌گرا، پژوهشگر، هنری، اجتماعی، متقاعدکننده و--}}
            {{--                            سنتی. تست هالند به افراد کمک می‌کند تا بفهمند کدام یک از این شش--}}
            {{--                            گروه، بیشترین تطابق را با شخصیت آن‌ها دارد.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>نحوه انجام تست</h2>--}}
            {{--                        <p>--}}
            {{--                            تست هالند معمولاً به صورت پرسشنامه‌ای طراحی می‌شود که شامل--}}
            {{--                            مجموعه‌ای از سوالات در مورد علایق، ارزش‌ها و فعالیت‌های مورد--}}
            {{--                            علاقه فرد است. با پاسخ دادن به این سوالات، فرد به یکی از شش تیپ--}}
            {{--                            شخصیتی هالند نزدیک‌تر می‌شود.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>ویژگی‌های تست هالند</h2>--}}
            {{--                        <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>شش تیپ شخصیتی:</span>--}}
            {{--                                <span--}}
            {{--                                >تست هالند، افراد را به شش تیپ شخصیتی واقع‌گرا، پژوهشگر،--}}
            {{--                    هنری، اجتماعی، متقاعدکننده و سنتی تقسیم می‌کند.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>سادگی و روایی:</span>--}}
            {{--                                <span--}}
            {{--                                >این تست به دلیل سادگی و روایی بالا، یکی از محبوب‌ترین--}}
            {{--                    ابزارهای سنجش علاقه‌های شغلی است.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>کاربرد گسترده:</span>--}}
            {{--                                <span--}}
            {{--                                >در زمینه‌های مختلفی مانند مشاوره شغلی، انتخاب رشته و توسعه--}}
            {{--                    فردی مورد استفاده قرار می‌گیرد.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>انعطاف‌پذیری:</span>--}}
            {{--                                <span--}}
            {{--                                >نتایج تست هالند به افراد کمک می‌کند تا طیف وسیعی از مشاغل--}}
            {{--                    مرتبط با شخصیت خود را شناسایی کنند.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                        </ul>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>مزایای تست هالند</h2>--}}
            {{--                        <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>خودشناسی:</span>--}}
            {{--                                <span--}}
            {{--                                >تست هالند به افراد کمک می‌کند تا خودشناسی بهتری پیدا کرده و--}}
            {{--                    علایق و توانایی‌های خود را بشناسند.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>انتخاب شغل مناسب:</span>--}}
            {{--                                <span--}}
            {{--                                >با شناخت تیپ شخصیتی خود، افراد می‌توانند مشاغلی را انتخاب--}}
            {{--                    کنند که با شخصیت و علایق آن‌ها سازگاری بیشتری دارد.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>افزایش رضایت شغلی:</span>--}}
            {{--                                <span--}}
            {{--                                >انتخاب شغلی مناسب، منجر به افزایش رضایت شغلی و کاهش استرس--}}
            {{--                    می‌شود.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>توسعه فردی:</span>--}}
            {{--                                <span--}}
            {{--                                >تست هالند می‌تواند به افراد کمک کند تا در مسیر توسعه فردی--}}
            {{--                    خود گام بردارند.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                        </ul>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>کاربردهای تست هالند</h2>--}}
            {{--                        <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>مشاوره شغلی:</span>--}}
            {{--                                <span--}}
            {{--                                >برای کمک به افراد در انتخاب رشته تحصیلی و شغل مناسب.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>توسعه فردی:</span>--}}
            {{--                                <span>برای افزایش خودآگاهی و بهبود مهارت‌های شغلی.</span>--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>استخدام:</span>--}}
            {{--                                <span>برای ارزیابی تناسب افراد با شغل‌های مختلف.</span>--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>توسعه فردی:</span>--}}
            {{--                                <span--}}
            {{--                                >تست هالند می‌تواند به افراد کمک کند تا در مسیر توسعه فردی--}}
            {{--                    خود گام بردارند.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                        </ul>--}}
            {{--                    </div>--}}
            {{--                    <p>--}}
            {{--                        در کل، تست هالند یک ابزار مفید برای شناخت بهتر خود و انتخاب مسیر--}}
            {{--                        شغلی مناسب است. با این حال، بهتر است نتایج این تست را با سایر--}}
            {{--                        اطلاعات و مشاوره‌های تخصصی ترکیب کنید.--}}
            {{--                    </p>--}}
            {{--                </div>--}}
            {{--                <div class="test-pages__description-mbti">--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>تست استرانگ: نقشه راهی برای کشف علایق شغلی</h2>--}}
            {{--                        <p>--}}
            {{--                            تست استرانگ یا آزمون رغبت‌سنج استرانگ یکی از ابزارهای پرکاربرد--}}
            {{--                            در حوزه روان‌شناسی شغلی است که به افراد کمک می‌کند تا علایق و--}}
            {{--                            توانایی‌های شغلی خود را بهتر بشناسند. این تست با هدف کمک به--}}
            {{--                            افراد برای انتخاب رشته تحصیلی و شغل مناسب طراحی شده است.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>تاریخچه‌ای مختصر</h2>--}}
            {{--                        <p>--}}
            {{--                            تست استرانگ اولین بار در دهه 1920 توسط ادوارد استرانگ توسعه داده--}}
            {{--                            شد. این تست در طول سال‌ها به روزرسانی شده و نسخه‌های مختلفی از--}}
            {{--                            آن برای گروه‌های سنی و مشاغل مختلف طراحی شده است. هدف اصلی تست--}}
            {{--                            استرانگ، تطبیق علایق فرد با مشاغل مختلف است تا افراد بتوانند--}}
            {{--                            شغلی را انتخاب کنند که از انجام آن لذت ببرند و در آن موفق باشند.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>نحوه انجام تست</h2>--}}
            {{--                        <p>--}}
            {{--                            تست استرانگ معمولاً به صورت آنلاین یا کاغذی انجام می‌شود و شامل--}}
            {{--                            مجموعه‌ای از سوالات چندگزینه‌ای است. در این سوالات، از فرد--}}
            {{--                            خواسته می‌شود تا میزان علاقه خود را به فعالیت‌های مختلف، مشاغل و--}}
            {{--                            ویژگی‌های شخصیتی مشخص کند.--}}
            {{--                        </p>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>ویژگی‌های تست استرانگ</h2>--}}
            {{--                        <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>جامعیت:</span>--}}
            {{--                                <span--}}
            {{--                                >تست استرانگ طیف گسترده‌ای از مشاغل، فعالیت‌ها و ویژگی‌های--}}
            {{--                    شخصیتی را پوشش می‌دهد.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>روایی و پایایی:</span>--}}
            {{--                                <span--}}
            {{--                                >این تست دارای روایی و پایایی بالایی است، به این معنی که--}}
            {{--                    نتایج آن قابل اعتماد و قابل تعمیم به موقعیت‌های واقعی--}}
            {{--                    است.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>تفسیر دقیق:</span>--}}
            {{--                                <span--}}
            {{--                                >نتایج تست استرانگ توسط مشاوران شغلی تفسیر می‌شود و به افراد--}}
            {{--                    کمک می‌کند تا درک عمیق‌تری از علایق و توانایی‌های خود پیدا--}}
            {{--                    کنند.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>شخصی‌سازی:</span>--}}
            {{--                                <span--}}
            {{--                                >نتایج تست استرانگ برای هر فرد به صورت شخصی ارائه می‌شود و--}}
            {{--                    شامل توصیه‌هایی برای انتخاب رشته تحصیلی و شغل مناسب--}}
            {{--                    است.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                        </ul>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>مزایای تست استرانگ</h2>--}}
            {{--                        <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>خودشناسی:</span>--}}
            {{--                                <span--}}
            {{--                                >تست استرانگ به افراد کمک می‌کند تا خودشناسی بهتری پیدا کرده--}}
            {{--                    و علایق و توانایی‌های خود را بشناسند.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>انتخاب شغل مناسب:</span>--}}
            {{--                                <span--}}
            {{--                                >با شناخت علایق و توانایی‌های خود، افراد می‌توانند شغلی را--}}
            {{--                    انتخاب کنند که با شخصیت و اهداف آن‌ها سازگاری بیشتری--}}
            {{--                    دارد.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>افزایش رضایت شغلی:</span>--}}
            {{--                                <span--}}
            {{--                                >انتخاب شغلی مناسب، منجر به افزایش رضایت شغلی و کاهش استرس--}}
            {{--                    می‌شود.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>کاهش اشتباهات در انتخاب شغل:</span>--}}
            {{--                                <span--}}
            {{--                                >تست استرانگ به افراد کمک می‌کند تا از انتخاب شغلی نامناسب--}}
            {{--                    جلوگیری کنند.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                        </ul>--}}
            {{--                    </div>--}}
            {{--                    <div class="d-flex flex-column gap-3">--}}
            {{--                        <h2>کاربردهای تست استرانگ</h2>--}}
            {{--                        <ul class="d-flex flex-column gap-3 pe-4 my-4">--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>مشاوره شغلی:</span>--}}
            {{--                                <span--}}
            {{--                                >برای کمک به افراد در انتخاب رشته تحصیلی و شغل مناسب.</span--}}
            {{--                                >--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>توسعه فردی:</span>--}}
            {{--                                <span>برای افزایش خودآگاهی و بهبود مهارت‌های شغلی.</span>--}}
            {{--                            </li>--}}
            {{--                            <li class="d-flex flex-row">--}}
            {{--                                <span>استخدام:</span>--}}
            {{--                                <span>برای ارزیابی تناسب افراد با شغل‌های مختلف.</span>--}}
            {{--                            </li>--}}
            {{--                        </ul>--}}
            {{--                    </div>--}}
            {{--                    <p>--}}
            {{--                        در کل، تست استرانگ یک ابزار ارزشمند برای شناخت بهتر خود و انتخاب--}}
            {{--                        مسیر شغلی مناسب است. با این حال، بهتر است نتایج این تست را با سایر--}}
            {{--                        اطلاعات و مشاوره‌های تخصصی ترکیب کنید.--}}
            {{--                    </p>--}}
            {{--                </div>--}}
            {{--            </div>--}}
        </div>
        <aside class="test-pages__sidebar">
            <div class="sticky-box">
                <div class="sticky-box-image">
                    <img src="{{ asset('assets-front/img/tests.webp') }}" alt="tests-picture"/>
                </div>
                <div class="sticky-box-contact">
                    <span>برای اطلاعات بیشتر تماس بگیرید</span>
                    <span>هر روز هفته از ساعت 9 صبح تا 16 بعدازظهر پاسخگوی شما عزیزان
              هستیم</span>
                </div>
            </div>
        </aside>
    </section>
@endsection

@section('js')

@endsection
